antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/*
 * Copyright (C) 2021-2022 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 * @file     DA1470x-00.h
 * @brief    CMSIS HeaderFile
 * @version  1.2
 * @date     18. October 2022
 * @note     Generated by SVDConv V3.3.27 on Monday, 31.10.2022 16:08:50
 * XXX       from File 'config/embsys/Dialog_Semiconductor/DA1470x-00.xml',
 *           last modified on Tuesday, 18.10.2022 13:09:15
 */



/** @addtogroup PLA_BSP_REGISTERS
  * @{
  */


/** @addtogroup DA1470x
  * @{
  */


#ifndef DA1470X_H
#define DA1470X_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

/**
 * @brief Interrupt Number Definition
 */

#if (MAIN_PROCESSOR_BUILD)

typedef enum {
/* =======================================  ARM Cortex-M33 Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SecureFault_IRQn          =  -9,              /*!< -9 Secure Fault Handler                                                   */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  DA1470x Specific Interrupt Numbers  =========================================== */
  CMAC2SYS_IRQn             =   0,              /*!< 0  CMAC and mailbox interrupt request.                                    */
  SNC2SYS_IRQn              =   1,              /*!< 1  SNC M0+ interrupt to Cortex M33.                                       */
  M33_Cache_MRM_IRQn        =   2,              /*!< 2  CM33 Cache Miss Rate Monitor interrupt request.                        */
  PDC_M33_IRQn              =   3,              /*!< 3  Wakeup IRQ from PDC to CM33.                                           */
  KEY_WKUP_GPIO_IRQn        =   4,              /*!< 4  Debounced button press interrupt request.                              */
  VBUS_IRQn                 =   5,              /*!< 5  VBUS presence interrupt request.                                       */
  CHARGER_STATE_IRQn        =   6,              /*!< 6  Charger State interrupt request.                                       */
  CHARGER_ERROR_IRQn        =   7,              /*!< 7  Charger Error interrupt request.                                       */
  DCDC_BOOST_IRQn           =   8,              /*!< 8  DCDC boost controller interrupt request.                               */
  PLL48_LOCK_IRQn           =   9,              /*!< 9  PLL48 lock interrupt request. Indicates that the PLL48 is
                                                     locked at 48MHz.                                                          */
  CRYPTO_IRQn               =  10,              /*!< 10 Crypto interrupt request.                                              */
  PLL_LOCK_IRQn             =  11,              /*!< 11 PLL lock interrupt request. Indicates that PLL is locked
                                                     at 160MHz.                                                                */
  XTAL32M_RDY_IRQn          =  12,              /*!< 12 XTAL32M trimmed and ready interrupt request.                           */
  RFDIAG_IRQn               =  13,              /*!< 13 Baseband or Radio Diagnostics interrupt request.                       */
  GPIO_P0_IRQn              =  14,              /*!< 14 GPIO port 0 toggle interrupt request.                                  */
  GPIO_P1_IRQn              =  15,              /*!< 15 GPIO port 1 toggle interrupt request.                                  */
  GPIO_P2_IRQn              =  16,              /*!< 16 GPIO port 2 toggle interrupt request.                                  */
  TIMER_IRQn                =  17,              /*!< 17 TIMER interrupt request.                                               */
  TIMER2_IRQn               =  18,              /*!< 18 TIMER2 interrupt request.                                              */
  TIMER3_IRQn               =  19,              /*!< 19 TIMER3 interrupt request.                                              */
  TIMER4_IRQn               =  20,              /*!< 20 TIMER4 interrupt request.                                              */
  TIMER5_IRQn               =  21,              /*!< 21 TIMER5 interrupt request.                                              */
  TIMER6_IRQn               =  22,              /*!< 22 TIMER6 interrupt request.                                              */
  RTC_IRQn                  =  23,              /*!< 23 RTC interrupt request.                                                 */
  RTC_EVENT_IRQn            =  24,              /*!< 24 RTC event interrupt request.                                           */
  CAPTIMER_IRQn             =  25,              /*!< 25 GPIO triggered Timer Capture interrupt request.                        */
  ADC_IRQn                  =  26,              /*!< 26 General Purpose Analog-Digital Converter interrupt request.            */
  ADC2_IRQn                 =  27,              /*!< 27 Application Analog-Digital Converter interrupt request.                */
  DMA_IRQn                  =  28,              /*!< 28 General Purpose DMA interrupt request.                                 */
  UART_IRQn                 =  29,              /*!< 29 UART interrupt request.                                                */
  UART2_IRQn                =  30,              /*!< 30 UART2 interrupt request.                                               */
  UART3_IRQn                =  31,              /*!< 31 UART3 interrupt request.                                               */
  SPI_IRQn                  =  32,              /*!< 32 SPI interrupt request.                                                 */
  SPI2_IRQn                 =  33,              /*!< 33 SPI2 interrupt request.                                                */
  SPI3_IRQn                 =  34,              /*!< 34 SPI3 interrupt request.                                                */
  I2C_IRQn                  =  35,              /*!< 35 I2C interrupt request.                                                 */
  I2C2_IRQn                 =  36,              /*!< 36 I2C2 interrupt request.                                                */
  I2C3_IRQn                 =  37,              /*!< 37 I2C3 interrupt request.                                                */
  I3C_IRQn                  =  38,              /*!< 38 I3C interrupt request.                                                 */
  USB_IRQn                  =  39,              /*!< 39 USB interrupt request.                                                 */
  PCM_IRQn                  =  40,              /*!< 40 PCM interrupt request.                                                 */
  SRC_IN_IRQn               =  41,              /*!< 41 SRC input interrupt request.                                           */
  SRC_OUT_IRQn              =  42,              /*!< 42 SRC output interrupt request.                                          */
  SRC2_IN_IRQn              =  43,              /*!< 43 SRC2 input interrupt request.                                          */
  SRC2_OUT_IRQn             =  44,              /*!< 44 SRC2 output interrupt request.                                         */
  VAD_IRQn                  =  45,              /*!< 45 VAD interrupt request.                                                 */
  eMMC_IRQn                 =  46,              /*!< 46 eMMC controller interrupt request.                                     */
  SDIO_IRQn                 =  47,              /*!< 47 SDIO controller interrupt request.                                     */
  GPU_IRQn                  =  48,              /*!< 48 GPU interrupt request to Cortex M33.                                   */
  LCD_IRQn                  =  49,              /*!< 49 LCD controller interrupt request.                                      */
  DSI_IRQn                  =  50,              /*!< 50 DSI/D-PHY interrupt request.                                           */
  CHARGER_DET_IRQn          =  51,              /*!< 51 Charger detection interrupt request.                                   */
  DCACHE_MRM_IRQn           =  52,              /*!< 52 Data cache MRM interrupt request.                                      */
  CLK_CALIBRATION_IRQn      =  53,              /*!< 53 Clock calibration interrupt request.                                   */
  VSYS_GEN_IRQn             =  54,              /*!< 54 VSYS generator interrupt request.                                      */
  RESERVED55_IRQn           =  55               /*!< 55 SoftWare interrupt request.                                            */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

