antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ==========================  Configuration of the ARM Cortex-M33 Processor and Core Peripherals  =========================== */
#define __CM33_REV                 0x0002U      /*!< CM33 Core Revision                                                        */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */
#define __FPU_DP                       0        /*!< Double Precision FPU                                                      */
#define __DSP_PRESENT                  1        /*!< DSP extension present                                                     */
#define __SAUREGION_PRESENT            0        /*!< SAU region present                                                        */

#elif (SNC_PROCESSOR_BUILD)

typedef enum {
/* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
NMI_IRQn             = -14,                     /*!<  2 Non Maskable Interrupt.                                                */
HardFault_IRQn       = -13,                     /*!<  3 Cortex-M0 Hard Fault Interrupt.                                        */
SVCall_IRQn          =  -5,                     /*!< 11 Cortex-M0 SV Call Interrupt.                                           */
PendSV_IRQn          =  -2,                     /*!< 14 Cortex-M0 Pend SV Interrupt.                                           */
SysTick_IRQn         =  -1,                     /*!< 15 Cortex-M0 System Tick Interrupt.                                       */
/* =======================================  DA1470x SNC CM0+ Specific Interrupt Numbers  ===================================== */
SYS2SNC_IRQn         =  0,                      /*!< 0                                                                         */
CMAC2SNC_IRQn        =  1,                      /*!< 1                                                                         */
PDC_SNC_IRQn         =  2,                      /*!< 2                                                                         */
KEY_WKUP_GPIO_IRQn   =  3,                      /*!< 3                                                                         */
GPIO_P0_IRQn         =  4,                      /*!< 4                                                                         */
GPIO_P1_IRQn         =  5,                      /*!< 5                                                                         */
GPIO_P2_IRQn         =  6,                      /*!< 6                                                                         */
TIMER_IRQn           =  7,                      /*!< 7                                                                         */
TIMER3_IRQn          =  8,                      /*!< 8                                                                         */
TIMER4_IRQn          =  9,                      /*!< 9                                                                         */
TIMER5_IRQn          = 10,                      /*!< 10                                                                        */
TIMER6_IRQn          = 11,                      /*!< 11                                                                        */
RTC_IRQn             = 12,                      /*!< 12                                                                        */
RTC_EVENT_IRQn       = 13,                      /*!< 13                                                                        */
CAPTIMER_IRQn        = 14,                      /*!< 14                                                                        */
ADC_IRQn             = 15,                      /*!< 15                                                                        */
UART_IRQn            = 16,                      /*!< 16                                                                        */
UART2_IRQn           = 17,                      /*!< 17                                                                        */
UART3_IRQn           = 18,                      /*!< 18                                                                        */
SPI_IRQn             = 19,                      /*!< 19                                                                        */
SPI2_IRQn            = 20,                      /*!< 20                                                                        */
SPI3_IRQn            = 21,                      /*!< 21                                                                        */
I2C_IRQn             = 22,                      /*!< 22                                                                        */
I2C2_IRQn            = 23,                      /*!< 23                                                                        */
I2C3_IRQn            = 24,                      /*!< 24                                                                        */
I3C_IRQn             = 25,                      /*!< 25                                                                        */
PCM_IRQn             = 26,                      /*!< 26                                                                        */
SRC_IN_IRQn          = 27,                      /*!< 27                                                                        */
SRC_OUT_IRQn         = 28,                      /*!< 28                                                                        */
SRC2_IN_IRQn         = 29,                      /*!< 29                                                                        */
SRC2_OUT_IRQn        = 30,                      /*!< 30                                                                        */
VAD_IRQn             = 31                       /*!< 31                                                                        */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

