antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ==========================  Configuration of the ARM Cortex-M0+ Processor and Core Peripherals  =========================== */
#define __CM0_REV                 0x0000        /*!< Core Revision r2p1                                                        */
#define __NVIC_PRIO_BITS          2             /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig    0             /*!< Set to 1 if different SysTick Config is used                              */

#endif /* PROCESSOR_BUILD */

/** @} */ /* End of group Configuration_of_CMSIS */

#if (MAIN_PROCESSOR_BUILD)
#include "core_cm33.h"                          /*!< ARM Cortex-M33 processor and core peripherals                             */
#include "system_DA1470x.h"                     /*!< DA1470x System                                                            */
#elif (SNC_PROCESSOR_BUILD)
#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals                             */
#include "system_DA1470x-snc.h"                 /*!< DA1470x SNC                                                               */
#endif /* PROCESSOR_BUILD */

// non-core specific code:

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         AES_HASH                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief AES_HASH registers (AES_HASH)
  */

typedef struct {                                /*!< (@ 0x30040000) AES_HASH Structure                                         */
  __IOM uint32_t  CRYPTO_CTRL_REG;              /*!< (@ 0x00000000) Crypto Control register                                    */
  __IOM uint32_t  CRYPTO_START_REG;             /*!< (@ 0x00000004) Crypto Start calculation                                   */
  __IOM uint32_t  CRYPTO_FETCH_ADDR_REG;        /*!< (@ 0x00000008) Crypto DMA fetch register                                  */
  __IOM uint32_t  CRYPTO_LEN_REG;               /*!< (@ 0x0000000C) Crypto Length of the input block in bytes                  */
  __IOM uint32_t  CRYPTO_DEST_ADDR_REG;         /*!< (@ 0x00000010) Crypto DMA destination memory                              */
  __IOM uint32_t  CRYPTO_STATUS_REG;            /*!< (@ 0x00000014) Crypto Status register                                     */
  __IOM uint32_t  CRYPTO_CLRIRQ_REG;            /*!< (@ 0x00000018) Crypto Clear interrupt request                             */
  __IOM uint32_t  CRYPTO_MREG0_REG;             /*!< (@ 0x0000001C) Crypto Mode depended register 0                            */
  __IOM uint32_t  CRYPTO_MREG1_REG;             /*!< (@ 0x00000020) Crypto Mode depended register 1                            */
  __IOM uint32_t  CRYPTO_MREG2_REG;             /*!< (@ 0x00000024) Crypto Mode depended register 2                            */
  __IOM uint32_t  CRYPTO_MREG3_REG;             /*!< (@ 0x00000028) Crypto Mode depended register 3                            */
  __IM  uint32_t  RESERVED[53];
  __IOM uint32_t  CRYPTO_KEYS_START;            /*!< (@ 0x00000100) Crypto First position of the AES keys storage
                                                                    memory                                                     */
} AES_HASH_Type;                                /*!< Size = 260 (0x104)                                                        */



/* =========================================================================================================================== */
/* ================                                        ANAMISC_BIF                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief ANAMISC_BIF registers (ANAMISC_BIF)
  */

typedef struct {                                /*!< (@ 0x50050600) ANAMISC_BIF Structure                                      */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  CLK_REF_SEL_REG;              /*!< (@ 0x00000010) Select clock for oscillator calibration                    */
  __IOM uint32_t  CLK_REF_CNT_REG;              /*!< (@ 0x00000014) Count value for oscillator calibration                     */
  __IOM uint32_t  CLK_REF_VAL_REG;              /*!< (@ 0x00000018) DIVN reference cycles, lower 16 bits                       */
  __IOM uint32_t  CLK_CAL_IRQ_REG;              /*!< (@ 0x0000001C) Select clock for oscillator calibration                    */
} ANAMISC_BIF_Type;                             /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CACHE registers (CACHE)
  */

typedef struct {                                /*!< (@ 0x100C0000) CACHE Structure                                            */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  CACHE_CTRL2_REG;              /*!< (@ 0x00000020) Cache control register 2 (only Word (32-bits)
                                                                    access supported).                                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CACHE_MRM_HITS_REG;           /*!< (@ 0x00000028) Cache MRM (Miss Rate Monitor) HITS register (only
                                                                    Word (32-bits) access supported).                          */
  __IOM uint32_t  CACHE_MRM_MISSES_REG;         /*!< (@ 0x0000002C) Cache MRM (Miss Rate Monitor) MISSES register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_CTRL_REG;           /*!< (@ 0x00000030) Cache MRM (Miss Rate Monitor) CONTROL register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_TINT_REG;           /*!< (@ 0x00000034) Cache MRM (Miss Rate Monitor) TIME INTERVAL register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_MISSES_THRES_REG;   /*!< (@ 0x00000038) Cache MRM (Miss Rate Monitor) THRESHOLD register
                                                                    (only Word (32-bits) access supported).                    */
  __IOM uint32_t  CACHE_MRM_HITS_THRES_REG;     /*!< (@ 0x0000003C) Cache MRM (Miss Rate Monitor) HITS THRESHOLD
                                                                    register (only Word (32-bits) access supported).           */
  __IOM uint32_t  CACHE_FLASH_REG;              /*!< (@ 0x00000040) Cache QSPI Flash program size and base address
                                                                    register (only Word (32-bits) access supported).           */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  CACHE_MRM_HITS1WS_REG;        /*!< (@ 0x00000048) Cache MRM (Miss Rate Monitor) HITS with 1 Wait
                                                                    State register (only Word (32-bits) access
                                                                    supported).                                                */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  SWD_RESET_REG;                /*!< (@ 0x00000050) SWD HW reset control register (only Word (32-bits)
                                                                    access supported).                                         */
} CACHE_Type;                                   /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                          CHARGER                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CHARGER registers (CHARGER)
  */

typedef struct {                                /*!< (@ 0x51000600) CHARGER Structure                                          */
  __IOM uint32_t  CHARGER_CTRL_REG;             /*!< (@ 0x00000000) Charger main control register                              */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CHARGER_STATUS_REG;           /*!< (@ 0x00000008) Charger main status register                               */
  __IOM uint32_t  CHARGER_VOLTAGE_PARAM_REG;    /*!< (@ 0x0000000C) Charger voltage settings register                          */
  __IOM uint32_t  CHARGER_CURRENT_PARAM_REG;    /*!< (@ 0x00000010) Charger current settings register                          */
  __IOM uint32_t  CHARGER_VOLTAGE_STATUS_REG;   /*!< (@ 0x00000014) Charger voltage status register                            */
  __IOM uint32_t  CHARGER_CURRENT_STATUS_REG;   /*!< (@ 0x00000018) Charger current status register                            */
  __IOM uint32_t  CHARGER_TEMPSET_PARAM_REG;    /*!< (@ 0x0000001C) Charger battery temperature settings register              */
  __IOM uint32_t  CHARGER_TEMPSET2_PARAM_REG;   /*!< (@ 0x00000020) Charger battery temperature settings register
                                                                    (Cooler, Warmer).                                          */
  __IOM uint32_t  CHARGER_PRE_CHARGE_TIMER_REG; /*!< (@ 0x00000024) Maximum pre-charge time limit register                     */
  __IOM uint32_t  CHARGER_CC_CHARGE_TIMER_REG;  /*!< (@ 0x00000028) Maximum CC-charge time limit register                      */
  __IOM uint32_t  CHARGER_CV_CHARGE_TIMER_REG;  /*!< (@ 0x0000002C) Maximum CV-charge time limit register                      */
  __IOM uint32_t  CHARGER_TOTAL_CHARGE_TIMER_REG;/*!< (@ 0x00000030) Maximum total charge time limit register                  */
  __IOM uint32_t  CHARGER_JEITA_V_CHARGE_REG;   /*!< (@ 0x00000034) JEITA-compliant Charge voltage settings register           */
  __IOM uint32_t  CHARGER_JEITA_V_PRECHARGE_REG;/*!< (@ 0x00000038) JEITA-compliant Pre-Charge voltage settings register       */
  __IOM uint32_t  CHARGER_JEITA_V_REPLENISH_REG;/*!< (@ 0x0000003C) JEITA-compliant Replenish settings register                */
  __IOM uint32_t  CHARGER_JEITA_V_OVP_REG;      /*!< (@ 0x00000040) JEITA-compliant OVP settings register                      */
  __IOM uint32_t  CHARGER_JEITA_CURRENT_REG;    /*!< (@ 0x00000044) JEITA-compliant current settings register                  */
  __IOM uint32_t  CHARGER_JEITA_CURRENT2_REG;   /*!< (@ 0x00000048) JEITA-compliant current settings register for
                                                                    'Cooler' and 'Warmer' zones                                */
  __IOM uint32_t  CHARGER_VBAT_COMP_TIMER_REG;  /*!< (@ 0x0000004C) Main Vbat comparator timer register                        */
  __IOM uint32_t  CHARGER_VOVP_COMP_TIMER_REG;  /*!< (@ 0x00000050) Vbat OVP comparator timer register                         */
  __IOM uint32_t  CHARGER_TDIE_COMP_TIMER_REG;  /*!< (@ 0x00000054) Die temperature comparator timer register                  */
  __IOM uint32_t  CHARGER_TBAT_MON_TIMER_REG;   /*!< (@ 0x00000058) Battery temperature monitor interval timer register        */
  __IOM uint32_t  CHARGER_TBAT_COMP_TIMER_REG;  /*!< (@ 0x0000005C) Battery temperature (main) comparator timer register       */
  __IOM uint32_t  CHARGER_THOT_COMP_TIMER_REG;  /*!< (@ 0x00000060) Battery temperature comparator timer register
                                                                    for 'Hot' zone                                             */
  __IOM uint32_t  CHARGER_PWR_UP_TIMER_REG;     /*!< (@ 0x00000064) Charger power-up settling timer register                   */
  __IOM uint32_t  CHARGER_STATE_IRQ_MASK_REG;   /*!< (@ 0x00000068) Mask register of Charger FSM IRQs                          */
  __IOM uint32_t  CHARGER_ERROR_IRQ_MASK_REG;   /*!< (@ 0x0000006C) Mask register of Charger Error IRQs                        */
  __IOM uint32_t  CHARGER_STATE_IRQ_STATUS_REG; /*!< (@ 0x00000070) Status register of Charger FSM IRQs                        */
  __IOM uint32_t  CHARGER_ERROR_IRQ_STATUS_REG; /*!< (@ 0x00000074) Status register of Charger Error IRQs                      */
  __IOM uint32_t  CHARGER_STATE_IRQ_CLR_REG;    /*!< (@ 0x00000078) Interrupt clear register of Charger FSM IRQs               */
  __IOM uint32_t  CHARGER_ERROR_IRQ_CLR_REG;    /*!< (@ 0x0000007C) Interrupt clear register of Charger Error IRQs             */
  __IOM uint32_t  CHARGER_LOCK_REG;             /*!< (@ 0x00000080) Charger HW lock register                                   */
  __IOM uint32_t  CHARGER_SWLOCK_REG;           /*!< (@ 0x00000084) Charger SW lock register                                   */
} CHARGER_Type;                                 /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                          CHG_DET                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CHG_DET registers (CHG_DET)
  */

