antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x50040300) CHG_DET Structure                                          */
  __IOM uint32_t  CHG_DET_FSM_CTRL_REG;         /*!< (@ 0x00000000) Charge detection FSM control register                      */
  __IOM uint32_t  CHG_DET_FSM_STATUS_REG;       /*!< (@ 0x00000004) Charge detection FSM status register                       */
  __IOM uint32_t  CHG_DET_SW_CTRL_REG;          /*!< (@ 0x00000008) Charge detection manual (SW-based) mode control
                                                                    register                                                   */
  __IOM uint32_t  CHG_DET_STATUS_REG;           /*!< (@ 0x0000000C) Charge detection status register holding the
                                                                    comparator outputs                                         */
  __IOM uint32_t  CHG_DET_ADC_CTRL_REG;         /*!< (@ 0x00000010) Charge detection ADC control register                      */
  __IOM uint32_t  CHG_DET_TIMER_REG;            /*!< (@ 0x00000014) Charge detection timer register (used in the
                                                                    FSM)                                                       */
  __IOM uint32_t  CHG_DET_DCD_TIMER_REG;        /*!< (@ 0x00000018) Charge detection DCD time-out timer register
                                                                    (used in the FSM)                                          */
  __IOM uint32_t  CHG_DET_IRQ_MASK_REG;         /*!< (@ 0x0000001C) Charge detection IRQ mask register                         */
  __IOM uint32_t  CHG_DET_IRQ_STATUS_REG;       /*!< (@ 0x00000020) Charge detection IRQ status register                       */
  __IOM uint32_t  CHG_DET_IRQ_CLEAR_REG;        /*!< (@ 0x00000024) Charge detection IRQ clear register                        */
} CHG_DET_Type;                                 /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                       CHIP_VERSION                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief CHIP_VERSION registers (CHIP_VERSION)
  */

typedef struct {                                /*!< (@ 0x50040000) CHIP_VERSION Structure                                     */
  __IOM uint32_t  CHIP_ID1_REG;                 /*!< (@ 0x00000000) Chip identification register 1.                            */
  __IOM uint32_t  CHIP_ID2_REG;                 /*!< (@ 0x00000004) Chip identification register 2.                            */
  __IOM uint32_t  CHIP_ID3_REG;                 /*!< (@ 0x00000008) Chip identification register 3.                            */
  __IOM uint32_t  CHIP_ID4_REG;                 /*!< (@ 0x0000000C) Chip identification register 4.                            */
  __IOM uint32_t  CHIP_SWC_REG;                 /*!< (@ 0x00000010) Software compatibility register.                           */
  __IOM uint32_t  CHIP_REVISION_REG;            /*!< (@ 0x00000014) Chip revision register.                                    */
  __IM  uint32_t  RESERVED[56];
  __IOM uint32_t  CHIP_TEST1_REG;               /*!< (@ 0x000000F8) Chip test register 1.                                      */
  __IOM uint32_t  CHIP_TEST2_REG;               /*!< (@ 0x000000FC) Chip test register 2.                                      */
} CHIP_VERSION_Type;                            /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                          CRG_AUD                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_AUD registers (CRG_AUD)
  */

typedef struct {                                /*!< (@ 0x50030000) CRG_AUD Structure                                          */
  __IM  uint32_t  RESERVED[16];
  __IOM uint32_t  PCM_DIV_REG;                  /*!< (@ 0x00000040) PCM divider and enables                                    */
  __IOM uint32_t  PCM_FDIV_REG;                 /*!< (@ 0x00000044) PCM fractional division register                           */
  __IOM uint32_t  PDM_DIV_REG;                  /*!< (@ 0x00000048) PDM divider and enables                                    */
  __IOM uint32_t  SRC_DIV_REG;                  /*!< (@ 0x0000004C) SRC divider and enables                                    */
} CRG_AUD_Type;                                 /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                         CRG_CTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_CTRL registers (CRG_CTRL)
  */

typedef struct {                                /*!< (@ 0x50060000) CRG_CTRL Structure                                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CLK_PDCTRL_REG;               /*!< (@ 0x00000004) Clock control settings for PD_CTRL                         */
} CRG_CTRL_Type;                                /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                          CRG_GPU                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_GPU registers (CRG_GPU)
  */

