antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x51001000) CRG_GPU Structure                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CLK_GPU_REG;                  /*!< (@ 0x00000004) Control register for clocks in PD_GPU                      */
} CRG_GPU_Type;                                 /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                          CRG_SNC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_SNC registers (CRG_SNC)
  */

typedef struct {                                /*!< (@ 0x50020900) CRG_SNC Structure                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CLK_SNC_REG;                  /*!< (@ 0x00000004) Peripheral divider register                                */
  __IOM uint32_t  SET_CLK_SNC_REG;              /*!< (@ 0x00000008) Peripheral divider register SET register. Reads
                                                                    back 0x0000                                                */
  __IOM uint32_t  RESET_CLK_SNC_REG;            /*!< (@ 0x0000000C) Peripheral divider register RESET register. Reads
                                                                    back 0x0000                                                */
} CRG_SNC_Type;                                 /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_SYS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_SYS registers (CRG_SYS)
  */

typedef struct {                                /*!< (@ 0x50040400) CRG_SYS Structure                                          */
  __IOM uint32_t  CLK_SYS_REG;                  /*!< (@ 0x00000000) Peripheral divider register                                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SET_CLK_SYS_REG;              /*!< (@ 0x00000008) Peripheral divider SET register                            */
  __IOM uint32_t  RESET_CLK_SYS_REG;            /*!< (@ 0x0000000C) Peripheral divider RESET register                          */
  __IOM uint32_t  BATCHECK_REG;                 /*!< (@ 0x00000010) BATCHECK_REG                                               */
} CRG_SYS_Type;                                 /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                          CRG_TOP                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_TOP registers (CRG_TOP)
  */

typedef struct {                                /*!< (@ 0x50000000) CRG_TOP Structure                                          */
  __IOM uint32_t  CLK_AMBA_REG;                 /*!< (@ 0x00000000) HCLK, PCLK, divider and clock gates                        */
  __IOM uint32_t  CLK_CMAC_SWITCH_REG;          /*!< (@ 0x00000004) Clock switching register for CMAC clock domain             */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RST_CTRL_REG;                 /*!< (@ 0x0000000C) Reset control register                                     */
  __IOM uint32_t  CLK_RADIO_REG;                /*!< (@ 0x00000010) Radio PLL control register                                 */
  __IOM uint32_t  CLK_CTRL_REG;                 /*!< (@ 0x00000014) Clock control register                                     */
  __IOM uint32_t  CLK_TMR_REG;                  /*!< (@ 0x00000018) Clock control for the timers                               */
  __IOM uint32_t  CLK_SWITCH2XTAL_REG;          /*!< (@ 0x0000001C) Switches clock from RC32M to XTAL32M                       */
  __IOM uint32_t  PMU_CTRL_REG;                 /*!< (@ 0x00000020) Power Management Unit control register                     */
  __IOM uint32_t  SYS_CTRL_REG;                 /*!< (@ 0x00000024) System Control register                                    */
  __IOM uint32_t  SYS_STAT_REG;                 /*!< (@ 0x00000028) System status register                                     */
  __IOM uint32_t  CLK_SNC_CTRL_REG;             /*!< (@ 0x0000002C) CLK_SNC_CTRL_REG                                           */
  __IOM uint32_t  SLP_MAP_REG;                  /*!< (@ 0x00000030) Map signals on GPIOs during sleep                          */
  __IOM uint32_t  LCD_EXT_CTRL_REG;             /*!< (@ 0x00000034) LCD_EXT_CTRL_REG                                           */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CLK_RCLP_REG;                 /*!< (@ 0x0000003C) 32/512 kHz RC oscillator register                          */
  __IOM uint32_t  CLK_XTAL32K_REG;              /*!< (@ 0x00000040) 32 kHz XTAL oscillator register                            */
  __IOM uint32_t  CLK_RCHS_REG;                 /*!< (@ 0x00000044) Fast RC control register                                   */
  __IOM uint32_t  CLK_RCX_REG;                  /*!< (@ 0x00000048) RCX-oscillator control register                            */
  __IOM uint32_t  CLK_RTCDIV_REG;               /*!< (@ 0x0000004C) Divisor for RTC 100Hz clock                                */
  __IOM uint32_t  BANDGAP_REG;                  /*!< (@ 0x00000050) bandgap trimming                                           */
  __IOM uint32_t  VBUS_IRQ_MASK_REG;            /*!< (@ 0x00000054) IRQ masking                                                */
  __IOM uint32_t  VBUS_IRQ_CLEAR_REG;           /*!< (@ 0x00000058) Clear pending IRQ register                                 */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  BOD_CTRL_REG;                 /*!< (@ 0x00000060) Brown Out Detection control register                       */
  __IOM uint32_t  BOD_STATUS_REG;               /*!< (@ 0x00000064) BOD_STATUS_REG                                             */
  __IM  uint32_t  RESERVED3[2];
  __IOM uint32_t  P0_PAD_LATCH_REG;             /*!< (@ 0x00000070) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P0_SET_PAD_LATCH_REG;         /*!< (@ 0x00000074) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P0_RESET_PAD_LATCH_REG;       /*!< (@ 0x00000078) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P1_PAD_LATCH_REG;             /*!< (@ 0x0000007C) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P1_SET_PAD_LATCH_REG;         /*!< (@ 0x00000080) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P1_RESET_PAD_LATCH_REG;       /*!< (@ 0x00000084) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P2_PAD_LATCH_REG;             /*!< (@ 0x00000088) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P2_SET_PAD_LATCH_REG;         /*!< (@ 0x0000008C) Control the state retention of the GPIO ports              */
  __IOM uint32_t  P2_RESET_PAD_LATCH_REG;       /*!< (@ 0x00000090) Control the state retention of the GPIO ports              */
  __IOM uint32_t  POR_CTRL_REG;                 /*!< (@ 0x00000094) Controls the POR on VBAT                                   */
  __IOM uint32_t  POR_PIN_REG;                  /*!< (@ 0x00000098) Selects a GPIO pin for POR generation                      */
  __IOM uint32_t  POR_TIMER_REG;                /*!< (@ 0x0000009C) Time for POR to happen                                     */
  __IM  uint32_t  RESERVED4[7];
  __IOM uint32_t  RESET_STAT_REG;               /*!< (@ 0x000000BC) Reset status register                                      */
  __IOM uint32_t  RAM_PWR_CTRL_REG;             /*!< (@ 0x000000C0) Control power state of System RAMS                         */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  SECURE_BOOT_REG;              /*!< (@ 0x000000CC) Controls secure booting                                    */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  DISCHARGE_RAIL_REG;           /*!< (@ 0x000000D4) Immediate rail resetting. There is no LDO/DCDC
                                                                    gating                                                     */
  __IM  uint32_t  RESERVED7[2];
  __IOM uint32_t  WAKEUP_HIBERN_REG;            /*!< (@ 0x000000E0) WAKEUP_HIBERN_REG                                          */
  __IOM uint32_t  SW_V18F_REG;                  /*!< (@ 0x000000E4) SW_V18F_REG                                                */
  __IOM uint32_t  BIAS_VREF_SEL_REG;            /*!< (@ 0x000000E8) BIAS_VREF_SEL_REG                                          */
  __IOM uint32_t  ANA_STATUS_REG;               /*!< (@ 0x000000EC) Analog Signals Status Register                             */
  __IOM uint32_t  POWER_CTRL_REG;               /*!< (@ 0x000000F0) Power control register                                     */
  __IOM uint32_t  PMU_SLEEP_REG;                /*!< (@ 0x000000F4) Configures the sleep/wakeup strategy                       */
  __IOM uint32_t  POWER_LVL_REG;                /*!< (@ 0x000000F8) POWER_LVL_REG                                              */
} CRG_TOP_Type;                                 /*!< Size = 252 (0xfc)                                                         */



/* =========================================================================================================================== */
/* ================                                         CRG_VSYS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_VSYS registers (CRG_VSYS)
  */

typedef struct {                                /*!< (@ 0x50000B00) CRG_VSYS Structure                                         */
  __IOM uint32_t  VSYS_GEN_CTRL_REG;            /*!< (@ 0x00000000) VSYS_GEN_CTRL_REG                                          */
  __IOM uint32_t  VSYS_GEN_IRQ_STATUS_REG;      /*!< (@ 0x00000004) VSYS_GEN_IRQ_STATUS_REG                                    */
  __IOM uint32_t  VSYS_GEN_IRQ_CLEAR_REG;       /*!< (@ 0x00000008) VSYS_GEN_IRQ_CLEAR_REG                                     */
  __IOM uint32_t  VSYS_GEN_IRQ_MASK_REG;        /*!< (@ 0x0000000C) VSYS_GEN_IRQ_MASK_REG                                      */
} CRG_VSYS_Type;                                /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                         CRG_XTAL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CRG_XTAL registers (CRG_XTAL)
  */

