antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x30058000) EMMC Structure                                             */
  __IOM uint32_t  EMMC_SDMASA_R_REG;            /*!< (@ 0x00000000) This register is used to configure a 32-bit Block
                                                                    Count or an SDMA System Address based on
                                                                    the Host Version 4 Enable bit in the Host
                                                                    Control 2 register. This register is applicable
                                                                    for both SD and eMMC modes.                                */
  __IOM uint16_t  EMMC_BLOCKSIZE_R_REG;         /*!< (@ 0x00000004) This register is used to configure an SDMA buffer
                                                                    boundary and the number of bytes in a data
                                                                    block. This register is applicable for both
                                                                    SD and eMMC modes.                                         */
  __IOM uint16_t  EMMC_BLOCKCOUNT_R_REG;        /*!< (@ 0x00000006) This register is used to configure the number
                                                                    of data blocks. This register is applicable
                                                                    for both SD and eMMC modes.                                */
  __IOM uint32_t  EMMC_ARGUMENT_R_REG;          /*!< (@ 0x00000008) This register is used to configure the SD/eMMC
                                                                    command argument.                                          */
  __IOM uint16_t  EMMC_XFER_MODE_R_REG;         /*!< (@ 0x0000000C) This register is used to control the operation
                                                                    of data transfers for an SD/eMMC mode. The
                                                                    Host driver sets this register before issuing
                                                                    a command that transfers data.                             */
  __IOM uint16_t  EMMC_CMD_R_REG;               /*!< (@ 0x0000000E) This register is used to provide the information
                                                                    related to a command and a response packet.
                                                                    This register is applicable for an SD/eMMC
                                                                    mode.                                                      */
  __IOM uint32_t  EMMC_RESP01_R_REG;            /*!< (@ 0x00000010) This register stores 39-08 bits of the Response
                                                                    Field for an SD/eMMC mode. The response
                                                                    for an SD/eMMC command can be a maximum
                                                                    of 128 bits. These 128 bits are segregated
                                                                    into four 32-bit registers: RESP01_R, RESP23_R,
                                                                    RESP45_R and RESP67_R.                                     */
  __IOM uint32_t  EMMC_RESP23_R_REG;            /*!< (@ 0x00000014) This register stores 71-40 bits of the Response
                                                                    Field for an SD/eMMC mode. This register
                                                                    is used to store the response from the cards.
                                                                    The response can be a maximum of 128 bits.
                                                                    These 128 bits are segregated into four
                                                                    32-bit registers: RESP01_R, RESP23_R, RESP45_R
                                                                    and RESP67_R.                                              */
  __IOM uint32_t  EMMC_RESP45_R_REG;            /*!< (@ 0x00000018) This register stores 103-72 bits of the Response
                                                                    Field for an SD/eMMC mode. The response
                                                                    for SD/eMMC command can be a maximum of
                                                                    128 bits. These 128 bits are segregated
                                                                    into four 32-bit registers: RESP01_R, RESP23_R,
                                                                    RESP45_R and RESP67_R.                                     */
  __IOM uint32_t  EMMC_RESP67_R_REG;            /*!< (@ 0x0000001C) This register stores 135-104 bits of the Response
                                                                    Field for an SD/eMMC mode. The SD/eMMC response
                                                                    can be a maximum of 128 bis. These 128 bits
                                                                    are segregated into four 32-bit registers:
                                                                    RESP01_R, RESP23_R, RESP45_R and RESP67_R.                 */
  __IOM uint32_t  EMMC_BUF_DATA_R_REG;          /*!< (@ 0x00000020) This register is used to access the packet buffer.
                                                                    This register is applicable for an SD/eMMC/UHS-II
                                                                    mode.                                                      */
  __IOM uint32_t  EMMC_PSTATE_REG;              /*!< (@ 0x00000024) This register indicates the present status of
                                                                    the Host Controller. This register is applicable
                                                                    for an SD/eMMC/UHS-II mode.                                */
  __IOM uint8_t   EMMC_HOST_CTRL1_R_REG;        /*!< (@ 0x00000028) This register is used to control the operation
                                                                    of the Host Controller. This register is
                                                                    applicable for an SD/eMMC/UHS-II mode.                     */
  __IOM uint8_t   EMMC_PWR_CTRL_R_REG;          /*!< (@ 0x00000029) This register is used to control the bus power
                                                                    for the Card. This register is applicable
                                                                    for an SD, eMMC, and UHS-II modes.                         */
  __IOM uint8_t   EMMC_BGAP_CTRL_R_REG;         /*!< (@ 0x0000002A) This register is used by the host driver to control
                                                                    any operation related to Block Gap. This
                                                                    register is applicable for an SD/eMMC/UHS-II
                                                                    mode.                                                      */
  __IOM uint8_t   EMMC_WUP_CTRL_R_REG;          /*!< (@ 0x0000002B) This register is mandatory for the Host Controller,
                                                                    but the wakeup functionality depends on
                                                                    the Host Controller system hardware and
                                                                    software. The Host Driver maintains voltage
                                                                    on the SD Bus by setting the SD Bus Power
                                                                    to 1 in the Power Control Register, while
                                                                    a wake-up event through the Card Interrupt
                                                                    is desired.                                                */
  __IOM uint16_t  EMMC_CLK_CTRL_R_REG;          /*!< (@ 0x0000002C) This register controls SDCLK (card clock) in
                                                                    an SD/eMMC mode and RCLK in the UHS-II mode.
                                                                    This register is applicable for an SD/eMMC/UHS-II
                                                                    mode.                                                      */
  __IOM uint8_t   EMMC_TOUT_CTRL_R_REG;         /*!< (@ 0x0000002E) This register is used to set the Data Timeout
                                                                    Counter value for an SD/eMMC mode according
                                                                    to the timer clock defined by the Capabilities
                                                                    register, while initializig the Host Controller.           */
  __IOM uint8_t   EMMC_SW_RST_R_REG;            /*!< (@ 0x0000002F) This register is used to generate a reset pulse
                                                                    by writing 1 to each bit of this register.
                                                                    After completing the reset, the Host Controller
                                                                    clears each bit. As it takes some time to
                                                                    complete a software reset, the Host Driver
                                                                    confirms that these bits are 0. This register
                                                                    is applicable for an SD/eMMC/UHS-II mode.
                                                                    Note: See Software Reset section in the
                                                                    DWC_mshc Databook for additional details.                  */
  __IOM uint16_t  EMMC_NORMAL_INT_STAT_R_REG;   /*!< (@ 0x00000030) This register reflects the status of the Normal
                                                                    Interrupt. This register is applicable for
                                                                    an SD/eMMC/UHS-II mode.                                    */
  __IOM uint16_t  EMMC_ERROR_INT_STAT_R_REG;    /*!< (@ 0x00000032) This register enables an interrupt when the Error
                                                                    Interrupt Status Enable is enabled and at
                                                                    least one of the statuses is set to 1. Writing
                                                                    to 1 clears the bit and writing to 0 retains
                                                                    the bit unchanged. Signals defined in this
                                                                    register can be enabled by the Error Interrupt
                                                                    Status Enable register, but not by the Error
                                                                    Interrupt Signal Enable register. More than
                                                                    one status can be cleared with a single
                                                                    register write. This register is applicable
                                                                    for an SD/eMMC/UHS-II mode.                                */
  __IOM uint16_t  EMMC_NORMAL_INT_STAT_EN_R_REG;/*!< (@ 0x00000034) This register enables the Interrupt Status for
                                                                    Normal Interrupt Status register (NORMAL_INT_STAT_R)
                                                                    when NORMAL_INT_STAT_R is set to 1. This
                                                                    register is applicable for an SD/eMMC/UHS-II
                                                                    mode.                                                      */
  __IOM uint16_t  EMMC_ERROR_INT_STAT_EN_R_REG; /*!< (@ 0x00000036) This register sets the Interrupt Status for Error
                                                                    Interrupt Status register (ERROR_INT_STAT_R),
                                                                    when ERROR_INT_STAT_EN_R is set to 1. This
                                                                    register is applicable for an SD/eMMC/UHS-II
                                                                    mode.                                                      */
  __IOM uint16_t  EMMC_NORMAL_INT_SIGNAL_EN_R_REG;/*!< (@ 0x00000038) This register is used to select the interrupt
                                                                    status that is indicated to the Host System
                                                                    as the interrupt. All these status bits
                                                                    share the same 1-bit interrupt line. Setting
                                                                    any of these bits to 1, enables interrupt
                                                                    generation. This register is applicable
                                                                    for an SD/eMMC/UHS-II mode.                                */
  __IOM uint16_t  EMMC_ERROR_INT_SIGNAL_EN_R_REG;/*!< (@ 0x0000003A) This register is used to select the interrupt
                                                                    status that is notified to the Host System
                                                                    as an interrupt. All these status bits share
                                                                    the same 1-bit interrupt line. Setting any
                                                                    of these bits to 1 enables interrupt generation.
                                                                    This register is applicable for an SD/eMMC/UHS-II
                                                                    mode.                                                      */
  __IOM uint16_t  EMMC_AUTO_CMD_STAT_R_REG;     /*!< (@ 0x0000003C) This register is used to indicate the CMD12 response
                                                                    error of Auto CMD12, and the CMD23 response
                                                                    error of Auto CMD23. The Host driver can
                                                                    determine the kind of Auto CMD12/CMD23 errors
                                                                    that can occur in this register. Auto CMD23
                                                                    errors are indicated in bit 04-01. This
                                                                    register is valid only when Auto CMD Error
                                                                    is set. This register is applicable for
                                                                    an SD/eMMC mode.                                           */
  __IOM uint16_t  EMMC_HOST_CTRL2_R_REG;        /*!< (@ 0x0000003E) This register is used to control how the Host
                                                                    Controller operates. This register is applicable
                                                                    for an SD/eMMC/UHS-II mode.                                */
  __IOM uint32_t  EMMC_CAPABILITIES1_R_REG;     /*!< (@ 0x00000040) This register provides the Host Driver with information
                                                                    specific to the Host Controller implementation.
                                                                    The host controller may implement these
                                                                    values as fixed or loaded from the flash
                                                                    memory during power on initialization. Capabilities
                                                                    register is segregated into two 32-bit registers:
                                                                    CAPABILITIES1_R and CAPABILITIES2_R. The
                                                                    CAPABILITIES1_R register is the lower part
                                                                    of Capabilities register.                                  */
  __IOM uint32_t  EMMC_CAPABILITIES2_R_REG;     /*!< (@ 0x00000044) This register provides the Host Driver with information
                                                                    specific to the Host Controller implementation.
                                                                    The host controller may implement these
                                                                    values as fixed or as loaded from flash
                                                                    memory during power on initialization. Capabilities
                                                                    register is segregated into two 32-bit registers,
                                                                    namely CAPABILITIES1_R and CAPABILITIES2_R.
                                                                    The CAPABILITIES2_R register is upper part
                                                                    of Capabilities register.                                  */
  __IOM uint32_t  EMMC_CURR_CAPABILITIES1_R_REG;/*!< (@ 0x00000048) This register indicate the maximum current capability
                                                                    for each voltage, for VDD1. The value is
                                                                    meaningful if the Voltage Support is set
                                                                    in the Capabilities register. If this information
                                                                    is supplied by the Host System through another
                                                                    method, all the Maximum Current Capabilities
                                                                    registers are set to 0.                                    */
  __IOM uint32_t  EMMC_CURR_CAPABILITIES2_R_REG;/*!< (@ 0x0000004C) This register indicates the maximum current capability
                                                                    for each voltage (for VDD2). The value is
                                                                    meaningful if Voltage Support is set in
                                                                    the Capabilities register. If this information
                                                                    is supplied by the Host System through another
                                                                    method, all the Maximum Current Capabilities
                                                                    registers are set to 0.                                    */
  __IOM uint16_t  EMMC_FORCE_AUTO_CMD_STAT_R_REG;/*!< (@ 0x00000050) The register is not a physically implemented
                                                                    but is an address at which the Auto CMD
                                                                    Error Status register can be written. This
                                                                    register is applicable for an SD/eMMC mode.
                                                                    1 : Sets each bit of the Auto CMD Error
                                                                    Status register. 0 : No effect.                            */
  __IOM uint16_t  EMMC_FORCE_ERROR_INT_STAT_R_REG;/*!< (@ 0x00000052) This register is not physically implemented but
                                                                    is an address at which the Error Interrupt
                                                                    Status register can be written. The effect
                                                                    of a write to this address is reflected
                                                                    in the Error Interrupt Status register if
                                                                    the corresponding bit of the Error Interrupt
                                                                    Status Enable register is set. This register
                                                                    is applicable for an SD/eMMC/UHS-II mode.                  */
  __IOM uint8_t   EMMC_ADMA_ERR_STAT_R_REG;     /*!< (@ 0x00000054) This register stores the ADMA state during an
                                                                    ADMA error. This register is applicable
                                                                    for an SD/eMMC/UHS-II mode.                                */
  __IM  uint8_t   RESERVED;
  __IM  uint16_t  RESERVED1;
  __IOM uint32_t  EMMC_ADMA_SA_LOW_R_REG;       /*!< (@ 0x00000058) This register holds the lower 32-bit system address
                                                                    for DMA transfer. This register is applicable
                                                                    for an SD/eMMC/UHS-II mode.                                */
  __IM  uint32_t  RESERVED2;
  __IOM uint16_t  EMMC_PRESET_INIT_R_REG;       /*!< (@ 0x00000060) This register defines Preset Value for Initialization
                                                                    in SD/eMMC mode.                                           */
  __IOM uint16_t  EMMC_PRESET_DS_R_REG;         /*!< (@ 0x00000062) This register defines Preset Value for Default
                                                                    Speed mode in SD mode.                                     */
  __IOM uint16_t  EMMC_PRESET_HS_R_REG;         /*!< (@ 0x00000064) This register defines Preset Value for High Speed
                                                                    mode in SD mode.                                           */
  __IOM uint16_t  EMMC_PRESET_SDR12_R_REG;      /*!< (@ 0x00000066) This register defines Preset Value for SDR12
                                                                    and Legacy speed mode in SD and eMMC mode
                                                                    respectively.                                              */
  __IOM uint16_t  EMMC_PRESET_SDR25_R_REG;      /*!< (@ 0x00000068) This register defines Preset Value for SDR25
                                                                    and High Speed SDR speed mode in SD and
                                                                    eMMC mode respectively.                                    */
  __IOM uint16_t  EMMC_PRESET_SDR50_R_REG;      /*!< (@ 0x0000006A) This register defines Preset Value for SDR50
                                                                    speed mode in SD mode.                                     */
  __IOM uint16_t  EMMC_PRESET_SDR104_R_REG;     /*!< (@ 0x0000006C) This register defines Preset Value for SDR104
