antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
                                                                    and HS200 speed modes in the SD and eMMC
                                                                    modes, respectively.                                       */
  __IOM uint16_t  EMMC_PRESET_DDR50_R_REG;      /*!< (@ 0x0000006E) This register defines the Preset Value for DDR50
                                                                    and High Speed DDR speed modes in the SD
                                                                    and eMMC modes, respectively.                              */
  __IM  uint32_t  RESERVED3;
  __IOM uint16_t  EMMC_PRESET_UHS2_R_REG;       /*!< (@ 0x00000074) This register is used to hold the preset value
                                                                    for UHS-II and HS400 speed modes in the
                                                                    SD and eMMC modes, respectively.                           */
  __IM  uint16_t  RESERVED4;
  __IM  uint32_t  RESERVED5[27];
  __IM  uint16_t  RESERVED6;
  __IOM uint16_t  EMMC_P_EMBEDDED_CNTRL_REG;    /*!< (@ 0x000000E6) This register points to the location of UHS-II
                                                                    embedded control registers.                                */
  __IOM uint16_t  EMMC_P_VENDOR_SPECIFIC_AREA_REG;/*!< (@ 0x000000E8) This register used as a pointer for the Vendor
                                                                    Specific Area 1.                                           */
  __IOM uint16_t  EMMC_P_VNDR2_SPECIFIC_AREA_REG;/*!< (@ 0x000000EA) This register is used as a pointer for the Vendor
                                                                    Specific Area 2.                                           */
  __IM  uint32_t  RESERVED7[4];
  __IOM uint16_t  EMMC_SLOT_INTR_STATUS_R_REG;  /*!< (@ 0x000000FC) This register indicates the Interrupt status
                                                                    of each slot.                                              */
  __IOM uint16_t  EMMC_HOST_CNTRL_VERS_R_REG;   /*!< (@ 0x000000FE) This register is used to indicate the Host Controller
                                                                    Version number.                                            */
  __IM  uint32_t  RESERVED8[33];
  __IOM uint32_t  EMMC_CQCAP_REG;               /*!< (@ 0x00000184) This register indicates the capabilities of the
                                                                    command queuing engine.                                    */
  __IM  uint32_t  RESERVED9[222];
  __IOM uint32_t  EMMC_VER_ID_R_REG;            /*!< (@ 0x00000500) This register reflects the current release number
                                                                    of eMMC.                                                   */
  __IOM uint32_t  EMMC_VER_TYPE_R_REG;          /*!< (@ 0x00000504) This register reflects the current release type
                                                                    of eMMC.                                                   */
  __IOM uint8_t   EMMC_CTRL_R_REG;              /*!< (@ 0x00000508) This register is used to control the operation
                                                                    of EMMC Controller.                                        */
  __IM  uint8_t   RESERVED10;
  __IM  uint16_t  RESERVED11;
  __IM  uint32_t  RESERVED12;
  __IOM uint8_t   EMMC_MBIU_CTRL_R_REG;         /*!< (@ 0x00000510) This register is used to select the valid burst
                                                                    types that the AHB Master bus interface
                                                                    can generate. When more than one bit is
                                                                    set the master selects the burst it prefers
                                                                    among those that are enabled in this register.             */
  __IM  uint8_t   RESERVED13;
  __IM  uint16_t  RESERVED14;
  __IM  uint32_t  RESERVED15[6];
  __IOM uint16_t  EMMC_EMMC_CTRL_R_REG;         /*!< (@ 0x0000052C) This register is used to control the eMMC operation.       */
  __IOM uint16_t  EMMC_BOOT_CTRL_R_REG;         /*!< (@ 0x0000052E) This register is used to control the eMMC Boot
                                                                    operation.                                                 */
  __IM  uint32_t  RESERVED16[4];
  __IOM uint32_t  EMMC_AT_CTRL_R_REG;           /*!< (@ 0x00000540) This register controls some aspects of tuning
                                                                    and auto-tuning features. Do not program
                                                                    this register when HOST_CTRL2_R.SAMPLE_CLK_SEL
                                                                    is 1.                                                      */
  __IOM uint32_t  EMMC_AT_STAT_R_REG;           /*!< (@ 0x00000544) Register to read the Center, Left and Right codes
                                                                    used by tuning and auto-tuning engines.
                                                                    Center code field is also used for software
                                                                    managed tuning.                                            */
  __IM  uint32_t  RESERVED17[649];
  __IOM uint32_t  EMMC_EMBEDDED_CTRL_R_REG;     /*!< (@ 0x00000F6C) This register controls the embedded device. When
                                                                    the Host Controller is connected to a removable
                                                                    device, this register is not used.                         */
} EMMC_Type;                                    /*!< Size = 3952 (0xf70)                                                       */



/* =========================================================================================================================== */
/* ================                                           GPADC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief GPADC registers (GPADC)
  */

