antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x50040100) GPREG Structure                                            */
  __IOM uint32_t  SET_FREEZE_REG;               /*!< (@ 0x00000000) Controls freezing of various timers/counters
                                                                    (incl. DMA and USB).                                       */
  __IOM uint32_t  RESET_FREEZE_REG;             /*!< (@ 0x00000004) Controls unfreezing of various timers/counters
                                                                    (incl. DMA and USB).                                       */
  __IOM uint32_t  DEBUG_REG;                    /*!< (@ 0x00000008) Various debug information register.                        */
  __IOM uint32_t  GP_STATUS_REG;                /*!< (@ 0x0000000C) General purpose system status register.                    */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  USBPAD_REG;                   /*!< (@ 0x00000018) USB pads control register                                  */
} GPREG_Type;                                   /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                         GPU_CORE                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief GPU_CORE registers (GPU_CORE)
  */

typedef struct {                                /*!< (@ 0x51001200) GPU_CORE Structure                                         */
  __IOM uint32_t  D2_CONTROL;                   /*!< (@ 0x00000000) #0: Geometry control register. This register
                                                                    controls the pixel enumeration and selection
                                                                    units, deciding which pixels are part of
                                                                    the geometry. Each geometry limiter can
                                                                    be enabled (default is disabled) by setting
                                                                    one of the enable bits. Note that disabled
                                                                    limiters are always read as 1.0. Limiters
                                                                    are grouped into three pairs of quadratic
                                                                    limiters, each of which can be coupled to
                                                                    track a quadractic instead of a linear equation.
                                                                    Note that in case of a coupled limiter only
                                                                    the first should ha                                        */
  __IOM uint32_t  D2_CONTROL2;                  /*!< (@ 0x00000004) #1: Surface control register. This register controls
                                                                    the colorization, texturing and blending
                                                                    units, deciding what color a pixel should
                                                                    have. By default, the pixel color source
                                                                    is D2_COLOR1 but setting pattern or texture
                                                                    enable changes this. When using texturemapping
                                                                    filtering and clamping, control bits are
                                                                    used to specify details for the fetching
                                                                    of texels. Texture formats are defined by
                                                                    the read format. Writeback frame buffer
                                                                    formats are defined by the write format.
                                                                    The standard GPU uses a                                    */
  __IOM uint32_t  D2_CONTROL3;                  /*!< (@ 0x00000008) #2: Burst length limit control register. This
                                                                    register controls the burst length limit
                                                                    for the master bus interfaces. Log2 of the
                                                                    burst length limit: 0 - 2^0 = single transfer;
                                                                    2 - 2^2 = max burst length 4; 3 - 2^3 =
                                                                    max burst length 8; 4 - 2^4 = max burst
                                                                    length 16. Valid values depend on the protocol
                                                                    of the used bus interface.                                 */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  D2_L1START;                   /*!< (@ 0x00000010) #4: Limiter1 start value. All limiter registers
                                                                    are *write only*, reading will return undefined
                                                                    results. Limiters must be enabled (see D2_CONTROL)
                                                                    to produce an output value. In addition
                                                                    to the 6 geometry limiters there are two
                                                                    special UV-Limiters (see Texture registers).
                                                                    The start value is a 16:16 fixedpoint number
                                                                    valid at the first pixel of the bounding
                                                                    box.                                                       */
  __IOM uint32_t  D2_L2START;                   /*!< (@ 0x00000014) #5: Limiter2 start value. See D2_L1START                   */
  __IOM uint32_t  D2_L3START;                   /*!< (@ 0x00000018) #6: Limiter3 start value. See D2_L1START                   */
  __IOM uint32_t  D2_L4START;                   /*!< (@ 0x0000001C) #7: Limiter4 start value. See D2_L1START                   */
  __IOM uint32_t  D2_L5START;                   /*!< (@ 0x00000020) #8: Limiter5 start value. See D2_L1START                   */
  __IOM uint32_t  D2_L6START;                   /*!< (@ 0x00000024) #9: Limiter6 start value. See D2_L1START                   */
  __IOM uint32_t  D2_L1XADD;                    /*!< (@ 0x00000028) #10: Limiter1 X-Axis increment. The xadd value
                                                                    is the 16:16 fixedpoint difference between
                                                                    two samples with a distance of 1 pix along
                                                                    the x axis.                                                */
  __IOM uint32_t  D2_L2XADD;                    /*!< (@ 0x0000002C) #11: Limiter2 X-Axis increment. See D2_L1XADD              */
  __IOM uint32_t  D2_L3XADD;                    /*!< (@ 0x00000030) #12: Limiter3 X-Axis increment                             */
  __IOM uint32_t  D2_L4XADD;                    /*!< (@ 0x00000034) #13: Limiter4 X-Axis increment. See D2_L1XADD              */
  __IOM uint32_t  D2_L5XADD;                    /*!< (@ 0x00000038) #14: Limiter5 X-Axis increment. See D2_L1XADD              */
  __IOM uint32_t  D2_L6XADD;                    /*!< (@ 0x0000003C) #15: Limiter6 X-Axis increment. See D2_L1XADD              */
  __IOM uint32_t  D2_L1YADD;                    /*!< (@ 0x00000040) #16: Limiter1 Y-Axis increment. The yadd value
                                                                    is the 16:16 fixedpoint difference between
                                                                    two samples with a distance of 1 pixel along
                                                                    the y axis.                                                */
  __IOM uint32_t  D2_L2YADD;                    /*!< (@ 0x00000044) #17: Limiter2 Y-Axis increment. See D2_L1YADD              */
  __IOM uint32_t  D2_L3YADD;                    /*!< (@ 0x00000048) #18: Limiter3 Y-Axis increment. See D2_L1YADD              */
  __IOM uint32_t  D2_L4YADD;                    /*!< (@ 0x0000004C) #19: Limiter4 Y-Axis increment. See D2_L1YADD              */
  __IOM uint32_t  D2_L5YADD;                    /*!< (@ 0x00000050) #20: Limiter5 Y-Axis increment. See D2_L1YADD              */
  __IOM uint32_t  D2_L6YADD;                    /*!< (@ 0x00000054) #21: Limiter6 Y-Axis increment. See D2_L1YADD              */
  __IOM uint32_t  D2_L1BAND;                    /*!< (@ 0x00000058) #22: Limiter1 band width parameter. Postfilter
                                                                    - first two limiter outputs can be routed
                                                                    through an additional unit before clamping
                                                                    to mirror their gradient and form a 'band'
                                                                    instead of the usual 'halfplane'. When band
                                                                    output filtering is enabled for limiter1
                                                                    (D2C_BAND1ENABLE see D2_CONTROL), this register
                                                                    stores the 16:16 fixedpoint inner width
                                                                    of band region.                                            */
  __IOM uint32_t  D2_L2BAND;                    /*!< (@ 0x0000005C) #23: Limiter2 band width parameter. See D2_L1BAND          */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  D2_COLOR1;                    /*!< (@ 0x00000064) #25: Base color register. All color registers
                                                                    are *write only*, reading will return undefined
                                                                    results. When using textures the two color
                                                                    registers (D2_COLOR1 and D2_COLOR2) are
                                                                    still used to modify the color value read
                                                                    from texture memory. The equation applied
                                                                    to each of the four color channels (when
                                                                    texture mapping) is: (c2-c1)*tex+c1. To
                                                                    keep the unmodified texture data c1 has
                                                                    to be 0 and c2 has to be 1, meaning 0x00000000
                                                                    and 0xffffffff for D2_COLOR1 and D2_COLOR2
                                                                    respectively. Color is                                     */
  __IOM uint32_t  D2_COLOR2;                    /*!< (@ 0x00000068) #26: Secondary color register. Secondary color
                                                                    is relevant only when rendering patterns,
                                                                    textures or using a D2C_BC2 blendmode (see
                                                                    D2_CONTROL2).                                              */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  D2_PATTERN;                   /*!< (@ 0x00000074) #29: Pattern register. Each bit in the pattern
                                                                    register is interpreted as a reference to
                                                                    one of two color registers (0bit = D2_COLOR1,
                                                                    1bit = D2_COLOR2 ).                                        */
  __IOM uint32_t  D2_SIZE;                      /*!< (@ 0x00000078) #30: Bounding box dimension                                */
  __IOM uint32_t  D2_PITCH;                     /*!< (@ 0x0000007C) #31: Framebuffer pitch and spanstore delay                 */
  __IOM uint32_t  D2_ORIGIN;                    /*!< (@ 0x00000080) #32: Address of the first pixel in framebuffer.
                                                                    Writing to D2_ORIGIN will trigger GPU to
                                                                    start rendering.                                           */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  D2_LUSTART;                   /*!< (@ 0x00000090) #36: U Limiter start value. The start value is
                                                                    a 16:16 fixedpoint number valid at the first
                                                                    pixel of the bounding box.                                 */
  __IOM uint32_t  D2_LUXADD;                    /*!< (@ 0x00000094) #37: U Limiter X-Axis increment. The add value
                                                                    for U is the 16:16 fixedpoint difference
                                                                    between two samples with a distance of 1
                                                                    pixel along the x axis.                                    */
  __IOM uint32_t  D2_LUYADD;                    /*!< (@ 0x00000098) #38: U Limiter Y-Axis increment. The add value
                                                                    for U is the 16:16 fixedpoint difference
                                                                    between two samples with a distance of 1
                                                                    pixel along the y axis.                                    */
  __IOM uint32_t  D2_LVSTARTI;                  /*!< (@ 0x0000009C) #39: V Limiter start value integer part                    */
  __IOM uint32_t  D2_LVSTARTF;                  /*!< (@ 0x000000A0) #40: V Limiter start value fractional part. The
                                                                    start value is a 32:16 fixedpoint number
                                                                    valid at the first pixel of the bounding
                                                                    box.                                                       */
  __IOM uint32_t  D2_LVXADDI;                   /*!< (@ 0x000000A4) #41: V Limiter X-Axis increment integer part.
                                                                    The add value for V is the 32:16 fixedpoint
                                                                    difference between two samples with a distance
                                                                    of 1 pixel along the x axis.                               */
  __IOM uint32_t  D2_LVYADDI;                   /*!< (@ 0x000000A8) #42: V Limiter Y-Axis increment integer part.
                                                                    The add value for V is the 32:16 fixedpoint
                                                                    difference between two samples with a distance
                                                                    of 1 pixel along the y axis.                               */
  __IOM uint32_t  D2_LVYXADDF;                  /*!< (@ 0x000000AC) #43: V Limiter X and Y increment fractional parts          */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  D2_TEXPITCH;                  /*!< (@ 0x000000B4) #45: Texels per texture line&Pitch is equal or
                                                                    bigger than texture width.                                 */
  __IOM uint32_t  D2_TEXMASK;                   /*!< (@ 0x000000B8) #46: Texture size or texture address mask. Depending
                                                                    on the clamping mode this register encodes
                                                                    the clamp limit or wrap mask.                              */
  __IOM uint32_t  D2_TEXORIGIN;                 /*!< (@ 0x000000BC) #47: Texture base address. All texture registers
                                                                    are *write only*, reading will return undefined
                                                                    results. Patterns and textures require a
                                                                    1D or 2D index (UV Coordinate) at every
                                                                    pixel. Specialized UV-Limiters are available
                                                                    to generate these. Address of the upper
                                                                    left corner texel. Addresses inside the
                                                                    framebuffer can be used as valid texture
                                                                    origin as well.                                            */
  __IOM uint32_t  D2_IRQCTL;                    /*!< (@ 0x000000C0) #48: Interrupt control register. The GPU features
                                                                    three sources for interrupts. They can be
                                                                    enabled and cleared individually. Enumeration
                                                                    finished - this interrupt is issued after
                                                                    every enumeration has finished. An enumeration
                                                                    is triggered by writing to D2_ORIGIN. This
                                                                    interrupt can be used if the CPU sets up
                                                                    all registers and waits for the enumeration
                                                                    to finish. It should not be used if the
                                                                    display list reader is active. Dlist finished
                                                                    - this interrupt is issued if the display
                                                                    list reader                                                */
  __IOM uint32_t  D2_CACHECTL;                  /*!< (@ 0x000000C4) #49: Cache control register. Internal caches
                                                                    can be enabled/disabled and flushed using
                                                                    this register. Note that caches will be
                                                                    disabled if a value without its enable bits
                                                                    set is written to D2_CACHECTL.                             */
  __IOM uint32_t  D2_DLISTSTART;                /*!< (@ 0x000000C8) #50: Displaylist start address. Setting a new
                                                                    displaylist base address (writing to D2_DLISTSTART)
                                                                    *triggers* execution of the new dlist. Execution
                                                                    will stop only when a new list is set or
                                                                    the list terminates. Note that once the
                                                                    display list is started, the display list
                                                                    reader is the master for all register writes
                                                                    to the core: No register write must be done
                                                                    via the slave bus as long as the display
                                                                    list execution is ongoing. Otherwise, commands
                                                                    from the display list may be lost and rendering
                                                                                                                               */
  __IOM uint32_t  D2_PERFCOUNT1;                /*!< (@ 0x000000CC) #51: Performance counter. Writing to the D2_PERFCOUNT1
                                                                    register resets the first internal performance
                                                                    counter to the specified value. Reading
                                                                    returns the actual performance count. GPU
                                                                    will increment the count every time the
                                                                    event selected by D2_PERFTRIGGER lower 16
                                                                    bits triggers.                                             */
  __IOM uint32_t  D2_PERFCOUNT2;                /*!< (@ 0x000000D0) #52: Performance counter. Writing to the D2_PERFCOUNT2
                                                                    register resets the second internal performance
                                                                    counter to the specified value. GPU will
                                                                    increment the count every time the event
                                                                    selected by D2_PERFTRIGGER upper 16 bits
                                                                    triggers.                                                  */
  __IOM uint32_t  D2_PERFTRIGGER;               /*!< (@ 0x000000D4) #53: Performance counters control register. Select
                                                                    the internal event that will increment D2_PERFCOUNT1
                                                                    respectively D2_PERFCOUNT2 register. Possible
                                                                    event values: D2PC_NONE - disable performance
                                                                    counter (0), D2PC_GPUCYCLES - GPU active
                                                                    cycles (1), D2PC_FBREADS - framebuffer read
                                                                    access (2), D2PC_FBWRITES - framebuffer
                                                                    write access (3), D2PC_TXREADS - texture
                                                                    read access (4), D2PC_INVPIXELS - invisible
                                                                    pixels (enumerated but selected with alpha
