antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x50020C00) I3C Structure                                              */
  __IOM uint32_t  I3C_DEVICE_CTRL_REG;          /*!< (@ 0x00000000) Device Control Register                                    */
  __IOM uint32_t  I3C_DEVICE_ADDR_REG;          /*!< (@ 0x00000004) Device Address Register                                    */
  __IOM uint32_t  I3C_HW_CAPABILITY_REG;        /*!< (@ 0x00000008) Hardware Capability register                               */
  __IOM uint32_t  I3C_COMMAND_QUEUE_PORT_REG;   /*!< (@ 0x0000000C) COMMAND_QUEUE_PORT                                         */
  __IOM uint32_t  I3C_RESPONSE_QUEUE_PORT_REG;  /*!< (@ 0x00000010) RESPONSE_QUEUE_PORT                                        */
  __IOM uint32_t  I3C_RX_TX_DATA_PORT_REG;      /*!< (@ 0x00000014) Receive and Transmit Data Port Register                    */
  __IOM uint32_t  I3C_IBI_QUEUE_STATUS_DATA_REG;/*!< (@ 0x00000018) In-Band Interrupt Queue Status and Data Register           */
  __IOM uint32_t  I3C_QUEUE_THLD_CTRL_REG;      /*!< (@ 0x0000001C) Queue Threshold Control Register                           */
  __IOM uint32_t  I3C_DATA_BUFFER_THLD_CTRL_REG;/*!< (@ 0x00000020) Data Buffer Threshold Control Register                     */
  __IOM uint32_t  I3C_IBI_QUEUE_CTRL_REG;       /*!< (@ 0x00000024) IBI Queue Control Register                                 */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  I3C_IBI_SIR_REQ_REJECT_REG;   /*!< (@ 0x00000030) IBI SIR Request Rejection Control Register                 */
  __IOM uint32_t  I3C_RESET_CTRL_REG;           /*!< (@ 0x00000034) Reset Control Register                                     */
  __IOM uint32_t  I3C_SLV_EVENT_STATUS_REG;     /*!< (@ 0x00000038) Slave Event Status Register                                */
  __IOM uint32_t  I3C_INTR_STATUS_REG;          /*!< (@ 0x0000003C) Interrupt Status Register                                  */
  __IOM uint32_t  I3C_INTR_STATUS_EN_REG;       /*!< (@ 0x00000040) Interrupt Status Enable Register                           */
  __IOM uint32_t  I3C_INTR_SIGNAL_EN_REG;       /*!< (@ 0x00000044) Interrupt Signal Enable Register                           */
  __IOM uint32_t  I3C_INTR_FORCE_REG;           /*!< (@ 0x00000048) Interrupt Force Enable Register                            */
  __IOM uint32_t  I3C_QUEUE_STATUS_LEVEL_REG;   /*!< (@ 0x0000004C) Queue Status Level Register                                */
  __IOM uint32_t  I3C_DATA_BUFFER_STAT_LEVEL_REG;/*!< (@ 0x00000050) Data Buffer Status Level Register                         */
  __IOM uint32_t  I3C_PRESENT_STATE_REG;        /*!< (@ 0x00000054) Present State Register                                     */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  I3C_DEVICE_ADDR_TABLE_PTR_REG;/*!< (@ 0x0000005C) Pointer for Device Address Table Registers                 */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE_POINTER_REG;/*!< (@ 0x00000060) Pointer for Device Characteristics Table                  */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  I3C_VENDOR_SPECIFIC_REG_PTR_REG;/*!< (@ 0x0000006C) Pointer for Vendor specific Registers                    */
  __IM  uint32_t  RESERVED3[16];
  __IOM uint32_t  I3C_DEVICE_CTRL_EXTENDED_REG; /*!< (@ 0x000000B0) Device Control Extended Register                           */
  __IOM uint32_t  I3C_SCL_I3C_OD_TIMING_REG;    /*!< (@ 0x000000B4) SCL I3C Open Drain Timing Register                         */
  __IOM uint32_t  I3C_SCL_I3C_PP_TIMING_REG;    /*!< (@ 0x000000B8) SCL I3C Push Pull Timing Register                          */
  __IOM uint32_t  I3C_SCL_I2C_FM_TIMING_REG;    /*!< (@ 0x000000BC) SCL I2C Fast Mode Timing Register                          */
  __IOM uint32_t  I3C_SCL_I2C_FMP_TIMING_REG;   /*!< (@ 0x000000C0) SCL I2C Fast Mode Plus Timing Register                     */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  I3C_SCL_EXT_LCNT_TIMING_REG;  /*!< (@ 0x000000C8) SCL Extended Low Count Timing Register                     */
  __IOM uint32_t  I3C_SCL_EXT_TERMN_LCNT_TIME_REG;/*!< (@ 0x000000CC) SCL Termination Bit Low count Timing Register            */
  __IOM uint32_t  I3C_SDA_HOLD_DLY_TIMING_REG;  /*!< (@ 0x000000D0) SDA Hold Delay Timing Register                             */
  __IOM uint32_t  I3C_BUS_FREE_AVAIL_TIMING_REG;/*!< (@ 0x000000D4) Bus Free Timing Register                                   */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  I3C_VER_ID_REG;               /*!< (@ 0x000000E0) I3C Version ID Register                                    */
  __IOM uint32_t  I3C_VER_TYPE_REG;             /*!< (@ 0x000000E4) I3C Version Type Register                                  */
  __IOM uint32_t  I3C_QUEUE_SIZE_CAPABILITY_REG;/*!< (@ 0x000000E8) I3C Queue Size Capability Register                         */
  __IM  uint32_t  RESERVED6[69];
  __IOM uint32_t  I3C_DEV_CHAR_TABLE1_LOC1_REG; /*!< (@ 0x00000200) Device Characteristic Table Location-1 of Device1          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE1_LOC2_REG; /*!< (@ 0x00000204) Device Characteristic Table Location-2 of Device1          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE1_LOC3_REG; /*!< (@ 0x00000208) Device Characteristic Table Location-3 of Device1          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE1_LOC4_REG; /*!< (@ 0x0000020C) Device Characteristic Table Location-4 of Device1          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE2_LOC1_REG; /*!< (@ 0x00000210) Device Characteristic Table Location-1 of Device2          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE2_LOC2_REG; /*!< (@ 0x00000214) Device Characteristic Table Location-2 of Device2          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE2_LOC3_REG; /*!< (@ 0x00000218) Device Characteristic Table Location-3 of Device2          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE2_LOC4_REG; /*!< (@ 0x0000021C) Device Characteristic Table Location-4 of Device2          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE3_LOC1_REG; /*!< (@ 0x00000220) Device Characteristic Table Location-1 of Device3          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE3_LOC2_REG; /*!< (@ 0x00000224) Device Characteristic Table Location-2 of Device3          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE3_LOC3_REG; /*!< (@ 0x00000228) Device Characteristic Table Location-3 of Device3          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE3_LOC4_REG; /*!< (@ 0x0000022C) Device Characteristic Table Location-4 of Device3          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE4_LOC1_REG; /*!< (@ 0x00000230) Device Characteristic Table Location-1 of Device4          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE4_LOC2_REG; /*!< (@ 0x00000234) Device Characteristic Table Location-2 of Device4          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE4_LOC3_REG; /*!< (@ 0x00000238) Device Characteristic Table Location-3 of Device4          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE4_LOC4_REG; /*!< (@ 0x0000023C) Device Characteristic Table Location-4 of Device4          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE5_LOC1_REG; /*!< (@ 0x00000240) Device Characteristic Table Location-1 of Device5          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE5_LOC2_REG; /*!< (@ 0x00000244) Device Characteristic Table Location-2 of Device5          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE5_LOC3_REG; /*!< (@ 0x00000248) Device Characteristic Table Location-3 of Device5          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE5_LOC4_REG; /*!< (@ 0x0000024C) Device Characteristic Table Location-4 of Device5          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE6_LOC1_REG; /*!< (@ 0x00000250) Device Characteristic Table Location-1 of Device6          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE6_LOC2_REG; /*!< (@ 0x00000254) Device Characteristic Table Location-2 of Device6          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE6_LOC3_REG; /*!< (@ 0x00000258) Device Characteristic Table Location-3 of Device6          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE6_LOC4_REG; /*!< (@ 0x0000025C) Device Characteristic Table Location-4 of Device6          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE7_LOC1_REG; /*!< (@ 0x00000260) Device Characteristic Table Location-1 of Device7          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE7_LOC2_REG; /*!< (@ 0x00000264) Device Characteristic Table Location-2 of Device7          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE7_LOC3_REG; /*!< (@ 0x00000268) Device Characteristic Table Location-3 of Device7          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE7_LOC4_REG; /*!< (@ 0x0000026C) Device Characteristic Table Location-4 of Device7          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE8_LOC1_REG; /*!< (@ 0x00000270) Device Characteristic Table Location-1 of Device8          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE8_LOC2_REG; /*!< (@ 0x00000274) Device Characteristic Table Location-2 of Device8          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE8_LOC3_REG; /*!< (@ 0x00000278) Device Characteristic Table Location-3 of Device8          */
  __IOM uint32_t  I3C_DEV_CHAR_TABLE8_LOC4_REG; /*!< (@ 0x0000027C) Device Characteristic Table Location-4 of Device8          */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC1_REG;  /*!< (@ 0x00000280) Device Address Table of Device1                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC2_REG;  /*!< (@ 0x00000284) Device Address Table of Device2                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC3_REG;  /*!< (@ 0x00000288) Device Address Table of Device3                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC4_REG;  /*!< (@ 0x0000028C) Device Address Table of Device4                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC5_REG;  /*!< (@ 0x00000290) Device Address Table of Device5                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC6_REG;  /*!< (@ 0x00000294) Device Address Table of Device6                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC7_REG;  /*!< (@ 0x00000298) Device Address Table of Device7                            */
  __IOM uint32_t  I3C_DEV_ADDR_TABLE_LOC8_REG;  /*!< (@ 0x0000029C) Device Address Table of Device8                            */
} I3C_Type;                                     /*!< Size = 672 (0x2a0)                                                        */



/* =========================================================================================================================== */
/* ================                                           LCDC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief LCDC registers (LCDC)
  */

