antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x30030000) LCDC Structure                                             */
  __IOM uint32_t  LCDC_MODE_REG;                /*!< (@ 0x00000000) Display Mode                                               */
  __IOM uint32_t  LCDC_CLKCTRL_REG;             /*!< (@ 0x00000004) Clock Divider                                              */
  __IOM uint32_t  LCDC_BGCOLOR_REG;             /*!< (@ 0x00000008) Background Color                                           */
  __IOM uint32_t  LCDC_RESXY_REG;               /*!< (@ 0x0000000C) Resolution X,Y                                             */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  LCDC_FRONTPORCHXY_REG;        /*!< (@ 0x00000014) Front Porch X and Y                                        */
  __IOM uint32_t  LCDC_BLANKINGXY_REG;          /*!< (@ 0x00000018) Blanking X and Y                                           */
  __IOM uint32_t  LCDC_BACKPORCHXY_REG;         /*!< (@ 0x0000001C) Back Porch X and Y                                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  LCDC_STARTXY_REG;             /*!< (@ 0x00000024) Specifies the start position of the very first
                                                                    frame                                                      */
  __IOM uint32_t  LCDC_DBIB_CFG_REG;            /*!< (@ 0x00000028) MIPI DBIB Config Register                                  */
  __IOM uint32_t  LCDC_GPIO_REG;                /*!< (@ 0x0000002C) General Purpose IO (8-bits)                                */
  __IOM uint32_t  LCDC_LAYER0_MODE_REG;         /*!< (@ 0x00000030) Layer0 Mode                                                */
  __IOM uint32_t  LCDC_LAYER0_STARTXY_REG;      /*!< (@ 0x00000034) Layer0 Start XY                                            */
  __IOM uint32_t  LCDC_LAYER0_SIZEXY_REG;       /*!< (@ 0x00000038) Layer0 Size XY                                             */
  __IOM uint32_t  LCDC_LAYER0_BASEADDR_REG;     /*!< (@ 0x0000003C) Layer0 Base Addr                                           */
  __IOM uint32_t  LCDC_LAYER0_STRIDE_REG;       /*!< (@ 0x00000040) Layer0 Stride                                              */
  __IOM uint32_t  LCDC_LAYER0_RESXY_REG;        /*!< (@ 0x00000044) Layer0 Res XY                                              */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  LCDC_LAYER1_MODE_REG;         /*!< (@ 0x00000050) Layer1 Mode                                                */
  __IOM uint32_t  LCDC_LAYER1_STARTXY_REG;      /*!< (@ 0x00000054) Layer0 Start XY                                            */
  __IOM uint32_t  LCDC_LAYER1_SIZEXY_REG;       /*!< (@ 0x00000058) Layer1 Size XY                                             */
  __IOM uint32_t  LCDC_LAYER1_BASEADDR_REG;     /*!< (@ 0x0000005C) Layer1 Base Addr                                           */
  __IOM uint32_t  LCDC_LAYER1_STRIDE_REG;       /*!< (@ 0x00000060) Layer1 Stride                                              */
  __IOM uint32_t  LCDC_LAYER1_RESXY_REG;        /*!< (@ 0x00000064) Layer1 Res XY                                              */
  __IM  uint32_t  RESERVED3[32];
  __IOM uint32_t  LCDC_DBIB_CMD_REG;            /*!< (@ 0x000000E8) MIPI DBIB Command Register                                 */
  __IOM uint32_t  LCDC_DBIB_RDAT_REG;           /*!< (@ 0x000000EC) Data read by DBI Type-B/SPI interface                      */
  __IOM uint32_t  LCDC_CONF_REG;                /*!< (@ 0x000000F0) Supported config                                           */
  __IOM uint32_t  LCDC_IDREG_REG;               /*!< (@ 0x000000F4) Identification Register                                    */
  __IOM uint32_t  LCDC_INTERRUPT_REG;           /*!< (@ 0x000000F8) Interrupt Register                                         */
  __IOM uint32_t  LCDC_STATUS_REG;              /*!< (@ 0x000000FC) Status Register                                            */
  __IOM uint32_t  LCDC_COLMOD_REG;              /*!< (@ 0x00000100) Color mode status register                                 */
  __IM  uint32_t  RESERVED4[32];
  __IOM uint32_t  LCDC_CRC_REG;                 /*!< (@ 0x00000184) CRC check                                                  */
  __IM  uint32_t  RESERVED5[6];
  __IOM uint32_t  LCDC_FMTCTRL_REG;             /*!< (@ 0x000001A0) DBI and JDI format control                                 */
  __IOM uint32_t  LCDC_FMTCTRL_2_REG;           /*!< (@ 0x000001A4) DBI and JDI format control                                 */
  __IOM uint32_t  LCDC_CLKCTRL_CG_REG;          /*!< (@ 0x000001A8) Controls the CLock Gaters and the routing of
                                                                    format and pixel clock                                     */
  __IOM uint32_t  LCDC_FMTCTRL_3_REG;           /*!< (@ 0x000001AC) JDI format control                                         */
  __IM  uint32_t  RESERVED6[148];
  __IOM uint32_t  LCDC_PALETTE_BASE;            /*!< (@ 0x00000400) Global palette/gamma correction                            */
  __IM  uint32_t  RESERVED7[254];
  __IOM uint32_t  LCDC_PALETTE_255;             /*!< (@ 0x000007FC) Global palette/gamma correction                            */
} LCDC_Type;                                    /*!< Size = 2048 (0x800)                                                       */



/* =========================================================================================================================== */
/* ================                                          MEMCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MEMCTRL registers (MEMCTRL)
  */

typedef struct {                                /*!< (@ 0x50050000) MEMCTRL Structure                                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  MEM_PRIO_ARB1_4_REG;          /*!< (@ 0x00000004) Priority Control Register for arbiter 1, 2, 3
                                                                    and 4                                                      */
  __IOM uint32_t  MEM_PRIO_ARB5_8_REG;          /*!< (@ 0x00000008) Priority Control Register for arbiter 5, 6, 7
                                                                    and 8                                                      */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  MEM_STALL_REG;                /*!< (@ 0x00000010) Maximum Stall cycles Control Register                      */
  __IOM uint32_t  MEM_STATUS_REG;               /*!< (@ 0x00000014) Memory Arbiter Status Register                             */
  __IOM uint32_t  MEM_STATUS2_REG;              /*!< (@ 0x00000018) RAM cells Status Register                                  */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  CMI_CODE_BASE_REG;            /*!< (@ 0x00000020) CMAC code Base Address Register                            */
  __IOM uint32_t  CMI_DATA_BASE_REG;            /*!< (@ 0x00000024) CMAC data Base Address Register                            */
  __IOM uint32_t  CMI_SHARED_BASE_REG;          /*!< (@ 0x00000028) CMAC shared data Base Address Register                     */
  __IOM uint32_t  CMI_END_REG;                  /*!< (@ 0x0000002C) CMAC end Address Register                                  */
  __IOM uint32_t  CMAC_STATUS_REG;              /*!< (@ 0x00000030) Memory Arbiter Status Register                             */
  __IM  uint32_t  RESERVED3[15];
  __IOM uint32_t  BUSY_SET_REG;                 /*!< (@ 0x00000070) BSR Set Register                                           */
  __IOM uint32_t  BUSY_SET_REG2;                /*!< (@ 0x00000074) BSR2 Set Register                                          */
  __IOM uint32_t  BUSY_RESET_REG;               /*!< (@ 0x00000078) BSR Reset Register                                         */
  __IOM uint32_t  BUSY_RESET_REG2;              /*!< (@ 0x0000007C) BSR2 Reset Register                                        */
  __IOM uint32_t  BUSY_STAT_REG;                /*!< (@ 0x00000080) BSR Status Register                                        */
  __IOM uint32_t  BUSY_STAT_REG2;               /*!< (@ 0x00000084) BSR2 Status Register                                       */
} MEMCTRL_Type;                                 /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                          OQSPIF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief OQSPIF registers (OQSPIF)
  */

typedef struct {                                /*!< (@ 0x36000000) OQSPIF Structure                                           */
  __IOM uint32_t  OQSPIF_CTRLBUS_REG;           /*!< (@ 0x00000000) SPI Bus control register for the Manual mode               */
  __IOM uint32_t  OQSPIF_CTRLMODE_REG;          /*!< (@ 0x00000004) Mode Control register                                      */
  __IOM uint32_t  OQSPIF_RECVDATA_REG;          /*!< (@ 0x00000008) Received data for the Manual mode                          */
  __IOM uint32_t  OQSPIF_BURSTCMDA_REG;         /*!< (@ 0x0000000C) The way of reading in Auto mode (command register
                                                                    A)                                                         */
  __IOM uint32_t  OQSPIF_BURSTCMDB_REG;         /*!< (@ 0x00000010) The way of reading in Auto mode (command register
                                                                    B)                                                         */
  __IOM uint32_t  OQSPIF_STATUS_REG;            /*!< (@ 0x00000014) The status register of the OSPI controller                 */
  __IOM uint32_t  OQSPIF_WRITEDATA_REG;         /*!< (@ 0x00000018) Write data to SPI Bus for the Manual mode                  */
  __IOM uint32_t  OQSPIF_READDATA_REG;          /*!< (@ 0x0000001C) Read data from SPI Bus for the Manual mode                 */
  __IOM uint32_t  OQSPIF_DUMMYDATA_REG;         /*!< (@ 0x00000020) Send dummy clocks to SPI Bus for the Manual mode           */
  __IOM uint32_t  OQSPIF_ERASECTRL_REG;         /*!< (@ 0x00000024) OSPI Erase control register                                */
  __IOM uint32_t  OQSPIF_ERASECMDA_REG;         /*!< (@ 0x00000028) The way of erasing in Auto mode (command register
                                                                    A)                                                         */
  __IOM uint32_t  OQSPIF_ERASECMDB_REG;         /*!< (@ 0x0000002C) The way of erasing in Auto mode (command register
                                                                    B)                                                         */
  __IOM uint32_t  OQSPIF_ERASECMDC_REG;         /*!< (@ 0x00000030) The way of erasing in Auto mode (command register
                                                                    C)                                                         */
  __IOM uint32_t  OQSPIF_BURSTBRK_REG;          /*!< (@ 0x00000034) Read break sequence in Auto mode                           */
  __IOM uint32_t  OQSPIF_STATUSCMD_REG;         /*!< (@ 0x00000038) The way of reading the status of external device
                                                                    in Auto mode                                               */
  __IOM uint32_t  OQSPIF_CHCKERASE_REG;         /*!< (@ 0x0000003C) Check erase progress in Auto mode                          */
  __IOM uint32_t  OQSPIF_GP_REG;                /*!< (@ 0x00000040) OSPI General Purpose control register                      */
  __IM  uint32_t  RESERVED[47];
  __IOM uint32_t  OQSPIF_CTR_CTRL_REG;          /*!< (@ 0x00000100) Control register for the decryption engine of
                                                                    the OSPIC                                                  */
  __IOM uint32_t  OQSPIF_CTR_SADDR_REG;         /*!< (@ 0x00000104) Start address of the encrypted content in the
                                                                    OSPI flash                                                 */
  __IOM uint32_t  OQSPIF_CTR_EADDR_REG;         /*!< (@ 0x00000108) End address of the encrypted content in the OSPI
                                                                    flash                                                      */
  __IOM uint32_t  OQSPIF_CTR_NONCE_0_3_REG;     /*!< (@ 0x0000010C) Nonce bytes 0 to 3 for the AES-CTR algorithm               */
  __IOM uint32_t  OQSPIF_CTR_NONCE_4_7_REG;     /*!< (@ 0x00000110) Nonce bytes 4 to 7 for the AES-CTR algorithm               */
  __IOM uint32_t  OQSPIF_CTR_KEY_0_3_REG;       /*!< (@ 0x00000114) Key bytes 0 to 3 for the AES-CTR algorithm                 */
  __IOM uint32_t  OQSPIF_CTR_KEY_4_7_REG;       /*!< (@ 0x00000118) Key bytes 4 to 7 for the AES-CTR algorithm                 */
  __IOM uint32_t  OQSPIF_CTR_KEY_8_11_REG;      /*!< (@ 0x0000011C) Key bytes 8 to 11 for the AES-CTR algorithm                */
  __IOM uint32_t  OQSPIF_CTR_KEY_12_15_REG;     /*!< (@ 0x00000120) Key bytes 12 to 15 for the AES-CTR algorithm               */
  __IOM uint32_t  OQSPIF_CTR_KEY_16_19_REG;     /*!< (@ 0x00000124) Key bytes 16 to 19 for the AES-CTR algorithm               */
  __IOM uint32_t  OQSPIF_CTR_KEY_20_23_REG;     /*!< (@ 0x00000128) Key bytes 20 to 23 for the AES-CTR algorithm               */
  __IOM uint32_t  OQSPIF_CTR_KEY_24_27_REG;     /*!< (@ 0x0000012C) Key bytes 24 to 27 for the AES-CTR algorithm               */
  __IOM uint32_t  OQSPIF_CTR_KEY_28_31_REG;     /*!< (@ 0x00000130) Key bytes 28 to 31 for the AES-CTR algorithm               */
} OQSPIF_Type;                                  /*!< Size = 308 (0x134)                                                        */



/* =========================================================================================================================== */
/* ================                                           OTPC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief OTPC registers (OTPC)
  */

typedef struct {                                /*!< (@ 0x30070000) OTPC Structure                                             */
  __IOM uint32_t  OTPC_MODE_REG;                /*!< (@ 0x00000000) Mode register                                              */
  __IOM uint32_t  OTPC_STAT_REG;                /*!< (@ 0x00000004) Status register                                            */
  __IOM uint32_t  OTPC_PADDR_REG;               /*!< (@ 0x00000008) The address of the word that will be programmed,
                                                                    when the PROG mode is used.                                */
  __IOM uint32_t  OTPC_PWORD_REG;               /*!< (@ 0x0000000C) The 32-bit word that will be programmed, when
                                                                    the PROG mode is used.                                     */
  __IOM uint32_t  OTPC_TIM1_REG;                /*!< (@ 0x00000010) Various timing parameters of the OTP cell.                 */
  __IOM uint32_t  OTPC_TIM2_REG;                /*!< (@ 0x00000014) Various timing parameters of the OTP cell.                 */
} OTPC_Type;                                    /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           PCM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PCM1 registers (PCM1)
  */

typedef struct {                                /*!< (@ 0x50030300) PCM1 Structure                                             */
  __IOM uint32_t  PCM1_CTRL_REG;                /*!< (@ 0x00000000) PCM1 Control register                                      */
  __IOM uint32_t  PCM1_IN1_REG;                 /*!< (@ 0x00000004) PCM1 data in 1                                             */
  __IOM uint32_t  PCM1_IN2_REG;                 /*!< (@ 0x00000008) PCM1 data in 2                                             */
  __IOM uint32_t  PCM1_OUT1_REG;                /*!< (@ 0x0000000C) PCM1 data out 1                                            */
  __IOM uint32_t  PCM1_OUT2_REG;                /*!< (@ 0x00000010) PCM1 data out 2                                            */
} PCM1_Type;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                            PDC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PDC registers (PDC)
  */

typedef struct {                                /*!< (@ 0x50000200) PDC Structure                                              */
  __IOM uint32_t  PDC_CTRL0_REG;                /*!< (@ 0x00000000) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL1_REG;                /*!< (@ 0x00000004) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL2_REG;                /*!< (@ 0x00000008) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL3_REG;                /*!< (@ 0x0000000C) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL4_REG;                /*!< (@ 0x00000010) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL5_REG;                /*!< (@ 0x00000014) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL6_REG;                /*!< (@ 0x00000018) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL7_REG;                /*!< (@ 0x0000001C) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL8_REG;                /*!< (@ 0x00000020) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL9_REG;                /*!< (@ 0x00000024) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL10_REG;               /*!< (@ 0x00000028) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL11_REG;               /*!< (@ 0x0000002C) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL12_REG;               /*!< (@ 0x00000030) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL13_REG;               /*!< (@ 0x00000034) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL14_REG;               /*!< (@ 0x00000038) PDC control register                                       */
  __IOM uint32_t  PDC_CTRL15_REG;               /*!< (@ 0x0000003C) PDC control register                                       */
  __IM  uint32_t  RESERVED[16];
  __IOM uint32_t  PDC_ACKNOWLEDGE_REG;          /*!< (@ 0x00000080) Clear a pending PDC bit                                    */
  __IOM uint32_t  PDC_PENDING_REG;              /*!< (@ 0x00000084) Shows any pending wakup event                              */
  __IOM uint32_t  PDC_PENDING_SNC_REG;          /*!< (@ 0x00000088) Shows any pending IRQ to SNC                               */
  __IOM uint32_t  PDC_PENDING_CM33_REG;         /*!< (@ 0x0000008C) Shows any pending IRQ to CM33                              */
  __IOM uint32_t  PDC_PENDING_CMAC_REG;         /*!< (@ 0x00000090) Shows any pending IRQ to CMAC                              */
  __IOM uint32_t  PDC_SET_PENDING_REG;          /*!< (@ 0x00000094) Set a pending PDC bit                                      */
} PDC_Type;                                     /*!< Size = 152 (0x98)                                                         */



/* =========================================================================================================================== */
/* ================                                          PWMLED                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief PWMLED registers (PWMLED)
  */

typedef struct {                                /*!< (@ 0x50010600) PWMLED Structure                                           */
  __IOM uint32_t  LEDS_PWM_CTRL_REG;            /*!< (@ 0x00000000) LED PWM control register                                   */
  __IOM uint32_t  LEDS_STATUS_REG;              /*!< (@ 0x00000004) LEDS status register                                       */
  __IOM uint32_t  LED1_PWM_CONF_REG;            /*!< (@ 0x00000008) Defines duty cycle and load sel for LED1                   */
  __IOM uint32_t  LED2_PWM_CONF_REG;            /*!< (@ 0x0000000C) Defines duty cycle and load sel for LED2                   */
  __IOM uint32_t  LED3_PWM_CONF_REG;            /*!< (@ 0x00000010) Defines duty cycle and load sel for LED3                   */
  __IOM uint32_t  LEDS_DRV_CTRL_REG;            /*!< (@ 0x00000014) LED driver control register                                */
  __IOM uint32_t  LEDS_FREQUENCY_REG;           /*!< (@ 0x00000018) Defines the frequency of all the LEDs                      */
  __IOM uint32_t  LED_LOAD_SEL_REG;             /*!< (@ 0x0000001C) Load sel for LEDS                                          */
  __IOM uint32_t  LED_CURR_TRIM_REG;            /*!< (@ 0x00000020) Trim values for LEDS                                       */
} PWMLED_Type;                                  /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           QSPIC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief QSPIC registers (QSPIC)
  */

