antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x50040500) SDADC Structure                                            */
  __IOM uint32_t  SDADC_CTRL_REG;               /*!< (@ 0x00000000) Sigma Delta ADC Control Register                           */
  __IOM uint32_t  SDADC_PGA_CTRL_REG;           /*!< (@ 0x00000004) Sigma Delta ADC PGA Control Registers                      */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SDADC_CLEAR_INT_REG;          /*!< (@ 0x0000000C) Sigma Delta ADC Clear Interrupt Register                   */
  __IOM uint32_t  SDADC_RESULT_REG;             /*!< (@ 0x00000010) Sigma Delta ADC Result Register                            */
  __IOM uint32_t  SDADC_AUDIO_FILT_REG;         /*!< (@ 0x00000014) Sigma Delta ADC Audio Filter Register                      */
} SDADC_Type;                                   /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            SNC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SNC registers (SNC)
  */

typedef struct {                                /*!< (@ 0x50021000) SNC Structure                                              */
  __IOM uint32_t  SNC_STATUS_REG;               /*!< (@ 0x00000000) Sensor Node Status Register                                */
  __IOM uint32_t  SNC_WDOG_REG;                 /*!< (@ 0x00000004) Sensor Node Watchdog Register                              */
} SNC_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI registers (SPI)
  */

typedef struct {                                /*!< (@ 0x50020300) SPI Structure                                              */
  __IOM uint32_t  SPI_CTRL_REG;                 /*!< (@ 0x00000000) Spi control register                                       */
  __IOM uint32_t  SPI_CONFIG_REG;               /*!< (@ 0x00000004) Spi control register                                       */
  __IOM uint32_t  SPI_CLOCK_REG;                /*!< (@ 0x00000008) Spi clock register                                         */
  __IOM uint32_t  SPI_FIFO_CONFIG_REG;          /*!< (@ 0x0000000C) Spi fifo configuration register                            */
  __IOM uint32_t  SPI_IRQ_MASK_REG;             /*!< (@ 0x00000010) Spi interrupt mask register                                */
  __IOM uint32_t  SPI_STATUS_REG;               /*!< (@ 0x00000014) Spi status register                                        */
  __IOM uint32_t  SPI_FIFO_STATUS_REG;          /*!< (@ 0x00000018) SPI RX/TX fifo status register                             */
  __IOM uint32_t  SPI_FIFO_READ_REG;            /*!< (@ 0x0000001C) Spi RX fifo read register                                  */
  __IOM uint32_t  SPI_FIFO_WRITE_REG;           /*!< (@ 0x00000020) Spi TX fifo wtite register                                 */
  __IOM uint32_t  SPI_CS_CONFIG_REG;            /*!< (@ 0x00000024) Spi cs configuration register                              */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SPI_TXBUFFER_FORCE_REG;       /*!< (@ 0x0000002C) SPI TX buffer force low value                              */
} SPI_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI2 registers (SPI2)
  */

typedef struct {                                /*!< (@ 0x50020400) SPI2 Structure                                             */
  __IOM uint32_t  SPI2_CTRL_REG;                /*!< (@ 0x00000000) Spi control register                                       */
  __IOM uint32_t  SPI2_CONFIG_REG;              /*!< (@ 0x00000004) Spi control register                                       */
  __IOM uint32_t  SPI2_CLOCK_REG;               /*!< (@ 0x00000008) Spi clock register                                         */
  __IOM uint32_t  SPI2_FIFO_CONFIG_REG;         /*!< (@ 0x0000000C) Spi fifo configuration register                            */
  __IOM uint32_t  SPI2_IRQ_MASK_REG;            /*!< (@ 0x00000010) Spi interrupt mask register                                */
  __IOM uint32_t  SPI2_STATUS_REG;              /*!< (@ 0x00000014) Spi status register                                        */
  __IOM uint32_t  SPI2_FIFO_STATUS_REG;         /*!< (@ 0x00000018) SPI RX/TX fifo status register                             */
  __IOM uint32_t  SPI2_FIFO_READ_REG;           /*!< (@ 0x0000001C) Spi RX fifo read register                                  */
  __IOM uint32_t  SPI2_FIFO_WRITE_REG;          /*!< (@ 0x00000020) Spi TX fifo wtite register                                 */
  __IOM uint32_t  SPI2_CS_CONFIG_REG;           /*!< (@ 0x00000024) Spi cs configuration register                              */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SPI2_TXBUFFER_FORCE_REG;      /*!< (@ 0x0000002C) SPI TX buffer force low value                              */
} SPI2_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI3                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI3 registers (SPI3)
  */

