antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x51000200) SPI3 Structure                                             */
  __IOM uint32_t  SPI3_CTRL_REG;                /*!< (@ 0x00000000) Spi control register                                       */
  __IOM uint32_t  SPI3_CONFIG_REG;              /*!< (@ 0x00000004) Spi control register                                       */
  __IOM uint32_t  SPI3_CLOCK_REG;               /*!< (@ 0x00000008) Spi clock register                                         */
  __IOM uint32_t  SPI3_FIFO_CONFIG_REG;         /*!< (@ 0x0000000C) Spi fifo configuration register                            */
  __IOM uint32_t  SPI3_IRQ_MASK_REG;            /*!< (@ 0x00000010) Spi interrupt mask register                                */
  __IOM uint32_t  SPI3_STATUS_REG;              /*!< (@ 0x00000014) Spi status register                                        */
  __IOM uint32_t  SPI3_FIFO_STATUS_REG;         /*!< (@ 0x00000018) SPI RX/TX fifo status register                             */
  __IOM uint32_t  SPI3_FIFO_READ_REG;           /*!< (@ 0x0000001C) Spi RX fifo read register                                  */
  __IOM uint32_t  SPI3_FIFO_WRITE_REG;          /*!< (@ 0x00000020) Spi TX fifo wtite register                                 */
  __IOM uint32_t  SPI3_CS_CONFIG_REG;           /*!< (@ 0x00000024) Spi cs configuration register                              */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SPI3_TXBUFFER_FORCE_REG;      /*!< (@ 0x0000002C) SPI TX buffer force low value                              */
} SPI3_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SRC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SRC1 registers (SRC1)
  */

typedef struct {                                /*!< (@ 0x50030100) SRC1 Structure                                             */
  __IOM uint32_t  SRC1_CTRL_REG;                /*!< (@ 0x00000000) SRC control register                                       */
  __IOM uint32_t  SRC1_IN_FS_REG;               /*!< (@ 0x00000004) SRC Sample input rate                                      */
  __IOM uint32_t  SRC1_OUT_FS_REG;              /*!< (@ 0x00000008) SRC Sample output rate                                     */
  __IOM uint32_t  SRC1_IN1_REG;                 /*!< (@ 0x0000000C) SRC data in 1                                              */
  __IOM uint32_t  SRC1_IN2_REG;                 /*!< (@ 0x00000010) SRC data in 2                                              */
  __IOM uint32_t  SRC1_OUT1_REG;                /*!< (@ 0x00000014) SRC data out 1                                             */
  __IOM uint32_t  SRC1_OUT2_REG;                /*!< (@ 0x00000018) SRC data out 2                                             */
  __IOM uint32_t  SRC1_MUX_REG;                 /*!< (@ 0x0000001C) SRC mux register                                           */
  __IOM uint32_t  SRC1_COEF10_SET1_REG;         /*!< (@ 0x00000020) SRC coefficient 1,0 set 1                                  */
  __IOM uint32_t  SRC1_COEF32_SET1_REG;         /*!< (@ 0x00000024) SRC coefficient 3,2 set 1                                  */
  __IOM uint32_t  SRC1_COEF54_SET1_REG;         /*!< (@ 0x00000028) SRC coefficient 5,4 set 1                                  */
  __IOM uint32_t  SRC1_COEF76_SET1_REG;         /*!< (@ 0x0000002C) SRC coefficient 7,6 set 1                                  */
  __IOM uint32_t  SRC1_COEF98_SET1_REG;         /*!< (@ 0x00000030) SRC coefficient 9,8 set 1                                  */
  __IOM uint32_t  SRC1_COEF0A_SET1_REG;         /*!< (@ 0x00000034) SRC coefficient 10 set 1                                   */
} SRC1_Type;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                           SRC2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SRC2 registers (SRC2)
  */

typedef struct {                                /*!< (@ 0x50030200) SRC2 Structure                                             */
  __IOM uint32_t  SRC2_CTRL_REG;                /*!< (@ 0x00000000) SRC control register                                       */
  __IOM uint32_t  SRC2_IN_FS_REG;               /*!< (@ 0x00000004) SRC Sample input rate                                      */
  __IOM uint32_t  SRC2_OUT_FS_REG;              /*!< (@ 0x00000008) SRC Sample output rate                                     */
  __IOM uint32_t  SRC2_IN1_REG;                 /*!< (@ 0x0000000C) SRC data in 1                                              */
  __IOM uint32_t  SRC2_IN2_REG;                 /*!< (@ 0x00000010) SRC data in 2                                              */
  __IOM uint32_t  SRC2_OUT1_REG;                /*!< (@ 0x00000014) SRC data out 1                                             */
  __IOM uint32_t  SRC2_OUT2_REG;                /*!< (@ 0x00000018) SRC data out 2                                             */
  __IOM uint32_t  SRC2_MUX_REG;                 /*!< (@ 0x0000001C) SRC mux register                                           */
  __IOM uint32_t  SRC2_COEF10_SET1_REG;         /*!< (@ 0x00000020) SRC coefficient 1,0 set 1                                  */
  __IOM uint32_t  SRC2_COEF32_SET1_REG;         /*!< (@ 0x00000024) SRC coefficient 3,2 set 1                                  */
  __IOM uint32_t  SRC2_COEF54_SET1_REG;         /*!< (@ 0x00000028) SRC coefficient 5,4 set 1                                  */
  __IOM uint32_t  SRC2_COEF76_SET1_REG;         /*!< (@ 0x0000002C) SRC coefficient 7,6 set 1                                  */
  __IOM uint32_t  SRC2_COEF98_SET1_REG;         /*!< (@ 0x00000030) SRC coefficient 9,8 set 1                                  */
  __IOM uint32_t  SRC2_COEF0A_SET1_REG;         /*!< (@ 0x00000034) SRC coefficient 10 set 1                                   */
} SRC2_Type;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                         SYS_WDOG                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SYS_WDOG registers (SYS_WDOG)
  */

typedef struct {                                /*!< (@ 0x50000700) SYS_WDOG Structure                                         */
  __IOM uint32_t  WATCHDOG_REG;                 /*!< (@ 0x00000000) Watchdog timer register.                                   */
  __IOM uint32_t  WATCHDOG_CTRL_REG;            /*!< (@ 0x00000004) Watchdog control register.                                 */
} SYS_WDOG_Type;                                /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                          SYSBUS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SYSBUS registers (SYSBUS)
  */

