antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x30020000) SYSBUS Structure                                           */
  __IOM uint32_t  AHB_DMA_PL1_REG;              /*!< (@ 0x00000000) AHB-DMA layer priority level LCD                           */
  __IOM uint32_t  AHB_DMA_PL2_REG;              /*!< (@ 0x00000004) AHB-DMA layer priority level GPU                           */
  __IOM uint32_t  AHB_DMA_PL3_REG;              /*!< (@ 0x00000008) AHB-DMA layer Priority level GEN-DMA                       */
  __IOM uint32_t  AHB_DMA_PL4_REG;              /*!< (@ 0x0000000C) AHB-DMA layer Priority level CRYPTO-DMA                    */
  __IOM uint32_t  AHB_DMA_PL5_REG;              /*!< (@ 0x00000010) AHB-DMA layer Priority level MMC                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  AHB_DMA_PL7_REG;              /*!< (@ 0x00000018) AHB-DMA layer Priority level AHB-S to AHB_DMA
                                                                    arbiter registers                                          */
  __IM  uint32_t  RESERVED1[11];
  __IOM uint32_t  AHB_DMA_DFLT_MASTER_REG;      /*!< (@ 0x00000048) Default master ID number (AHB DMA layer only)              */
  __IOM uint32_t  AHB_DMA_WTEN_REG;             /*!< (@ 0x0000004C) Weighted-Token Arbitration Scheme Enable (AHB
                                                                    DMA layer only)                                            */
  __IOM uint32_t  AHB_DMA_TCL_REG;              /*!< (@ 0x00000050) Master clock refresh period (AHB DMA layer only)           */
  __IOM uint32_t  AHB_DMA_CCLM1_REG;            /*!< (@ 0x00000054) LCD Master clock tokens                                    */
  __IOM uint32_t  AHB_DMA_CCLM2_REG;            /*!< (@ 0x00000058) GPU Master clock tokens                                    */
  __IOM uint32_t  AHB_DMA_CCLM3_REG;            /*!< (@ 0x0000005C) GEN-DMA Master clock tokens                                */
  __IOM uint32_t  AHB_DMA_CCLM4_REG;            /*!< (@ 0x00000060) CRYPTO-DMA Master clock tokens                             */
  __IOM uint32_t  AHB_DMA_CCLM5_REG;            /*!< (@ 0x00000064) MMC Master clock tokens                                    */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  AHB_DMA_CCLM7_REG;            /*!< (@ 0x0000006C) AHB-S Master clock tokens                                  */
  __IM  uint32_t  RESERVED3[8];
  __IOM uint32_t  AHB_DMA_VERSION_REG;          /*!< (@ 0x00000090) Version ID (AHB DMA layer only)                            */
} SYSBUS_Type;                                  /*!< Size = 148 (0x94)                                                         */



/* =========================================================================================================================== */
/* ================                                        SYSBUS_ICM                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief SYSBUS_ICM registers (SYSBUS_ICM)
  */

typedef struct {                                /*!< (@ 0x50040600) SYSBUS_ICM Structure                                       */
  __IOM uint32_t  QSPIFL2_ARB_REG;              /*!< (@ 0x00000000) QSPIFL2_ARB_REG                                            */
  __IOM uint32_t  QSPIRAM_ARB_REG;              /*!< (@ 0x00000004) QSPIRAM_ARB_REG                                            */
  __IOM uint32_t  AHBREG_ARB_REG;               /*!< (@ 0x00000008) AHBREG_ARB_REG                                             */
  __IOM uint32_t  APBF_ARB_REG;                 /*!< (@ 0x0000000C) APBF_ARB_REG                                               */
  __IOM uint32_t  APB_ARB_REG;                  /*!< (@ 0x00000010) APB_ARB_REG                                                */
} SYSBUS_ICM_Type;                              /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER registers (TIMER)
  */

typedef struct {                                /*!< (@ 0x50010000) TIMER Structure                                            */
  __IOM uint32_t  TIMER_CTRL_REG;               /*!< (@ 0x00000000) Timer control register                                     */
  __IOM uint32_t  TIMER_TIMER_VAL_REG;          /*!< (@ 0x00000004) Timer counter value                                        */
  __IOM uint32_t  TIMER_STATUS_REG;             /*!< (@ 0x00000008) Timer status register                                      */
  __IOM uint32_t  TIMER_GPIO1_CONF_REG;         /*!< (@ 0x0000000C) Timer gpio1 selection                                      */
  __IOM uint32_t  TIMER_GPIO2_CONF_REG;         /*!< (@ 0x00000010) Timer gpio2 selection                                      */
  __IOM uint32_t  TIMER_SETTINGS_REG;           /*!< (@ 0x00000014) Timer reload value and Delay in shot mode                  */
  __IOM uint32_t  TIMER_SHOTWIDTH_REG;          /*!< (@ 0x00000018) Timer Shot duration in shot mode                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TIMER_CAPTURE_GPIO1_REG;      /*!< (@ 0x00000020) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER_CAPTURE_GPIO2_REG;      /*!< (@ 0x00000024) Timer value for event on GPIO2                             */
  __IOM uint32_t  TIMER_PRESCALER_VAL_REG;      /*!< (@ 0x00000028) Timer prescaler counter valuew                             */
  __IOM uint32_t  TIMER_PWM_CTRL_REG;           /*!< (@ 0x0000002C) Timer pwm frequency register                               */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TIMER_GPIO3_CONF_REG;         /*!< (@ 0x00000034) Timer gpio3 selection                                      */
  __IOM uint32_t  TIMER_GPIO4_CONF_REG;         /*!< (@ 0x00000038) Timer gpio4 selection                                      */
  __IOM uint32_t  TIMER_CAPTURE_GPIO3_REG;      /*!< (@ 0x0000003C) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER_CAPTURE_GPIO4_REG;      /*!< (@ 0x00000040) Timer value for event on GPIO1                             */
  __IOM uint32_t  TIMER_PULSE_CNT_CTRL_REG;     /*!< (@ 0x00000044) Timer pulse counter ctrl register                          */
  __IOM uint32_t  TIMER_ONESHOT_TRIGGER_REG;    /*!< (@ 0x00000048) Timer oneshot trigger register                             */
  __IOM uint32_t  TIMER_PWM_SYNC_REG;           /*!< (@ 0x0000004C) Timer pwm synchronisation register                         */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  TIMER_CLEAR_IRQ_REG;          /*!< (@ 0x00000054) Timer clear interrupt                                      */
  __IOM uint32_t  TIMER_CLEAR_IRQ_PULSE_REG;    /*!< (@ 0x00000058) Timer clear pulse interrupt                                */
} TIMER_Type;                                   /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER2 registers (TIMER2)
  */

