antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
typedef struct {                                /*!< (@ 0x50000900) WAKEUP Structure                                           */
  __IOM uint32_t  WKUP_CTRL_REG;                /*!< (@ 0x00000000) Control register for the wakeup counter                    */
  __IOM uint32_t  WKUP_RESET_IRQ_REG;           /*!< (@ 0x00000004) Reset wakeup interrupt                                     */
  __IOM uint32_t  WKUP_SELECT_P0_REG;           /*!< (@ 0x00000008) Select which inputs from P0 port can trigger
                                                                    wkup counter                                               */
  __IOM uint32_t  WKUP_SELECT_P1_REG;           /*!< (@ 0x0000000C) Select which inputs from P1 port can trigger
                                                                    wkup counter                                               */
  __IOM uint32_t  WKUP_SELECT_P2_REG;           /*!< (@ 0x00000010) Select which inputs from P2 port can trigger
                                                                    wkup counter                                               */
  __IOM uint32_t  WKUP_POL_P0_REG;              /*!< (@ 0x00000014) select the sesitivity polarity for each P0 input           */
  __IOM uint32_t  WKUP_POL_P1_REG;              /*!< (@ 0x00000018) select the sesitivity polarity for each P1 input           */
  __IOM uint32_t  WKUP_POL_P2_REG;              /*!< (@ 0x0000001C) select the sesitivity polarity for each P2 input           */
  __IOM uint32_t  WKUP_STATUS_P0_REG;           /*!< (@ 0x00000020) Event status register for P0                               */
  __IOM uint32_t  WKUP_STATUS_P1_REG;           /*!< (@ 0x00000024) Event status register for P1                               */
  __IOM uint32_t  WKUP_STATUS_P2_REG;           /*!< (@ 0x00000028) Event status register for P2                               */
  __IOM uint32_t  WKUP_CLEAR_P0_REG;            /*!< (@ 0x0000002C) Clear event register for P0                                */
  __IOM uint32_t  WKUP_CLEAR_P1_REG;            /*!< (@ 0x00000030) Clear event register for P1                                */
  __IOM uint32_t  WKUP_CLEAR_P2_REG;            /*!< (@ 0x00000034) Clear event register for P2                                */
  __IOM uint32_t  WKUP_SEL_GPIO_P0_REG;         /*!< (@ 0x00000038) Enable fast wakeup and enable GPIO_P0_IRQ                  */
  __IOM uint32_t  WKUP_SEL_GPIO_P1_REG;         /*!< (@ 0x0000003C) Enable fast wakeup and enable GPIO_P1_IRQ                  */
  __IOM uint32_t  WKUP_SEL_GPIO_P2_REG;         /*!< (@ 0x00000040) Enable fast wakeup and enable GPIO_P2_IRQ                  */
  __IOM uint32_t  WKUP_SEL1_GPIO_P0_REG;        /*!< (@ 0x00000044) Configure to generate level or edge sensitive
                                                                    IRQ on P0 events                                           */
  __IOM uint32_t  WKUP_SEL1_GPIO_P1_REG;        /*!< (@ 0x00000048) Configure to generate level or edge sensitive
                                                                    IRQ on P1 events                                           */
  __IOM uint32_t  WKUP_SEL1_GPIO_P2_REG;        /*!< (@ 0x0000004C) Configure to generate level or edge sensitive
                                                                    IRQ on P2 events                                           */
} WAKEUP_Type;                                  /*!< Size = 80 (0x50)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define AES_HASH_BASE               0x30040000UL
#define ANAMISC_BIF_BASE            0x50050600UL
#define CACHE_BASE                  0x100C0000UL
#define CHARGER_BASE                0x51000600UL
#define CHG_DET_BASE                0x50040300UL
#define CHIP_VERSION_BASE           0x50040000UL
#define CRG_AUD_BASE                0x50030000UL
#define CRG_CTRL_BASE               0x50060000UL
#define CRG_GPU_BASE                0x51001000UL
#define CRG_SNC_BASE                0x50020900UL
#define CRG_SYS_BASE                0x50040400UL
#define CRG_TOP_BASE                0x50000000UL
#define CRG_VSYS_BASE               0x50000B00UL
#define CRG_XTAL_BASE               0x50050400UL
#define DCACHE_BASE                 0x30100000UL
#define DCDC_BASE                   0x50000300UL
#define DCDC_BOOST_BASE             0x50000500UL
#define DMA_BASE                    0x51000400UL
#define EMMC_BASE                   0x30058000UL
#define GPADC_BASE                  0x50020800UL
#define GPIO_BASE                   0x50050100UL
#define GPREG_BASE                  0x50040100UL
#define GPU_CORE_BASE               0x51001200UL
#define GPU_REG_BASE                0x51001100UL
#define I2C_BASE                    0x50020600UL
#define I2C2_BASE                   0x50020700UL
#define I2C3_BASE                   0x50020500UL
#define I3C_BASE                    0x50020C00UL
#define LCDC_BASE                   0x30030000UL
#define MEMCTRL_BASE                0x50050000UL
#define OQSPIF_BASE                 0x36000000UL
#define OTPC_BASE                   0x30070000UL
#define PCM1_BASE                   0x50030300UL
#define PDC_BASE                    0x50000200UL
#define PWMLED_BASE                 0x50010600UL
#define QSPIC_BASE                  0x46000000UL
#define QSPIC2_BASE                 0x26000000UL
#define RTC_BASE                    0x50000800UL
#define SDADC_BASE                  0x50040500UL
#define SNC_BASE                    0x50021000UL
#define SPI_BASE                    0x50020300UL
#define SPI2_BASE                   0x50020400UL
#define SPI3_BASE                   0x51000200UL
#define SRC1_BASE                   0x50030100UL
#define SRC2_BASE                   0x50030200UL
#define SYS_WDOG_BASE               0x50000700UL
#define SYSBUS_BASE                 0x30020000UL
#define SYSBUS_ICM_BASE             0x50040600UL
#define TIMER_BASE                  0x50010000UL
#define TIMER2_BASE                 0x50010100UL
#define TIMER3_BASE                 0x50010200UL
#define TIMER4_BASE                 0x50010300UL
#define TIMER5_BASE                 0x50010400UL
#define TIMER6_BASE                 0x50010500UL
#define UART_BASE                   0x50020000UL
#define UART2_BASE                  0x50020100UL
#define UART3_BASE                  0x50020200UL
#define USB_BASE                    0x51000000UL
#define VAD_BASE                    0x50000C00UL
#define WAKEUP_BASE                 0x50000900UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

