antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ====================================================  CACHE_CTRL2_REG  ==================================================== */
#define CACHE_CACHE_CTRL2_REG_CACHE_READY_Pos (21UL)                /*!< CACHE_READY (Bit 21)                                  */
#define CACHE_CACHE_CTRL2_REG_CACHE_READY_Msk (0x200000UL)          /*!< CACHE_READY (Bitfield-Mask: 0x01)                     */
#define CACHE_CACHE_CTRL2_REG_CACHE_RAM_INIT_Pos (20UL)             /*!< CACHE_RAM_INIT (Bit 20)                               */
#define CACHE_CACHE_CTRL2_REG_CACHE_RAM_INIT_Msk (0x100000UL)       /*!< CACHE_RAM_INIT (Bitfield-Mask: 0x01)                  */
#define CACHE_CACHE_CTRL2_REG_CACHE_FLUSHED_Pos (19UL)              /*!< CACHE_FLUSHED (Bit 19)                                */
#define CACHE_CACHE_CTRL2_REG_CACHE_FLUSHED_Msk (0x80000UL)         /*!< CACHE_FLUSHED (Bitfield-Mask: 0x01)                   */
#define CACHE_CACHE_CTRL2_REG_CACHE_FLUSH_DISABLE_Pos (18UL)        /*!< CACHE_FLUSH_DISABLE (Bit 18)                          */
#define CACHE_CACHE_CTRL2_REG_CACHE_FLUSH_DISABLE_Msk (0x40000UL)   /*!< CACHE_FLUSH_DISABLE (Bitfield-Mask: 0x01)             */
#define CACHE_CACHE_CTRL2_REG_CACHE_USE_FULL_DB_RANGE_Pos (16UL)    /*!< CACHE_USE_FULL_DB_RANGE (Bit 16)                      */
#define CACHE_CACHE_CTRL2_REG_CACHE_USE_FULL_DB_RANGE_Msk (0x30000UL) /*!< CACHE_USE_FULL_DB_RANGE (Bitfield-Mask: 0x03)       */
#define CACHE_CACHE_CTRL2_REG_CACHE_MHCLKEN_DISABLE_Pos (15UL)      /*!< CACHE_MHCLKEN_DISABLE (Bit 15)                        */
#define CACHE_CACHE_CTRL2_REG_CACHE_MHCLKEN_DISABLE_Msk (0x8000UL)  /*!< CACHE_MHCLKEN_DISABLE (Bitfield-Mask: 0x01)           */
#define CACHE_CACHE_CTRL2_REG_CACHE_CWF_DISABLE_Pos (14UL)          /*!< CACHE_CWF_DISABLE (Bit 14)                            */
#define CACHE_CACHE_CTRL2_REG_CACHE_CWF_DISABLE_Msk (0x4000UL)      /*!< CACHE_CWF_DISABLE (Bitfield-Mask: 0x01)               */
#define CACHE_CACHE_CTRL2_REG_CACHE_CGEN_Pos (13UL)                 /*!< CACHE_CGEN (Bit 13)                                   */
#define CACHE_CACHE_CTRL2_REG_CACHE_CGEN_Msk (0x2000UL)             /*!< CACHE_CGEN (Bitfield-Mask: 0x01)                      */
#define CACHE_CACHE_CTRL2_REG_CACHE_WEN_Pos (12UL)                  /*!< CACHE_WEN (Bit 12)                                    */
#define CACHE_CACHE_CTRL2_REG_CACHE_WEN_Msk (0x1000UL)              /*!< CACHE_WEN (Bitfield-Mask: 0x01)                       */
#define CACHE_CACHE_CTRL2_REG_CACHE_LEN_Pos (0UL)                   /*!< CACHE_LEN (Bit 0)                                     */
#define CACHE_CACHE_CTRL2_REG_CACHE_LEN_Msk (0xfffUL)               /*!< CACHE_LEN (Bitfield-Mask: 0xfff)                      */
/* ====================================================  CACHE_FLASH_REG  ==================================================== */
#define CACHE_CACHE_FLASH_REG_FLASH_REGION_BASE_Pos (16UL)          /*!< FLASH_REGION_BASE (Bit 16)                            */
#define CACHE_CACHE_FLASH_REG_FLASH_REGION_BASE_Msk (0xffff0000UL)  /*!< FLASH_REGION_BASE (Bitfield-Mask: 0xffff)             */
#define CACHE_CACHE_FLASH_REG_FLASH_REGION_OFFSET_Pos (4UL)         /*!< FLASH_REGION_OFFSET (Bit 4)                           */
#define CACHE_CACHE_FLASH_REG_FLASH_REGION_OFFSET_Msk (0xfff0UL)    /*!< FLASH_REGION_OFFSET (Bitfield-Mask: 0xfff)            */
#define CACHE_CACHE_FLASH_REG_FLASH_REGION_SIZE_Pos (0UL)           /*!< FLASH_REGION_SIZE (Bit 0)                             */
#define CACHE_CACHE_FLASH_REG_FLASH_REGION_SIZE_Msk (0xfUL)         /*!< FLASH_REGION_SIZE (Bitfield-Mask: 0x0f)               */
/* ==================================================  CACHE_MRM_CTRL_REG  =================================================== */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_HITS_THRES_STATUS_Pos (4UL) /*!< MRM_IRQ_HITS_THRES_STATUS (Bit 4)                    */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_HITS_THRES_STATUS_Msk (0x10UL) /*!< MRM_IRQ_HITS_THRES_STATUS (Bitfield-Mask: 0x01)   */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MISSES_THRES_STATUS_Pos (3UL) /*!< MRM_IRQ_MISSES_THRES_STATUS (Bit 3)                */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MISSES_THRES_STATUS_Msk (0x8UL) /*!< MRM_IRQ_MISSES_THRES_STATUS (Bitfield-Mask: 0x01) */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Pos (2UL)      /*!< MRM_IRQ_TINT_STATUS (Bit 2)                           */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Msk (0x4UL)    /*!< MRM_IRQ_TINT_STATUS (Bitfield-Mask: 0x01)             */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Pos (1UL)             /*!< MRM_IRQ_MASK (Bit 1)                                  */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Msk (0x2UL)           /*!< MRM_IRQ_MASK (Bitfield-Mask: 0x01)                    */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_START_Pos (0UL)                /*!< MRM_START (Bit 0)                                     */
#define CACHE_CACHE_MRM_CTRL_REG_MRM_START_Msk (0x1UL)              /*!< MRM_START (Bitfield-Mask: 0x01)                       */
/* =================================================  CACHE_MRM_HITS1WS_REG  ================================================= */
#define CACHE_CACHE_MRM_HITS1WS_REG_MRM_HITS1WS_Pos (0UL)           /*!< MRM_HITS1WS (Bit 0)                                   */
#define CACHE_CACHE_MRM_HITS1WS_REG_MRM_HITS1WS_Msk (0xffffffffUL)  /*!< MRM_HITS1WS (Bitfield-Mask: 0xffffffff)               */
/* ==================================================  CACHE_MRM_HITS_REG  =================================================== */
#define CACHE_CACHE_MRM_HITS_REG_MRM_HITS_Pos (0UL)                 /*!< MRM_HITS (Bit 0)                                      */
#define CACHE_CACHE_MRM_HITS_REG_MRM_HITS_Msk (0xffffffffUL)        /*!< MRM_HITS (Bitfield-Mask: 0xffffffff)                  */
/* ===============================================  CACHE_MRM_HITS_THRES_REG  ================================================ */
#define CACHE_CACHE_MRM_HITS_THRES_REG_MRM_HITS_THRES_Pos (0UL)     /*!< MRM_HITS_THRES (Bit 0)                                */
#define CACHE_CACHE_MRM_HITS_THRES_REG_MRM_HITS_THRES_Msk (0xffffffffUL) /*!< MRM_HITS_THRES (Bitfield-Mask: 0xffffffff)       */
/* =================================================  CACHE_MRM_MISSES_REG  ================================================== */
#define CACHE_CACHE_MRM_MISSES_REG_MRM_MISSES_Pos (0UL)             /*!< MRM_MISSES (Bit 0)                                    */
#define CACHE_CACHE_MRM_MISSES_REG_MRM_MISSES_Msk (0xffffffffUL)    /*!< MRM_MISSES (Bitfield-Mask: 0xffffffff)                */
/* ==============================================  CACHE_MRM_MISSES_THRES_REG  =============================================== */
#define CACHE_CACHE_MRM_MISSES_THRES_REG_MRM_MISSES_THRES_Pos (0UL) /*!< MRM_MISSES_THRES (Bit 0)                              */
#define CACHE_CACHE_MRM_MISSES_THRES_REG_MRM_MISSES_THRES_Msk (0xffffffffUL) /*!< MRM_MISSES_THRES (Bitfield-Mask: 0xffffffff) */
/* ==================================================  CACHE_MRM_TINT_REG  =================================================== */
#define CACHE_CACHE_MRM_TINT_REG_MRM_TINT_Pos (0UL)                 /*!< MRM_TINT (Bit 0)                                      */
#define CACHE_CACHE_MRM_TINT_REG_MRM_TINT_Msk (0x7ffffUL)           /*!< MRM_TINT (Bitfield-Mask: 0x7ffff)                     */
/* =====================================================  SWD_RESET_REG  ===================================================== */
#define CACHE_SWD_RESET_REG_SWD_HW_RESET_REQ_Pos (0UL)              /*!< SWD_HW_RESET_REQ (Bit 0)                              */
#define CACHE_SWD_RESET_REG_SWD_HW_RESET_REQ_Msk (0x1UL)            /*!< SWD_HW_RESET_REQ (Bitfield-Mask: 0x01)                */


/* =========================================================================================================================== */
/* ================                                          CHARGER                                          ================ */
/* =========================================================================================================================== */

