antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_CHARGE_Pos (0UL)        /*!< V_CHARGE (Bit 0)                                      */
#define CHARGER_CHARGER_VOLTAGE_PARAM_REG_V_CHARGE_Msk (0x3fUL)     /*!< V_CHARGE (Bitfield-Mask: 0x3f)                        */
/* ==============================================  CHARGER_VOLTAGE_STATUS_REG  =============================================== */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_OVP_SET_Pos (18UL)     /*!< V_OVP_SET (Bit 18)                                    */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_OVP_SET_Msk (0xfc0000UL) /*!< V_OVP_SET (Bitfield-Mask: 0x3f)                     */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_REPLENISH_SET_Pos (12UL) /*!< V_REPLENISH_SET (Bit 12)                            */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_REPLENISH_SET_Msk (0x3f000UL) /*!< V_REPLENISH_SET (Bitfield-Mask: 0x3f)          */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_PRECHARGE_SET_Pos (6UL) /*!< V_PRECHARGE_SET (Bit 6)                              */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_PRECHARGE_SET_Msk (0xfc0UL) /*!< V_PRECHARGE_SET (Bitfield-Mask: 0x3f)            */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_CHARGE_SET_Pos (0UL)   /*!< V_CHARGE_SET (Bit 0)                                  */
#define CHARGER_CHARGER_VOLTAGE_STATUS_REG_V_CHARGE_SET_Msk (0x3fUL) /*!< V_CHARGE_SET (Bitfield-Mask: 0x3f)                   */
/* ==============================================  CHARGER_VOVP_COMP_TIMER_REG  ============================================== */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_OVP_INTERVAL_CHECK_TIMER_Pos (26UL) /*!< OVP_INTERVAL_CHECK_TIMER (Bit 26)         */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_OVP_INTERVAL_CHECK_TIMER_Msk (0xfc000000UL) /*!< OVP_INTERVAL_CHECK_TIMER (Bitfield-Mask: 0x3f) */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_VBAT_OVP_COMP_TIMER_Pos (16UL) /*!< VBAT_OVP_COMP_TIMER (Bit 16)                   */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_VBAT_OVP_COMP_TIMER_Msk (0x3ff0000UL) /*!< VBAT_OVP_COMP_TIMER (Bitfield-Mask: 0x3ff) */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_OVP_INTERVAL_CHECK_THRES_Pos (10UL) /*!< OVP_INTERVAL_CHECK_THRES (Bit 10)         */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_OVP_INTERVAL_CHECK_THRES_Msk (0xfc00UL) /*!< OVP_INTERVAL_CHECK_THRES (Bitfield-Mask: 0x3f) */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_VBAT_OVP_COMP_SETTLING_Pos (0UL) /*!< VBAT_OVP_COMP_SETTLING (Bit 0)               */
#define CHARGER_CHARGER_VOVP_COMP_TIMER_REG_VBAT_OVP_COMP_SETTLING_Msk (0x3ffUL) /*!< VBAT_OVP_COMP_SETTLING (Bitfield-Mask: 0x3ff) */


/* =========================================================================================================================== */
/* ================                                          CHG_DET                                          ================ */
/* =========================================================================================================================== */

/* =================================================  CHG_DET_ADC_CTRL_REG  ================================================== */
#define CHG_DET_CHG_DET_ADC_CTRL_REG_USB_DM_TO_ADC_EN_Pos (1UL)     /*!< USB_DM_TO_ADC_EN (Bit 1)                              */
#define CHG_DET_CHG_DET_ADC_CTRL_REG_USB_DM_TO_ADC_EN_Msk (0x2UL)   /*!< USB_DM_TO_ADC_EN (Bitfield-Mask: 0x01)                */
#define CHG_DET_CHG_DET_ADC_CTRL_REG_USB_DP_TO_ADC_EN_Pos (0UL)     /*!< USB_DP_TO_ADC_EN (Bit 0)                              */
#define CHG_DET_CHG_DET_ADC_CTRL_REG_USB_DP_TO_ADC_EN_Msk (0x1UL)   /*!< USB_DP_TO_ADC_EN (Bitfield-Mask: 0x01)                */
/* =================================================  CHG_DET_DCD_TIMER_REG  ================================================= */
#define CHG_DET_CHG_DET_DCD_TIMER_REG_DCD_TIMER_Pos (16UL)          /*!< DCD_TIMER (Bit 16)                                    */
#define CHG_DET_CHG_DET_DCD_TIMER_REG_DCD_TIMER_Msk (0x3ff0000UL)   /*!< DCD_TIMER (Bitfield-Mask: 0x3ff)                      */
#define CHG_DET_CHG_DET_DCD_TIMER_REG_DCD_TIMEOUT_THRES_Pos (0UL)   /*!< DCD_TIMEOUT_THRES (Bit 0)                             */
#define CHG_DET_CHG_DET_DCD_TIMER_REG_DCD_TIMEOUT_THRES_Msk (0x3ffUL) /*!< DCD_TIMEOUT_THRES (Bitfield-Mask: 0x3ff)            */
/* =================================================  CHG_DET_FSM_CTRL_REG  ================================================== */
#define CHG_DET_CHG_DET_FSM_CTRL_REG_CHG_DET_EN_Pos (0UL)           /*!< CHG_DET_EN (Bit 0)                                    */
#define CHG_DET_CHG_DET_FSM_CTRL_REG_CHG_DET_EN_Msk (0x1UL)         /*!< CHG_DET_EN (Bitfield-Mask: 0x01)                      */
/* ================================================  CHG_DET_FSM_STATUS_REG  ================================================= */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_CHG_DET_STATE_Pos (9UL)      /*!< CHG_DET_STATE (Bit 9)                                 */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_CHG_DET_STATE_Msk (0x1e00UL) /*!< CHG_DET_STATE (Bitfield-Mask: 0x0f)                   */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_NO_CONTACT_DETECTED_Pos (8UL) /*!< NO_CONTACT_DETECTED (Bit 8)                          */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_NO_CONTACT_DETECTED_Msk (0x100UL) /*!< NO_CONTACT_DETECTED (Bitfield-Mask: 0x01)        */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PORT_2P4AMP_DETECTED_Pos (7UL) /*!< PORT_2P4AMP_DETECTED (Bit 7)                        */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PORT_2P4AMP_DETECTED_Msk (0x80UL) /*!< PORT_2P4AMP_DETECTED (Bitfield-Mask: 0x01)       */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PORT_2AMP_DETECTED_Pos (6UL) /*!< PORT_2AMP_DETECTED (Bit 6)                            */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PORT_2AMP_DETECTED_Msk (0x40UL) /*!< PORT_2AMP_DETECTED (Bitfield-Mask: 0x01)           */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PORT_1AMP_DETECTED_Pos (5UL) /*!< PORT_1AMP_DETECTED (Bit 5)                            */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PORT_1AMP_DETECTED_Msk (0x20UL) /*!< PORT_1AMP_DETECTED (Bitfield-Mask: 0x01)           */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PS2_PROP_PORT_DETECTED_Pos (4UL) /*!< PS2_PROP_PORT_DETECTED (Bit 4)                    */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_PS2_PROP_PORT_DETECTED_Msk (0x10UL) /*!< PS2_PROP_PORT_DETECTED (Bitfield-Mask: 0x01)   */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_DCP_PORT_DETECTED_Pos (3UL)  /*!< DCP_PORT_DETECTED (Bit 3)                             */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_DCP_PORT_DETECTED_Msk (0x8UL) /*!< DCP_PORT_DETECTED (Bitfield-Mask: 0x01)              */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_CDP_PORT_DETECTED_Pos (2UL)  /*!< CDP_PORT_DETECTED (Bit 2)                             */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_CDP_PORT_DETECTED_Msk (0x4UL) /*!< CDP_PORT_DETECTED (Bitfield-Mask: 0x01)              */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_SDP_PORT_DETECTED_Pos (1UL)  /*!< SDP_PORT_DETECTED (Bit 1)                             */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_SDP_PORT_DETECTED_Msk (0x2UL) /*!< SDP_PORT_DETECTED (Bitfield-Mask: 0x01)              */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_DETECTION_COMPLETED_Pos (0UL) /*!< DETECTION_COMPLETED (Bit 0)                          */
#define CHG_DET_CHG_DET_FSM_STATUS_REG_DETECTION_COMPLETED_Msk (0x1UL) /*!< DETECTION_COMPLETED (Bitfield-Mask: 0x01)          */
/* =================================================  CHG_DET_IRQ_CLEAR_REG  ================================================= */
#define CHG_DET_CHG_DET_IRQ_CLEAR_REG_CHG_DET_IRQ_CLR_Pos (0UL)     /*!< CHG_DET_IRQ_CLR (Bit 0)                               */
#define CHG_DET_CHG_DET_IRQ_CLEAR_REG_CHG_DET_IRQ_CLR_Msk (0x1UL)   /*!< CHG_DET_IRQ_CLR (Bitfield-Mask: 0x01)                 */
/* =================================================  CHG_DET_IRQ_MASK_REG  ================================================== */
#define CHG_DET_CHG_DET_IRQ_MASK_REG_CHG_DET_IRQ_EN_Pos (0UL)       /*!< CHG_DET_IRQ_EN (Bit 0)                                */
#define CHG_DET_CHG_DET_IRQ_MASK_REG_CHG_DET_IRQ_EN_Msk (0x1UL)     /*!< CHG_DET_IRQ_EN (Bitfield-Mask: 0x01)                  */
/* ================================================  CHG_DET_IRQ_STATUS_REG  ================================================= */
#define CHG_DET_CHG_DET_IRQ_STATUS_REG_CHG_DET_IRQ_Pos (0UL)        /*!< CHG_DET_IRQ (Bit 0)                                   */
#define CHG_DET_CHG_DET_IRQ_STATUS_REG_CHG_DET_IRQ_Msk (0x1UL)      /*!< CHG_DET_IRQ (Bitfield-Mask: 0x01)                     */
/* ==================================================  CHG_DET_STATUS_REG  =================================================== */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DM_VAL2_Pos (5UL)            /*!< USB_DM_VAL2 (Bit 5)                                   */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DM_VAL2_Msk (0x20UL)         /*!< USB_DM_VAL2 (Bitfield-Mask: 0x01)                     */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DP_VAL2_Pos (4UL)            /*!< USB_DP_VAL2 (Bit 4)                                   */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DP_VAL2_Msk (0x10UL)         /*!< USB_DP_VAL2 (Bitfield-Mask: 0x01)                     */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DM_VAL_Pos (3UL)             /*!< USB_DM_VAL (Bit 3)                                    */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DM_VAL_Msk (0x8UL)           /*!< USB_DM_VAL (Bitfield-Mask: 0x01)                      */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DP_VAL_Pos (2UL)             /*!< USB_DP_VAL (Bit 2)                                    */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DP_VAL_Msk (0x4UL)           /*!< USB_DP_VAL (Bitfield-Mask: 0x01)                      */
#define CHG_DET_CHG_DET_STATUS_REG_USB_CHG_DET_Pos (1UL)            /*!< USB_CHG_DET (Bit 1)                                   */
#define CHG_DET_CHG_DET_STATUS_REG_USB_CHG_DET_Msk (0x2UL)          /*!< USB_CHG_DET (Bitfield-Mask: 0x01)                     */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DCP_DET_Pos (0UL)            /*!< USB_DCP_DET (Bit 0)                                   */
#define CHG_DET_CHG_DET_STATUS_REG_USB_DCP_DET_Msk (0x1UL)          /*!< USB_DCP_DET (Bitfield-Mask: 0x01)                     */
/* ==================================================  CHG_DET_SW_CTRL_REG  ================================================== */
#define CHG_DET_CHG_DET_SW_CTRL_REG_IDM_SINK_ON_Pos (5UL)           /*!< IDM_SINK_ON (Bit 5)                                   */
#define CHG_DET_CHG_DET_SW_CTRL_REG_IDM_SINK_ON_Msk (0x20UL)        /*!< IDM_SINK_ON (Bitfield-Mask: 0x01)                     */
#define CHG_DET_CHG_DET_SW_CTRL_REG_IDP_SINK_ON_Pos (4UL)           /*!< IDP_SINK_ON (Bit 4)                                   */
#define CHG_DET_CHG_DET_SW_CTRL_REG_IDP_SINK_ON_Msk (0x10UL)        /*!< IDP_SINK_ON (Bitfield-Mask: 0x01)                     */
#define CHG_DET_CHG_DET_SW_CTRL_REG_VDM_SRC_ON_Pos (3UL)            /*!< VDM_SRC_ON (Bit 3)                                    */
#define CHG_DET_CHG_DET_SW_CTRL_REG_VDM_SRC_ON_Msk (0x8UL)          /*!< VDM_SRC_ON (Bitfield-Mask: 0x01)                      */
#define CHG_DET_CHG_DET_SW_CTRL_REG_VDP_SRC_ON_Pos (2UL)            /*!< VDP_SRC_ON (Bit 2)                                    */
#define CHG_DET_CHG_DET_SW_CTRL_REG_VDP_SRC_ON_Msk (0x4UL)          /*!< VDP_SRC_ON (Bitfield-Mask: 0x01)                      */
#define CHG_DET_CHG_DET_SW_CTRL_REG_IDP_SRC_ON_Pos (1UL)            /*!< IDP_SRC_ON (Bit 1)                                    */
#define CHG_DET_CHG_DET_SW_CTRL_REG_IDP_SRC_ON_Msk (0x2UL)          /*!< IDP_SRC_ON (Bitfield-Mask: 0x01)                      */
#define CHG_DET_CHG_DET_SW_CTRL_REG_USB_CHARGE_ON_Pos (0UL)         /*!< USB_CHARGE_ON (Bit 0)                                 */
#define CHG_DET_CHG_DET_SW_CTRL_REG_USB_CHARGE_ON_Msk (0x1UL)       /*!< USB_CHARGE_ON (Bitfield-Mask: 0x01)                   */
/* ===================================================  CHG_DET_TIMER_REG  =================================================== */
#define CHG_DET_CHG_DET_TIMER_REG_CHG_DET_TIMER_Pos (16UL)          /*!< CHG_DET_TIMER (Bit 16)                                */
#define CHG_DET_CHG_DET_TIMER_REG_CHG_DET_TIMER_Msk (0xff0000UL)    /*!< CHG_DET_TIMER (Bitfield-Mask: 0xff)                   */
#define CHG_DET_CHG_DET_TIMER_REG_CHG_DET_TIMER_THRES_Pos (0UL)     /*!< CHG_DET_TIMER_THRES (Bit 0)                           */
#define CHG_DET_CHG_DET_TIMER_REG_CHG_DET_TIMER_THRES_Msk (0xffUL)  /*!< CHG_DET_TIMER_THRES (Bitfield-Mask: 0xff)             */


/* =========================================================================================================================== */
/* ================                                       CHIP_VERSION                                        ================ */
/* =========================================================================================================================== */

/* =====================================================  CHIP_ID1_REG  ====================================================== */
#define CHIP_VERSION_CHIP_ID1_REG_CHIP_ID1_Pos (0UL)                /*!< CHIP_ID1 (Bit 0)                                      */
#define CHIP_VERSION_CHIP_ID1_REG_CHIP_ID1_Msk (0xffUL)             /*!< CHIP_ID1 (Bitfield-Mask: 0xff)                        */
/* =====================================================  CHIP_ID2_REG  ====================================================== */
#define CHIP_VERSION_CHIP_ID2_REG_CHIP_ID2_Pos (0UL)                /*!< CHIP_ID2 (Bit 0)                                      */
#define CHIP_VERSION_CHIP_ID2_REG_CHIP_ID2_Msk (0xffUL)             /*!< CHIP_ID2 (Bitfield-Mask: 0xff)                        */
/* =====================================================  CHIP_ID3_REG  ====================================================== */
#define CHIP_VERSION_CHIP_ID3_REG_CHIP_ID3_Pos (0UL)                /*!< CHIP_ID3 (Bit 0)                                      */
#define CHIP_VERSION_CHIP_ID3_REG_CHIP_ID3_Msk (0xffUL)             /*!< CHIP_ID3 (Bitfield-Mask: 0xff)                        */
/* =====================================================  CHIP_ID4_REG  ====================================================== */
#define CHIP_VERSION_CHIP_ID4_REG_CHIP_ID4_Pos (0UL)                /*!< CHIP_ID4 (Bit 0)                                      */
#define CHIP_VERSION_CHIP_ID4_REG_CHIP_ID4_Msk (0xffUL)             /*!< CHIP_ID4 (Bitfield-Mask: 0xff)                        */
/* ===================================================  CHIP_REVISION_REG  =================================================== */
#define CHIP_VERSION_CHIP_REVISION_REG_CHIP_REVISION_Pos (0UL)      /*!< CHIP_REVISION (Bit 0)                                 */
#define CHIP_VERSION_CHIP_REVISION_REG_CHIP_REVISION_Msk (0xffUL)   /*!< CHIP_REVISION (Bitfield-Mask: 0xff)                   */
/* =====================================================  CHIP_SWC_REG  ====================================================== */
#define CHIP_VERSION_CHIP_SWC_REG_CHIP_SWC_Pos (0UL)                /*!< CHIP_SWC (Bit 0)                                      */
#define CHIP_VERSION_CHIP_SWC_REG_CHIP_SWC_Msk (0xfUL)              /*!< CHIP_SWC (Bitfield-Mask: 0x0f)                        */
/* ====================================================  CHIP_TEST1_REG  ===================================================== */
#define CHIP_VERSION_CHIP_TEST1_REG_CHIP_LAYOUT_REVISION_Pos (0UL)  /*!< CHIP_LAYOUT_REVISION (Bit 0)                          */
#define CHIP_VERSION_CHIP_TEST1_REG_CHIP_LAYOUT_REVISION_Msk (0xffUL) /*!< CHIP_LAYOUT_REVISION (Bitfield-Mask: 0xff)          */
/* ====================================================  CHIP_TEST2_REG  ===================================================== */
#define CHIP_VERSION_CHIP_TEST2_REG_CHIP_METAL_OPTION_Pos (0UL)     /*!< CHIP_METAL_OPTION (Bit 0)                             */
#define CHIP_VERSION_CHIP_TEST2_REG_CHIP_METAL_OPTION_Msk (0xfUL)   /*!< CHIP_METAL_OPTION (Bitfield-Mask: 0x0f)               */


/* =========================================================================================================================== */
/* ================                                          CRG_AUD                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  PCM_DIV_REG  ====================================================== */
#define CRG_AUD_PCM_DIV_REG_PCM_SRC_SEL_Pos (13UL)                  /*!< PCM_SRC_SEL (Bit 13)                                  */
#define CRG_AUD_PCM_DIV_REG_PCM_SRC_SEL_Msk (0x2000UL)              /*!< PCM_SRC_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_AUD_PCM_DIV_REG_CLK_PCM_EN_Pos (12UL)                   /*!< CLK_PCM_EN (Bit 12)                                   */
#define CRG_AUD_PCM_DIV_REG_CLK_PCM_EN_Msk (0x1000UL)               /*!< CLK_PCM_EN (Bitfield-Mask: 0x01)                      */
#define CRG_AUD_PCM_DIV_REG_PCM_DIV_Pos   (0UL)                     /*!< PCM_DIV (Bit 0)                                       */
#define CRG_AUD_PCM_DIV_REG_PCM_DIV_Msk   (0xfffUL)                 /*!< PCM_DIV (Bitfield-Mask: 0xfff)                        */
/* =====================================================  PCM_FDIV_REG  ====================================================== */
#define CRG_AUD_PCM_FDIV_REG_PCM_FDIV_Pos (0UL)                     /*!< PCM_FDIV (Bit 0)                                      */
#define CRG_AUD_PCM_FDIV_REG_PCM_FDIV_Msk (0xffffUL)                /*!< PCM_FDIV (Bitfield-Mask: 0xffff)                      */
/* ======================================================  PDM_DIV_REG  ====================================================== */
#define CRG_AUD_PDM_DIV_REG_PDM_MASTER_MODE_Pos (9UL)               /*!< PDM_MASTER_MODE (Bit 9)                               */
#define CRG_AUD_PDM_DIV_REG_PDM_MASTER_MODE_Msk (0x200UL)           /*!< PDM_MASTER_MODE (Bitfield-Mask: 0x01)                 */
#define CRG_AUD_PDM_DIV_REG_CLK_PDM_EN_Pos (8UL)                    /*!< CLK_PDM_EN (Bit 8)                                    */
#define CRG_AUD_PDM_DIV_REG_CLK_PDM_EN_Msk (0x100UL)                /*!< CLK_PDM_EN (Bitfield-Mask: 0x01)                      */
#define CRG_AUD_PDM_DIV_REG_PDM_DIV_Pos   (0UL)                     /*!< PDM_DIV (Bit 0)                                       */
#define CRG_AUD_PDM_DIV_REG_PDM_DIV_Msk   (0xffUL)                  /*!< PDM_DIV (Bitfield-Mask: 0xff)                         */
/* ======================================================  SRC_DIV_REG  ====================================================== */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC2_EN_Pos (17UL)                  /*!< CLK_SRC2_EN (Bit 17)                                  */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC2_EN_Msk (0x20000UL)             /*!< CLK_SRC2_EN (Bitfield-Mask: 0x01)                     */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC_EN_Pos (16UL)                   /*!< CLK_SRC_EN (Bit 16)                                   */
#define CRG_AUD_SRC_DIV_REG_CLK_SRC_EN_Msk (0x10000UL)              /*!< CLK_SRC_EN (Bitfield-Mask: 0x01)                      */
#define CRG_AUD_SRC_DIV_REG_SRC2_DIV_Pos  (8UL)                     /*!< SRC2_DIV (Bit 8)                                      */
#define CRG_AUD_SRC_DIV_REG_SRC2_DIV_Msk  (0xff00UL)                /*!< SRC2_DIV (Bitfield-Mask: 0xff)                        */
#define CRG_AUD_SRC_DIV_REG_SRC_DIV_Pos   (0UL)                     /*!< SRC_DIV (Bit 0)                                       */
#define CRG_AUD_SRC_DIV_REG_SRC_DIV_Msk   (0xffUL)                  /*!< SRC_DIV (Bitfield-Mask: 0xff)                         */


/* =========================================================================================================================== */
/* ================                                         CRG_CTRL                                          ================ */
/* =========================================================================================================================== */

/* ====================================================  CLK_PDCTRL_REG  ===================================================== */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_INV_TX_CLK_Pos (13UL)          /*!< EMMC_INV_TX_CLK (Bit 13)                              */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_INV_TX_CLK_Msk (0x2000UL)      /*!< EMMC_INV_TX_CLK (Bitfield-Mask: 0x01)                 */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_INV_RX_CLK_Pos (12UL)          /*!< EMMC_INV_RX_CLK (Bit 12)                              */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_INV_RX_CLK_Msk (0x1000UL)      /*!< EMMC_INV_RX_CLK (Bitfield-Mask: 0x01)                 */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_ENABLE_Pos (11UL)              /*!< EMMC_ENABLE (Bit 11)                                  */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_ENABLE_Msk (0x800UL)           /*!< EMMC_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_CLK_DIV_Pos (7UL)              /*!< EMMC_CLK_DIV (Bit 7)                                  */
#define CRG_CTRL_CLK_PDCTRL_REG_EMMC_CLK_DIV_Msk (0x780UL)          /*!< EMMC_CLK_DIV (Bitfield-Mask: 0x0f)                    */


/* =========================================================================================================================== */
/* ================                                          CRG_GPU                                          ================ */
/* =========================================================================================================================== */

/* ======================================================  CLK_GPU_REG  ====================================================== */
#define CRG_GPU_CLK_GPU_REG_GPU_ENABLE_Pos (0UL)                    /*!< GPU_ENABLE (Bit 0)                                    */
#define CRG_GPU_CLK_GPU_REG_GPU_ENABLE_Msk (0x1UL)                  /*!< GPU_ENABLE (Bitfield-Mask: 0x01)                      */


/* =========================================================================================================================== */
/* ================                                          CRG_SNC                                          ================ */
/* =========================================================================================================================== */

