antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ======================================================  CLK_SNC_REG  ====================================================== */
#define CRG_SNC_CLK_SNC_REG_I3C_CLK_SEL_Pos (17UL)                  /*!< I3C_CLK_SEL (Bit 17)                                  */
#define CRG_SNC_CLK_SNC_REG_I3C_CLK_SEL_Msk (0x20000UL)             /*!< I3C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_CLK_SNC_REG_I3C_ENABLE_Pos (16UL)                   /*!< I3C_ENABLE (Bit 16)                                   */
#define CRG_SNC_CLK_SNC_REG_I3C_ENABLE_Msk (0x10000UL)              /*!< I3C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_CLK_SNC_REG_I2C3_CLK_SEL_Pos (15UL)                 /*!< I2C3_CLK_SEL (Bit 15)                                 */
#define CRG_SNC_CLK_SNC_REG_I2C3_CLK_SEL_Msk (0x8000UL)             /*!< I2C3_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_CLK_SNC_REG_I2C3_ENABLE_Pos (14UL)                  /*!< I2C3_ENABLE (Bit 14)                                  */
#define CRG_SNC_CLK_SNC_REG_I2C3_ENABLE_Msk (0x4000UL)              /*!< I2C3_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_CLK_SNC_REG_I2C2_CLK_SEL_Pos (13UL)                 /*!< I2C2_CLK_SEL (Bit 13)                                 */
#define CRG_SNC_CLK_SNC_REG_I2C2_CLK_SEL_Msk (0x2000UL)             /*!< I2C2_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_CLK_SNC_REG_I2C2_ENABLE_Pos (12UL)                  /*!< I2C2_ENABLE (Bit 12)                                  */
#define CRG_SNC_CLK_SNC_REG_I2C2_ENABLE_Msk (0x1000UL)              /*!< I2C2_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_CLK_SNC_REG_I2C_CLK_SEL_Pos (11UL)                  /*!< I2C_CLK_SEL (Bit 11)                                  */
#define CRG_SNC_CLK_SNC_REG_I2C_CLK_SEL_Msk (0x800UL)               /*!< I2C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_CLK_SNC_REG_I2C_ENABLE_Pos (10UL)                   /*!< I2C_ENABLE (Bit 10)                                   */
#define CRG_SNC_CLK_SNC_REG_I2C_ENABLE_Msk (0x400UL)                /*!< I2C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_CLK_SNC_REG_SPI2_CLK_SEL_Pos (9UL)                  /*!< SPI2_CLK_SEL (Bit 9)                                  */
#define CRG_SNC_CLK_SNC_REG_SPI2_CLK_SEL_Msk (0x200UL)              /*!< SPI2_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_CLK_SNC_REG_SPI2_ENABLE_Pos (8UL)                   /*!< SPI2_ENABLE (Bit 8)                                   */
#define CRG_SNC_CLK_SNC_REG_SPI2_ENABLE_Msk (0x100UL)               /*!< SPI2_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_CLK_SNC_REG_SPI_CLK_SEL_Pos (7UL)                   /*!< SPI_CLK_SEL (Bit 7)                                   */
#define CRG_SNC_CLK_SNC_REG_SPI_CLK_SEL_Msk (0x80UL)                /*!< SPI_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_CLK_SNC_REG_SPI_ENABLE_Pos (6UL)                    /*!< SPI_ENABLE (Bit 6)                                    */
#define CRG_SNC_CLK_SNC_REG_SPI_ENABLE_Msk (0x40UL)                 /*!< SPI_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_CLK_SNC_REG_UART3_CLK_SEL_Pos (5UL)                 /*!< UART3_CLK_SEL (Bit 5)                                 */
#define CRG_SNC_CLK_SNC_REG_UART3_CLK_SEL_Msk (0x20UL)              /*!< UART3_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_SNC_CLK_SNC_REG_UART3_ENABLE_Pos (4UL)                  /*!< UART3_ENABLE (Bit 4)                                  */
#define CRG_SNC_CLK_SNC_REG_UART3_ENABLE_Msk (0x10UL)               /*!< UART3_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_CLK_SNC_REG_UART2_CLK_SEL_Pos (3UL)                 /*!< UART2_CLK_SEL (Bit 3)                                 */
#define CRG_SNC_CLK_SNC_REG_UART2_CLK_SEL_Msk (0x8UL)               /*!< UART2_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_SNC_CLK_SNC_REG_UART2_ENABLE_Pos (2UL)                  /*!< UART2_ENABLE (Bit 2)                                  */
#define CRG_SNC_CLK_SNC_REG_UART2_ENABLE_Msk (0x4UL)                /*!< UART2_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_CLK_SNC_REG_UART_CLK_SEL_Pos (1UL)                  /*!< UART_CLK_SEL (Bit 1)                                  */
#define CRG_SNC_CLK_SNC_REG_UART_CLK_SEL_Msk (0x2UL)                /*!< UART_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_CLK_SNC_REG_UART_ENABLE_Pos (0UL)                   /*!< UART_ENABLE (Bit 0)                                   */
#define CRG_SNC_CLK_SNC_REG_UART_ENABLE_Msk (0x1UL)                 /*!< UART_ENABLE (Bitfield-Mask: 0x01)                     */
/* ===================================================  RESET_CLK_SNC_REG  =================================================== */
#define CRG_SNC_RESET_CLK_SNC_REG_I3C_CLK_SEL_Pos (17UL)            /*!< I3C_CLK_SEL (Bit 17)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_I3C_CLK_SEL_Msk (0x20000UL)       /*!< I3C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_RESET_CLK_SNC_REG_I3C_ENABLE_Pos (16UL)             /*!< I3C_ENABLE (Bit 16)                                   */
#define CRG_SNC_RESET_CLK_SNC_REG_I3C_ENABLE_Msk (0x10000UL)        /*!< I3C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C3_CLK_SEL_Pos (15UL)           /*!< I2C3_CLK_SEL (Bit 15)                                 */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C3_CLK_SEL_Msk (0x8000UL)       /*!< I2C3_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C3_ENABLE_Pos (14UL)            /*!< I2C3_ENABLE (Bit 14)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C3_ENABLE_Msk (0x4000UL)        /*!< I2C3_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C2_CLK_SEL_Pos (13UL)           /*!< I2C2_CLK_SEL (Bit 13)                                 */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C2_CLK_SEL_Msk (0x2000UL)       /*!< I2C2_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C2_ENABLE_Pos (12UL)            /*!< I2C2_ENABLE (Bit 12)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C2_ENABLE_Msk (0x1000UL)        /*!< I2C2_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C_CLK_SEL_Pos (11UL)            /*!< I2C_CLK_SEL (Bit 11)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C_CLK_SEL_Msk (0x800UL)         /*!< I2C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C_ENABLE_Pos (10UL)             /*!< I2C_ENABLE (Bit 10)                                   */
#define CRG_SNC_RESET_CLK_SNC_REG_I2C_ENABLE_Msk (0x400UL)          /*!< I2C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI2_CLK_SEL_Pos (9UL)            /*!< SPI2_CLK_SEL (Bit 9)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI2_CLK_SEL_Msk (0x200UL)        /*!< SPI2_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI2_ENABLE_Pos (8UL)             /*!< SPI2_ENABLE (Bit 8)                                   */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI2_ENABLE_Msk (0x100UL)         /*!< SPI2_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI_CLK_SEL_Pos (7UL)             /*!< SPI_CLK_SEL (Bit 7)                                   */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI_CLK_SEL_Msk (0x80UL)          /*!< SPI_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI_ENABLE_Pos (6UL)              /*!< SPI_ENABLE (Bit 6)                                    */
#define CRG_SNC_RESET_CLK_SNC_REG_SPI_ENABLE_Msk (0x40UL)           /*!< SPI_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_RESET_CLK_SNC_REG_UART3_CLK_SEL_Pos (5UL)           /*!< UART3_CLK_SEL (Bit 5)                                 */
#define CRG_SNC_RESET_CLK_SNC_REG_UART3_CLK_SEL_Msk (0x20UL)        /*!< UART3_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_SNC_RESET_CLK_SNC_REG_UART3_ENABLE_Pos (4UL)            /*!< UART3_ENABLE (Bit 4)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_UART3_ENABLE_Msk (0x10UL)         /*!< UART3_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_RESET_CLK_SNC_REG_UART2_CLK_SEL_Pos (3UL)           /*!< UART2_CLK_SEL (Bit 3)                                 */
#define CRG_SNC_RESET_CLK_SNC_REG_UART2_CLK_SEL_Msk (0x8UL)         /*!< UART2_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_SNC_RESET_CLK_SNC_REG_UART2_ENABLE_Pos (2UL)            /*!< UART2_ENABLE (Bit 2)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_UART2_ENABLE_Msk (0x4UL)          /*!< UART2_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_RESET_CLK_SNC_REG_UART_CLK_SEL_Pos (1UL)            /*!< UART_CLK_SEL (Bit 1)                                  */
#define CRG_SNC_RESET_CLK_SNC_REG_UART_CLK_SEL_Msk (0x2UL)          /*!< UART_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_RESET_CLK_SNC_REG_UART_ENABLE_Pos (0UL)             /*!< UART_ENABLE (Bit 0)                                   */
#define CRG_SNC_RESET_CLK_SNC_REG_UART_ENABLE_Msk (0x1UL)           /*!< UART_ENABLE (Bitfield-Mask: 0x01)                     */
/* ====================================================  SET_CLK_SNC_REG  ==================================================== */
#define CRG_SNC_SET_CLK_SNC_REG_I3C_CLK_SEL_Pos (17UL)              /*!< I3C_CLK_SEL (Bit 17)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_I3C_CLK_SEL_Msk (0x20000UL)         /*!< I3C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_SET_CLK_SNC_REG_I3C_ENABLE_Pos (16UL)               /*!< I3C_ENABLE (Bit 16)                                   */
#define CRG_SNC_SET_CLK_SNC_REG_I3C_ENABLE_Msk (0x10000UL)          /*!< I3C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_SET_CLK_SNC_REG_I2C3_CLK_SEL_Pos (15UL)             /*!< I2C3_CLK_SEL (Bit 15)                                 */
#define CRG_SNC_SET_CLK_SNC_REG_I2C3_CLK_SEL_Msk (0x8000UL)         /*!< I2C3_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_SET_CLK_SNC_REG_I2C3_ENABLE_Pos (14UL)              /*!< I2C3_ENABLE (Bit 14)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_I2C3_ENABLE_Msk (0x4000UL)          /*!< I2C3_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_SET_CLK_SNC_REG_I2C2_CLK_SEL_Pos (13UL)             /*!< I2C2_CLK_SEL (Bit 13)                                 */
#define CRG_SNC_SET_CLK_SNC_REG_I2C2_CLK_SEL_Msk (0x2000UL)         /*!< I2C2_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_SET_CLK_SNC_REG_I2C2_ENABLE_Pos (12UL)              /*!< I2C2_ENABLE (Bit 12)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_I2C2_ENABLE_Msk (0x1000UL)          /*!< I2C2_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_SET_CLK_SNC_REG_I2C_CLK_SEL_Pos (11UL)              /*!< I2C_CLK_SEL (Bit 11)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_I2C_CLK_SEL_Msk (0x800UL)           /*!< I2C_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_SET_CLK_SNC_REG_I2C_ENABLE_Pos (10UL)               /*!< I2C_ENABLE (Bit 10)                                   */
#define CRG_SNC_SET_CLK_SNC_REG_I2C_ENABLE_Msk (0x400UL)            /*!< I2C_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_SET_CLK_SNC_REG_SPI2_CLK_SEL_Pos (9UL)              /*!< SPI2_CLK_SEL (Bit 9)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_SPI2_CLK_SEL_Msk (0x200UL)          /*!< SPI2_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_SET_CLK_SNC_REG_SPI2_ENABLE_Pos (8UL)               /*!< SPI2_ENABLE (Bit 8)                                   */
#define CRG_SNC_SET_CLK_SNC_REG_SPI2_ENABLE_Msk (0x100UL)           /*!< SPI2_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_SET_CLK_SNC_REG_SPI_CLK_SEL_Pos (7UL)               /*!< SPI_CLK_SEL (Bit 7)                                   */
#define CRG_SNC_SET_CLK_SNC_REG_SPI_CLK_SEL_Msk (0x80UL)            /*!< SPI_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SNC_SET_CLK_SNC_REG_SPI_ENABLE_Pos (6UL)                /*!< SPI_ENABLE (Bit 6)                                    */
#define CRG_SNC_SET_CLK_SNC_REG_SPI_ENABLE_Msk (0x40UL)             /*!< SPI_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_SNC_SET_CLK_SNC_REG_UART3_CLK_SEL_Pos (5UL)             /*!< UART3_CLK_SEL (Bit 5)                                 */
#define CRG_SNC_SET_CLK_SNC_REG_UART3_CLK_SEL_Msk (0x20UL)          /*!< UART3_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_SNC_SET_CLK_SNC_REG_UART3_ENABLE_Pos (4UL)              /*!< UART3_ENABLE (Bit 4)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_UART3_ENABLE_Msk (0x10UL)           /*!< UART3_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_SET_CLK_SNC_REG_UART2_CLK_SEL_Pos (3UL)             /*!< UART2_CLK_SEL (Bit 3)                                 */
#define CRG_SNC_SET_CLK_SNC_REG_UART2_CLK_SEL_Msk (0x8UL)           /*!< UART2_CLK_SEL (Bitfield-Mask: 0x01)                   */
#define CRG_SNC_SET_CLK_SNC_REG_UART2_ENABLE_Pos (2UL)              /*!< UART2_ENABLE (Bit 2)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_UART2_ENABLE_Msk (0x4UL)            /*!< UART2_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_SET_CLK_SNC_REG_UART_CLK_SEL_Pos (1UL)              /*!< UART_CLK_SEL (Bit 1)                                  */
#define CRG_SNC_SET_CLK_SNC_REG_UART_CLK_SEL_Msk (0x2UL)            /*!< UART_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SNC_SET_CLK_SNC_REG_UART_ENABLE_Pos (0UL)               /*!< UART_ENABLE (Bit 0)                                   */
#define CRG_SNC_SET_CLK_SNC_REG_UART_ENABLE_Msk (0x1UL)             /*!< UART_ENABLE (Bitfield-Mask: 0x01)                     */


/* =========================================================================================================================== */
/* ================                                          CRG_SYS                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  BATCHECK_REG  ====================================================== */
#define CRG_SYS_BATCHECK_REG_BATCHECK_LOAD_ENABLE_Pos (7UL)         /*!< BATCHECK_LOAD_ENABLE (Bit 7)                          */
#define CRG_SYS_BATCHECK_REG_BATCHECK_LOAD_ENABLE_Msk (0x80UL)      /*!< BATCHECK_LOAD_ENABLE (Bitfield-Mask: 0x01)            */
#define CRG_SYS_BATCHECK_REG_BATCHECK_ILOAD_Pos (4UL)               /*!< BATCHECK_ILOAD (Bit 4)                                */
#define CRG_SYS_BATCHECK_REG_BATCHECK_ILOAD_Msk (0x70UL)            /*!< BATCHECK_ILOAD (Bitfield-Mask: 0x07)                  */
#define CRG_SYS_BATCHECK_REG_BATCHECK_TRIM_Pos (0UL)                /*!< BATCHECK_TRIM (Bit 0)                                 */
#define CRG_SYS_BATCHECK_REG_BATCHECK_TRIM_Msk (0xfUL)              /*!< BATCHECK_TRIM (Bitfield-Mask: 0x0f)                   */
/* ======================================================  CLK_SYS_REG  ====================================================== */
#define CRG_SYS_CLK_SYS_REG_SPI3_CLK_SEL_Pos (7UL)                  /*!< SPI3_CLK_SEL (Bit 7)                                  */
#define CRG_SYS_CLK_SYS_REG_SPI3_CLK_SEL_Msk (0x80UL)               /*!< SPI3_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SYS_CLK_SYS_REG_SPI3_ENABLE_Pos (6UL)                   /*!< SPI3_ENABLE (Bit 6)                                   */
#define CRG_SYS_CLK_SYS_REG_SPI3_ENABLE_Msk (0x40UL)                /*!< SPI3_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SYS_CLK_SYS_REG_CLK_CHG_EN_Pos (5UL)                    /*!< CLK_CHG_EN (Bit 5)                                    */
#define CRG_SYS_CLK_SYS_REG_CLK_CHG_EN_Msk (0x20UL)                 /*!< CLK_CHG_EN (Bitfield-Mask: 0x01)                      */
#define CRG_SYS_CLK_SYS_REG_LCD_RESET_REQ_Pos (4UL)                 /*!< LCD_RESET_REQ (Bit 4)                                 */
#define CRG_SYS_CLK_SYS_REG_LCD_RESET_REQ_Msk (0x10UL)              /*!< LCD_RESET_REQ (Bitfield-Mask: 0x01)                   */
#define CRG_SYS_CLK_SYS_REG_LCD_CLK_SEL_Pos (1UL)                   /*!< LCD_CLK_SEL (Bit 1)                                   */
#define CRG_SYS_CLK_SYS_REG_LCD_CLK_SEL_Msk (0x2UL)                 /*!< LCD_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SYS_CLK_SYS_REG_LCD_ENABLE_Pos (0UL)                    /*!< LCD_ENABLE (Bit 0)                                    */
#define CRG_SYS_CLK_SYS_REG_LCD_ENABLE_Msk (0x1UL)                  /*!< LCD_ENABLE (Bitfield-Mask: 0x01)                      */
/* ===================================================  RESET_CLK_SYS_REG  =================================================== */
#define CRG_SYS_RESET_CLK_SYS_REG_SPI3_CLK_SEL_Pos (7UL)            /*!< SPI3_CLK_SEL (Bit 7)                                  */
#define CRG_SYS_RESET_CLK_SYS_REG_SPI3_CLK_SEL_Msk (0x80UL)         /*!< SPI3_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SYS_RESET_CLK_SYS_REG_SPI3_ENABLE_Pos (6UL)             /*!< SPI3_ENABLE (Bit 6)                                   */
#define CRG_SYS_RESET_CLK_SYS_REG_SPI3_ENABLE_Msk (0x40UL)          /*!< SPI3_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SYS_RESET_CLK_SYS_REG_CLK_CHG_EN_Pos (5UL)              /*!< CLK_CHG_EN (Bit 5)                                    */
#define CRG_SYS_RESET_CLK_SYS_REG_CLK_CHG_EN_Msk (0x20UL)           /*!< CLK_CHG_EN (Bitfield-Mask: 0x01)                      */
#define CRG_SYS_RESET_CLK_SYS_REG_LCD_RESET_REQ_Pos (4UL)           /*!< LCD_RESET_REQ (Bit 4)                                 */
#define CRG_SYS_RESET_CLK_SYS_REG_LCD_RESET_REQ_Msk (0x10UL)        /*!< LCD_RESET_REQ (Bitfield-Mask: 0x01)                   */
#define CRG_SYS_RESET_CLK_SYS_REG_LCD_CLK_SEL_Pos (1UL)             /*!< LCD_CLK_SEL (Bit 1)                                   */
#define CRG_SYS_RESET_CLK_SYS_REG_LCD_CLK_SEL_Msk (0x2UL)           /*!< LCD_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SYS_RESET_CLK_SYS_REG_LCD_ENABLE_Pos (0UL)              /*!< LCD_ENABLE (Bit 0)                                    */
#define CRG_SYS_RESET_CLK_SYS_REG_LCD_ENABLE_Msk (0x1UL)            /*!< LCD_ENABLE (Bitfield-Mask: 0x01)                      */
/* ====================================================  SET_CLK_SYS_REG  ==================================================== */
#define CRG_SYS_SET_CLK_SYS_REG_SPI3_CLK_SEL_Pos (7UL)              /*!< SPI3_CLK_SEL (Bit 7)                                  */
#define CRG_SYS_SET_CLK_SYS_REG_SPI3_CLK_SEL_Msk (0x80UL)           /*!< SPI3_CLK_SEL (Bitfield-Mask: 0x01)                    */
#define CRG_SYS_SET_CLK_SYS_REG_SPI3_ENABLE_Pos (6UL)               /*!< SPI3_ENABLE (Bit 6)                                   */
#define CRG_SYS_SET_CLK_SYS_REG_SPI3_ENABLE_Msk (0x40UL)            /*!< SPI3_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_SYS_SET_CLK_SYS_REG_CLK_CHG_EN_Pos (5UL)                /*!< CLK_CHG_EN (Bit 5)                                    */
#define CRG_SYS_SET_CLK_SYS_REG_CLK_CHG_EN_Msk (0x20UL)             /*!< CLK_CHG_EN (Bitfield-Mask: 0x01)                      */
#define CRG_SYS_SET_CLK_SYS_REG_LCD_RESET_REQ_Pos (4UL)             /*!< LCD_RESET_REQ (Bit 4)                                 */
#define CRG_SYS_SET_CLK_SYS_REG_LCD_RESET_REQ_Msk (0x10UL)          /*!< LCD_RESET_REQ (Bitfield-Mask: 0x01)                   */
#define CRG_SYS_SET_CLK_SYS_REG_LCD_CLK_SEL_Pos (1UL)               /*!< LCD_CLK_SEL (Bit 1)                                   */
#define CRG_SYS_SET_CLK_SYS_REG_LCD_CLK_SEL_Msk (0x2UL)             /*!< LCD_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_SYS_SET_CLK_SYS_REG_LCD_ENABLE_Pos (0UL)                /*!< LCD_ENABLE (Bit 0)                                    */
#define CRG_SYS_SET_CLK_SYS_REG_LCD_ENABLE_Msk (0x1UL)              /*!< LCD_ENABLE (Bitfield-Mask: 0x01)                      */


/* =========================================================================================================================== */
/* ================                                          CRG_TOP                                          ================ */
/* =========================================================================================================================== */

