antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ====================================================  ANA_STATUS_REG  ===================================================== */
#define CRG_TOP_ANA_STATUS_REG_FLAG_LDO_V30_COMBINED_OK_Pos (29UL)  /*!< FLAG_LDO_V30_COMBINED_OK (Bit 29)                     */
#define CRG_TOP_ANA_STATUS_REG_FLAG_LDO_V30_COMBINED_OK_Msk (0x20000000UL) /*!< FLAG_LDO_V30_COMBINED_OK (Bitfield-Mask: 0x01) */
#define CRG_TOP_ANA_STATUS_REG_XOR_DOUT_WAKEUP_PADS_Pos (28UL)      /*!< XOR_DOUT_WAKEUP_PADS (Bit 28)                         */
#define CRG_TOP_ANA_STATUS_REG_XOR_DOUT_WAKEUP_PADS_Msk (0x10000000UL) /*!< XOR_DOUT_WAKEUP_PADS (Bitfield-Mask: 0x01)         */
#define CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Pos (27UL)            /*!< VBUS_AVAILABLE (Bit 27)                               */
#define CRG_TOP_ANA_STATUS_REG_VBUS_AVAILABLE_Msk (0x8000000UL)     /*!< VBUS_AVAILABLE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_ANA_STATUS_REG_FLAG_ADC_LDO_OK_Pos (26UL)           /*!< FLAG_ADC_LDO_OK (Bit 26)                              */
#define CRG_TOP_ANA_STATUS_REG_FLAG_ADC_LDO_OK_Msk (0x4000000UL)    /*!< FLAG_ADC_LDO_OK (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_ANA_STATUS_REG_FLAG_IBIAS_TRIM_Pos (25UL)           /*!< FLAG_IBIAS_TRIM (Bit 25)                              */
#define CRG_TOP_ANA_STATUS_REG_FLAG_IBIAS_TRIM_Msk (0x2000000UL)    /*!< FLAG_IBIAS_TRIM (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_ANA_STATUS_REG_BOD_VIN_NOK_Pos (24UL)               /*!< BOD_VIN_NOK (Bit 24)                                  */
#define CRG_TOP_ANA_STATUS_REG_BOD_VIN_NOK_Msk (0x1000000UL)        /*!< BOD_VIN_NOK (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_ANA_STATUS_REG_BG_OK_Pos  (23UL)                    /*!< BG_OK (Bit 23)                                        */
#define CRG_TOP_ANA_STATUS_REG_BG_OK_Msk  (0x800000UL)              /*!< BG_OK (Bitfield-Mask: 0x01)                           */
#define CRG_TOP_ANA_STATUS_REG_BOOST_DCDC_VLED_OK_Pos (22UL)        /*!< BOOST_DCDC_VLED_OK (Bit 22)                           */
#define CRG_TOP_ANA_STATUS_REG_BOOST_DCDC_VLED_OK_Msk (0x400000UL)  /*!< BOOST_DCDC_VLED_OK (Bitfield-Mask: 0x01)              */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_HIGH_TEMP_Pos (21UL)        /*!< LDO_VSYS_HIGH_TEMP (Bit 21)                           */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_HIGH_TEMP_Msk (0x200000UL)  /*!< LDO_VSYS_HIGH_TEMP (Bitfield-Mask: 0x01)              */
#define CRG_TOP_ANA_STATUS_REG_VBAT_VSYS_STATE_Pos (19UL)           /*!< VBAT_VSYS_STATE (Bit 19)                              */
#define CRG_TOP_ANA_STATUS_REG_VBAT_VSYS_STATE_Msk (0x180000UL)     /*!< VBAT_VSYS_STATE (Bitfield-Mask: 0x03)                 */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_HEAD_LIM_Pos (18UL)         /*!< LDO_VSYS_HEAD_LIM (Bit 18)                            */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_HEAD_LIM_Msk (0x40000UL)    /*!< LDO_VSYS_HEAD_LIM (Bitfield-Mask: 0x01)               */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_CURR_LIM_Pos (17UL)         /*!< LDO_VSYS_CURR_LIM (Bit 17)                            */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_CURR_LIM_Msk (0x20000UL)    /*!< LDO_VSYS_CURR_LIM (Bitfield-Mask: 0x01)               */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_LIM_Pos (16UL)              /*!< LDO_VSYS_LIM (Bit 16)                                 */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_LIM_Msk (0x10000UL)         /*!< LDO_VSYS_LIM (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_OK_Pos (15UL)               /*!< LDO_VSYS_OK (Bit 15)                                  */
#define CRG_TOP_ANA_STATUS_REG_LDO_VSYS_OK_Msk (0x8000UL)           /*!< LDO_VSYS_OK (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_ANA_STATUS_REG_LDO_V30_OK_Pos (13UL)                /*!< LDO_V30_OK (Bit 13)                                   */
#define CRG_TOP_ANA_STATUS_REG_LDO_V30_OK_Msk (0x2000UL)            /*!< LDO_V30_OK (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_ANA_STATUS_REG_SWITCH_V18F_OK_Pos (12UL)            /*!< SWITCH_V18F_OK (Bit 12)                               */
#define CRG_TOP_ANA_STATUS_REG_SWITCH_V18F_OK_Msk (0x1000UL)        /*!< SWITCH_V18F_OK (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V18P_OK_Pos (11UL)         /*!< BUCK_DCDC_V18P_OK (Bit 11)                            */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V18P_OK_Msk (0x800UL)      /*!< BUCK_DCDC_V18P_OK (Bitfield-Mask: 0x01)               */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V18_OK_Pos (10UL)          /*!< BUCK_DCDC_V18_OK (Bit 10)                             */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V18_OK_Msk (0x400UL)       /*!< BUCK_DCDC_V18_OK (Bitfield-Mask: 0x01)                */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V14_OK_Pos (9UL)           /*!< BUCK_DCDC_V14_OK (Bit 9)                              */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V14_OK_Msk (0x200UL)       /*!< BUCK_DCDC_V14_OK (Bitfield-Mask: 0x01)                */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V12_OK_Pos (8UL)           /*!< BUCK_DCDC_V12_OK (Bit 8)                              */
#define CRG_TOP_ANA_STATUS_REG_BUCK_DCDC_V12_OK_Msk (0x100UL)       /*!< BUCK_DCDC_V12_OK (Bitfield-Mask: 0x01)                */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_PLUGIN_Pos (7UL)           /*!< COMP_VBUS_PLUGIN (Bit 7)                              */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_PLUGIN_Msk (0x80UL)        /*!< COMP_VBUS_PLUGIN (Bitfield-Mask: 0x01)                */
#define CRG_TOP_ANA_STATUS_REG_COMP_VSYS_NEAR_VLED_Pos (6UL)        /*!< COMP_VSYS_NEAR_VLED (Bit 6)                           */
#define CRG_TOP_ANA_STATUS_REG_COMP_VSYS_NEAR_VLED_Msk (0x40UL)     /*!< COMP_VSYS_NEAR_VLED (Bitfield-Mask: 0x01)             */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_ABOVE_VSYS_Pos (5UL)       /*!< COMP_VBUS_ABOVE_VSYS (Bit 5)                          */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_ABOVE_VSYS_Msk (0x20UL)    /*!< COMP_VBUS_ABOVE_VSYS (Bitfield-Mask: 0x01)            */
#define CRG_TOP_ANA_STATUS_REG_COMP_VSYS_OK_Pos (4UL)               /*!< COMP_VSYS_OK (Bit 4)                                  */
#define CRG_TOP_ANA_STATUS_REG_COMP_VSYS_OK_Msk (0x10UL)            /*!< COMP_VSYS_OK (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBAT_OK_Pos (3UL)               /*!< COMP_VBAT_OK (Bit 3)                                  */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBAT_OK_Msk (0x8UL)             /*!< COMP_VBAT_OK (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_OK_Pos (2UL)               /*!< COMP_VBUS_OK (Bit 2)                                  */
#define CRG_TOP_ANA_STATUS_REG_COMP_VBUS_OK_Msk (0x4UL)             /*!< COMP_VBUS_OK (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_ANA_STATUS_REG_POR_VSYS_OK_Pos (1UL)                /*!< POR_VSYS_OK (Bit 1)                                   */
#define CRG_TOP_ANA_STATUS_REG_POR_VSYS_OK_Msk (0x2UL)              /*!< POR_VSYS_OK (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_ANA_STATUS_REG_POR_V30_OK_Pos (0UL)                 /*!< POR_V30_OK (Bit 0)                                    */
#define CRG_TOP_ANA_STATUS_REG_POR_V30_OK_Msk (0x1UL)               /*!< POR_V30_OK (Bitfield-Mask: 0x01)                      */
/* ======================================================  BANDGAP_REG  ====================================================== */
#define CRG_TOP_BANDGAP_REG_EN_BGR_TCCOMP_Pos (15UL)                /*!< EN_BGR_TCCOMP (Bit 15)                                */
#define CRG_TOP_BANDGAP_REG_EN_BGR_TCCOMP_Msk (0x8000UL)            /*!< EN_BGR_TCCOMP (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_BANDGAP_REG_BANDGAP_ENABLE_CLAMP_Pos (12UL)         /*!< BANDGAP_ENABLE_CLAMP (Bit 12)                         */
#define CRG_TOP_BANDGAP_REG_BANDGAP_ENABLE_CLAMP_Msk (0x1000UL)     /*!< BANDGAP_ENABLE_CLAMP (Bitfield-Mask: 0x01)            */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Pos  (6UL)                     /*!< BGR_TRIM (Bit 6)                                      */
#define CRG_TOP_BANDGAP_REG_BGR_TRIM_Msk  (0xfc0UL)                 /*!< BGR_TRIM (Bitfield-Mask: 0x3f)                        */
#define CRG_TOP_BANDGAP_REG_SYSRAM_LPMX_Pos (5UL)                   /*!< SYSRAM_LPMX (Bit 5)                                   */
#define CRG_TOP_BANDGAP_REG_SYSRAM_LPMX_Msk (0x20UL)                /*!< SYSRAM_LPMX (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Pos (0UL)                     /*!< BGR_ITRIM (Bit 0)                                     */
#define CRG_TOP_BANDGAP_REG_BGR_ITRIM_Msk (0x1fUL)                  /*!< BGR_ITRIM (Bitfield-Mask: 0x1f)                       */
/* ===================================================  BIAS_VREF_SEL_REG  =================================================== */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF2_SEL_Pos (4UL)       /*!< BIAS_VREF_RF2_SEL (Bit 4)                             */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF2_SEL_Msk (0xf0UL)    /*!< BIAS_VREF_RF2_SEL (Bitfield-Mask: 0x0f)               */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF1_SEL_Pos (0UL)       /*!< BIAS_VREF_RF1_SEL (Bit 0)                             */
#define CRG_TOP_BIAS_VREF_SEL_REG_BIAS_VREF_RF1_SEL_Msk (0xfUL)     /*!< BIAS_VREF_RF1_SEL (Bitfield-Mask: 0x0f)               */
/* =====================================================  BOD_CTRL_REG  ====================================================== */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBUS_RST_EN_Pos (18UL)             /*!< BOD_VBUS_RST_EN (Bit 18)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBUS_RST_EN_Msk (0x40000UL)        /*!< BOD_VBUS_RST_EN (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBAT_RST_EN_Pos (17UL)             /*!< BOD_VBAT_RST_EN (Bit 17)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBAT_RST_EN_Msk (0x20000UL)        /*!< BOD_VBAT_RST_EN (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_BOD_CTRL_REG_BOD_VSYS_RST_EN_Pos (15UL)             /*!< BOD_VSYS_RST_EN (Bit 15)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_VSYS_RST_EN_Msk (0x8000UL)         /*!< BOD_VSYS_RST_EN (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18F_RST_EN_Pos (14UL)             /*!< BOD_V18F_RST_EN (Bit 14)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18F_RST_EN_Msk (0x4000UL)         /*!< BOD_V18F_RST_EN (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18P_RST_EN_Pos (13UL)             /*!< BOD_V18P_RST_EN (Bit 13)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18P_RST_EN_Msk (0x2000UL)         /*!< BOD_V18P_RST_EN (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18_RST_EN_Pos (12UL)              /*!< BOD_V18_RST_EN (Bit 12)                               */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18_RST_EN_Msk (0x1000UL)          /*!< BOD_V18_RST_EN (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_BOD_CTRL_REG_BOD_V14_RST_EN_Pos (11UL)              /*!< BOD_V14_RST_EN (Bit 11)                               */
#define CRG_TOP_BOD_CTRL_REG_BOD_V14_RST_EN_Msk (0x800UL)           /*!< BOD_V14_RST_EN (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_BOD_CTRL_REG_BOD_V12_RST_EN_Pos (10UL)              /*!< BOD_V12_RST_EN (Bit 10)                               */
#define CRG_TOP_BOD_CTRL_REG_BOD_V12_RST_EN_Msk (0x400UL)           /*!< BOD_V12_RST_EN (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBUS_EN_Pos (9UL)                  /*!< BOD_VBUS_EN (Bit 9)                                   */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBUS_EN_Msk (0x200UL)              /*!< BOD_VBUS_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBAT_EN_Pos (8UL)                  /*!< BOD_VBAT_EN (Bit 8)                                   */
#define CRG_TOP_BOD_CTRL_REG_BOD_VBAT_EN_Msk (0x100UL)              /*!< BOD_VBAT_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_BOD_CTRL_REG_BOD_VSYS_EN_Pos (6UL)                  /*!< BOD_VSYS_EN (Bit 6)                                   */
#define CRG_TOP_BOD_CTRL_REG_BOD_VSYS_EN_Msk (0x40UL)               /*!< BOD_VSYS_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18F_EN_Pos (5UL)                  /*!< BOD_V18F_EN (Bit 5)                                   */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18F_EN_Msk (0x20UL)               /*!< BOD_V18F_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18P_EN_Pos (4UL)                  /*!< BOD_V18P_EN (Bit 4)                                   */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18P_EN_Msk (0x10UL)               /*!< BOD_V18P_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18_EN_Pos (3UL)                   /*!< BOD_V18_EN (Bit 3)                                    */
#define CRG_TOP_BOD_CTRL_REG_BOD_V18_EN_Msk (0x8UL)                 /*!< BOD_V18_EN (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_BOD_CTRL_REG_BOD_V14_EN_Pos (2UL)                   /*!< BOD_V14_EN (Bit 2)                                    */
#define CRG_TOP_BOD_CTRL_REG_BOD_V14_EN_Msk (0x4UL)                 /*!< BOD_V14_EN (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_BOD_CTRL_REG_BOD_V12_EN_Pos (1UL)                   /*!< BOD_V12_EN (Bit 1)                                    */
#define CRG_TOP_BOD_CTRL_REG_BOD_V12_EN_Msk (0x2UL)                 /*!< BOD_V12_EN (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_BOD_CTRL_REG_BOD_STATUS_CLEAR_Pos (0UL)             /*!< BOD_STATUS_CLEAR (Bit 0)                              */
#define CRG_TOP_BOD_CTRL_REG_BOD_STATUS_CLEAR_Msk (0x1UL)           /*!< BOD_STATUS_CLEAR (Bitfield-Mask: 0x01)                */
/* ====================================================  BOD_STATUS_REG  ===================================================== */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBUS_Pos (8UL)                   /*!< BOD_VBUS (Bit 8)                                      */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBUS_Msk (0x100UL)               /*!< BOD_VBUS (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBAT_Pos (7UL)                   /*!< BOD_VBAT (Bit 7)                                      */
#define CRG_TOP_BOD_STATUS_REG_BOD_VBAT_Msk (0x80UL)                /*!< BOD_VBAT (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_BOD_STATUS_REG_BOD_VSYS_Pos (5UL)                   /*!< BOD_VSYS (Bit 5)                                      */
#define CRG_TOP_BOD_STATUS_REG_BOD_VSYS_Msk (0x20UL)                /*!< BOD_VSYS (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_BOD_STATUS_REG_BOD_V18F_Pos (4UL)                   /*!< BOD_V18F (Bit 4)                                      */
#define CRG_TOP_BOD_STATUS_REG_BOD_V18F_Msk (0x10UL)                /*!< BOD_V18F (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_BOD_STATUS_REG_BOD_V18P_Pos (3UL)                   /*!< BOD_V18P (Bit 3)                                      */
#define CRG_TOP_BOD_STATUS_REG_BOD_V18P_Msk (0x8UL)                 /*!< BOD_V18P (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_BOD_STATUS_REG_BOD_V18_Pos (2UL)                    /*!< BOD_V18 (Bit 2)                                       */
#define CRG_TOP_BOD_STATUS_REG_BOD_V18_Msk (0x4UL)                  /*!< BOD_V18 (Bitfield-Mask: 0x01)                         */
#define CRG_TOP_BOD_STATUS_REG_BOD_V14_Pos (1UL)                    /*!< BOD_V14 (Bit 1)                                       */
#define CRG_TOP_BOD_STATUS_REG_BOD_V14_Msk (0x2UL)                  /*!< BOD_V14 (Bitfield-Mask: 0x01)                         */
#define CRG_TOP_BOD_STATUS_REG_BOD_V12_Pos (0UL)                    /*!< BOD_V12 (Bit 0)                                       */
#define CRG_TOP_BOD_STATUS_REG_BOD_V12_Msk (0x1UL)                  /*!< BOD_V12 (Bitfield-Mask: 0x01)                         */
/* =====================================================  CLK_AMBA_REG  ====================================================== */
#define CRG_TOP_CLK_AMBA_REG_OQSPI_PULLUP_ENABLE_Pos (20UL)         /*!< OQSPI_PULLUP_ENABLE (Bit 20)                          */
#define CRG_TOP_CLK_AMBA_REG_OQSPI_PULLUP_ENABLE_Msk (0x100000UL)   /*!< OQSPI_PULLUP_ENABLE (Bitfield-Mask: 0x01)             */
#define CRG_TOP_CLK_AMBA_REG_OQSPI_GPIO_MODE_Pos (19UL)             /*!< OQSPI_GPIO_MODE (Bit 19)                              */
#define CRG_TOP_CLK_AMBA_REG_OQSPI_GPIO_MODE_Msk (0x80000UL)        /*!< OQSPI_GPIO_MODE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_CLK_AMBA_REG_QSPIC2_ENABLE_Pos (18UL)               /*!< QSPIC2_ENABLE (Bit 18)                                */
#define CRG_TOP_CLK_AMBA_REG_QSPIC2_ENABLE_Msk (0x40000UL)          /*!< QSPIC2_ENABLE (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_CLK_AMBA_REG_QSPIC2_DIV_Pos (16UL)                  /*!< QSPIC2_DIV (Bit 16)                                   */
#define CRG_TOP_CLK_AMBA_REG_QSPIC2_DIV_Msk (0x30000UL)             /*!< QSPIC2_DIV (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_CLK_AMBA_REG_QSPIC_ENABLE_Pos (15UL)                /*!< QSPIC_ENABLE (Bit 15)                                 */
#define CRG_TOP_CLK_AMBA_REG_QSPIC_ENABLE_Msk (0x8000UL)            /*!< QSPIC_ENABLE (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_CLK_AMBA_REG_QSPIC_DIV_Pos (13UL)                   /*!< QSPIC_DIV (Bit 13)                                    */
#define CRG_TOP_CLK_AMBA_REG_QSPIC_DIV_Msk (0x6000UL)               /*!< QSPIC_DIV (Bitfield-Mask: 0x03)                       */
#define CRG_TOP_CLK_AMBA_REG_OQSPIF_ENABLE_Pos (12UL)               /*!< OQSPIF_ENABLE (Bit 12)                                */
#define CRG_TOP_CLK_AMBA_REG_OQSPIF_ENABLE_Msk (0x1000UL)           /*!< OQSPIF_ENABLE (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_CLK_AMBA_REG_OQSPIF_DIV_Pos (10UL)                  /*!< OQSPIF_DIV (Bit 10)                                   */
#define CRG_TOP_CLK_AMBA_REG_OQSPIF_DIV_Msk (0xc00UL)               /*!< OQSPIF_DIV (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_CLK_AMBA_REG_OTP_ENABLE_Pos (9UL)                   /*!< OTP_ENABLE (Bit 9)                                    */
#define CRG_TOP_CLK_AMBA_REG_OTP_ENABLE_Msk (0x200UL)               /*!< OTP_ENABLE (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Pos (8UL)               /*!< AES_CLK_ENABLE (Bit 8)                                */
#define CRG_TOP_CLK_AMBA_REG_AES_CLK_ENABLE_Msk (0x100UL)           /*!< AES_CLK_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_CLK_AMBA_REG_SLOW_PCLK_DIV_Pos (5UL)                /*!< SLOW_PCLK_DIV (Bit 5)                                 */
#define CRG_TOP_CLK_AMBA_REG_SLOW_PCLK_DIV_Msk (0xe0UL)             /*!< SLOW_PCLK_DIV (Bitfield-Mask: 0x07)                   */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Pos (3UL)                     /*!< PCLK_DIV (Bit 3)                                      */
#define CRG_TOP_CLK_AMBA_REG_PCLK_DIV_Msk (0x18UL)                  /*!< PCLK_DIV (Bitfield-Mask: 0x03)                        */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Pos (0UL)                     /*!< HCLK_DIV (Bit 0)                                      */
#define CRG_TOP_CLK_AMBA_REG_HCLK_DIV_Msk (0x7UL)                   /*!< HCLK_DIV (Bitfield-Mask: 0x07)                        */
/* ==================================================  CLK_CMAC_SWITCH_REG  ================================================== */
#define CRG_TOP_CLK_CMAC_SWITCH_REG_CMAC_RUNNING_ON_XTAL_Pos (2UL)  /*!< CMAC_RUNNING_ON_XTAL (Bit 2)                          */
#define CRG_TOP_CLK_CMAC_SWITCH_REG_CMAC_RUNNING_ON_XTAL_Msk (0x4UL) /*!< CMAC_RUNNING_ON_XTAL (Bitfield-Mask: 0x01)           */
#define CRG_TOP_CLK_CMAC_SWITCH_REG_CMAC_RUNNING_ON_DIVN_Pos (1UL)  /*!< CMAC_RUNNING_ON_DIVN (Bit 1)                          */
#define CRG_TOP_CLK_CMAC_SWITCH_REG_CMAC_RUNNING_ON_DIVN_Msk (0x2UL) /*!< CMAC_RUNNING_ON_DIVN (Bitfield-Mask: 0x01)           */
#define CRG_TOP_CLK_CMAC_SWITCH_REG_CMAC_CLK_SEL_Pos (0UL)          /*!< CMAC_CLK_SEL (Bit 0)                                  */
#define CRG_TOP_CLK_CMAC_SWITCH_REG_CMAC_CLK_SEL_Msk (0x1UL)        /*!< CMAC_CLK_SEL (Bitfield-Mask: 0x01)                    */
/* =====================================================  CLK_CTRL_REG  ====================================================== */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_PLL_Pos (15UL)              /*!< RUNNING_AT_PLL (Bit 15)                               */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_PLL_Msk (0x8000UL)          /*!< RUNNING_AT_PLL (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL32M_Pos (14UL)          /*!< RUNNING_AT_XTAL32M (Bit 14)                           */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_XTAL32M_Msk (0x4000UL)      /*!< RUNNING_AT_XTAL32M (Bitfield-Mask: 0x01)              */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RCHS_Pos (13UL)             /*!< RUNNING_AT_RCHS (Bit 13)                              */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RCHS_Msk (0x2000UL)         /*!< RUNNING_AT_RCHS (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RCLP_Pos (12UL)             /*!< RUNNING_AT_RCLP (Bit 12)                              */
#define CRG_TOP_CLK_CTRL_REG_RUNNING_AT_RCLP_Msk (0x1000UL)         /*!< RUNNING_AT_RCLP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_CLK_CTRL_REG_VAD_CLK_SEL_Pos (6UL)                  /*!< VAD_CLK_SEL (Bit 6)                                   */
#define CRG_TOP_CLK_CTRL_REG_VAD_CLK_SEL_Msk (0x40UL)               /*!< VAD_CLK_SEL (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_CLK_CTRL_REG_USB_CLK_SRC_Pos (4UL)                  /*!< USB_CLK_SRC (Bit 4)                                   */
#define CRG_TOP_CLK_CTRL_REG_USB_CLK_SRC_Msk (0x10UL)               /*!< USB_CLK_SRC (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_CLK_CTRL_REG_LP_CLK_SEL_Pos (2UL)                   /*!< LP_CLK_SEL (Bit 2)                                    */
#define CRG_TOP_CLK_CTRL_REG_LP_CLK_SEL_Msk (0xcUL)                 /*!< LP_CLK_SEL (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Pos (0UL)                  /*!< SYS_CLK_SEL (Bit 0)                                   */
#define CRG_TOP_CLK_CTRL_REG_SYS_CLK_SEL_Msk (0x3UL)                /*!< SYS_CLK_SEL (Bitfield-Mask: 0x03)                     */
/* =====================================================  CLK_RADIO_REG  ===================================================== */
#define CRG_TOP_CLK_RADIO_REG_RAD_REG_RESET_REQ_Pos (6UL)           /*!< RAD_REG_RESET_REQ (Bit 6)                             */
#define CRG_TOP_CLK_RADIO_REG_RAD_REG_RESET_REQ_Msk (0x40UL)        /*!< RAD_REG_RESET_REQ (Bitfield-Mask: 0x01)               */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Pos (5UL)                 /*!< RFCU_ENABLE (Bit 5)                                   */
#define CRG_TOP_CLK_RADIO_REG_RFCU_ENABLE_Msk (0x20UL)              /*!< RFCU_ENABLE (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_CLK_RADIO_REG_CMAC_SYNCH_RESET_Pos (4UL)            /*!< CMAC_SYNCH_RESET (Bit 4)                              */
#define CRG_TOP_CLK_RADIO_REG_CMAC_SYNCH_RESET_Msk (0x10UL)         /*!< CMAC_SYNCH_RESET (Bitfield-Mask: 0x01)                */
#define CRG_TOP_CLK_RADIO_REG_CMAC_CLK_ENABLE_Pos (2UL)             /*!< CMAC_CLK_ENABLE (Bit 2)                               */
