antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define CRG_TOP_CLK_RADIO_REG_CMAC_CLK_ENABLE_Msk (0x4UL)           /*!< CMAC_CLK_ENABLE (Bitfield-Mask: 0x01)                 */
/* =====================================================  CLK_RCHS_REG  ====================================================== */
#define CRG_TOP_CLK_RCHS_REG_RCHS_SPEED_Pos (22UL)                  /*!< RCHS_SPEED (Bit 22)                                   */
#define CRG_TOP_CLK_RCHS_REG_RCHS_SPEED_Msk (0xc00000UL)            /*!< RCHS_SPEED (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_RANGE_Pos (20UL)             /*!< RCHS_INIT_RANGE (Bit 20)                              */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_RANGE_Msk (0x300000UL)       /*!< RCHS_INIT_RANGE (Bitfield-Mask: 0x03)                 */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_DEL_Pos (12UL)               /*!< RCHS_INIT_DEL (Bit 12)                                */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_DEL_Msk (0xff000UL)          /*!< RCHS_INIT_DEL (Bitfield-Mask: 0xff)                   */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_DTCF_Pos (9UL)               /*!< RCHS_INIT_DTCF (Bit 9)                                */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_DTCF_Msk (0xe00UL)           /*!< RCHS_INIT_DTCF (Bitfield-Mask: 0x07)                  */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_DTC_Pos (5UL)                /*!< RCHS_INIT_DTC (Bit 5)                                 */
#define CRG_TOP_CLK_RCHS_REG_RCHS_INIT_DTC_Msk (0x1e0UL)            /*!< RCHS_INIT_DTC (Bitfield-Mask: 0x0f)                   */
#define CRG_TOP_CLK_RCHS_REG_RCHS_BIAS_Pos (1UL)                    /*!< RCHS_BIAS (Bit 1)                                     */
#define CRG_TOP_CLK_RCHS_REG_RCHS_BIAS_Msk (0x1eUL)                 /*!< RCHS_BIAS (Bitfield-Mask: 0x0f)                       */
#define CRG_TOP_CLK_RCHS_REG_RCHS_ENABLE_Pos (0UL)                  /*!< RCHS_ENABLE (Bit 0)                                   */
#define CRG_TOP_CLK_RCHS_REG_RCHS_ENABLE_Msk (0x1UL)                /*!< RCHS_ENABLE (Bitfield-Mask: 0x01)                     */
/* =====================================================  CLK_RCLP_REG  ====================================================== */
#define CRG_TOP_CLK_RCLP_REG_RCLP_LOW_SPEED_FORCE_Pos (5UL)         /*!< RCLP_LOW_SPEED_FORCE (Bit 5)                          */
#define CRG_TOP_CLK_RCLP_REG_RCLP_LOW_SPEED_FORCE_Msk (0x20UL)      /*!< RCLP_LOW_SPEED_FORCE (Bitfield-Mask: 0x01)            */
#define CRG_TOP_CLK_RCLP_REG_RCLP_TRIM_Pos (1UL)                    /*!< RCLP_TRIM (Bit 1)                                     */
#define CRG_TOP_CLK_RCLP_REG_RCLP_TRIM_Msk (0x1eUL)                 /*!< RCLP_TRIM (Bitfield-Mask: 0x0f)                       */
#define CRG_TOP_CLK_RCLP_REG_RCLP_ENABLE_Pos (0UL)                  /*!< RCLP_ENABLE (Bit 0)                                   */
#define CRG_TOP_CLK_RCLP_REG_RCLP_ENABLE_Msk (0x1UL)                /*!< RCLP_ENABLE (Bitfield-Mask: 0x01)                     */
/* ======================================================  CLK_RCX_REG  ====================================================== */
#define CRG_TOP_CLK_RCX_REG_RCX_BIAS_Pos  (8UL)                     /*!< RCX_BIAS (Bit 8)                                      */
#define CRG_TOP_CLK_RCX_REG_RCX_BIAS_Msk  (0xf00UL)                 /*!< RCX_BIAS (Bitfield-Mask: 0x0f)                        */
#define CRG_TOP_CLK_RCX_REG_RCX_C0_Pos    (7UL)                     /*!< RCX_C0 (Bit 7)                                        */
#define CRG_TOP_CLK_RCX_REG_RCX_C0_Msk    (0x80UL)                  /*!< RCX_C0 (Bitfield-Mask: 0x01)                          */
#define CRG_TOP_CLK_RCX_REG_RCX_CADJUST_Pos (2UL)                   /*!< RCX_CADJUST (Bit 2)                                   */
#define CRG_TOP_CLK_RCX_REG_RCX_CADJUST_Msk (0x7cUL)                /*!< RCX_CADJUST (Bitfield-Mask: 0x1f)                     */
#define CRG_TOP_CLK_RCX_REG_RCX_ENABLE_Pos (0UL)                    /*!< RCX_ENABLE (Bit 0)                                    */
#define CRG_TOP_CLK_RCX_REG_RCX_ENABLE_Msk (0x1UL)                  /*!< RCX_ENABLE (Bitfield-Mask: 0x01)                      */
/* ====================================================  CLK_RTCDIV_REG  ===================================================== */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_RESET_REQ_Pos (21UL)             /*!< RTC_RESET_REQ (Bit 21)                                */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_RESET_REQ_Msk (0x200000UL)       /*!< RTC_RESET_REQ (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_ENABLE_Pos (20UL)            /*!< RTC_DIV_ENABLE (Bit 20)                               */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_ENABLE_Msk (0x100000UL)      /*!< RTC_DIV_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_DENOM_Pos (19UL)             /*!< RTC_DIV_DENOM (Bit 19)                                */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_DENOM_Msk (0x80000UL)        /*!< RTC_DIV_DENOM (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_INT_Pos (10UL)               /*!< RTC_DIV_INT (Bit 10)                                  */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_INT_Msk (0x7fc00UL)          /*!< RTC_DIV_INT (Bitfield-Mask: 0x1ff)                    */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_FRAC_Pos (0UL)               /*!< RTC_DIV_FRAC (Bit 0)                                  */
#define CRG_TOP_CLK_RTCDIV_REG_RTC_DIV_FRAC_Msk (0x3ffUL)           /*!< RTC_DIV_FRAC (Bitfield-Mask: 0x3ff)                   */
/* ===================================================  CLK_SNC_CTRL_REG  ==================================================== */
#define CRG_TOP_CLK_SNC_CTRL_REG_SNC_STATE_RETAINED_Pos (2UL)       /*!< SNC_STATE_RETAINED (Bit 2)                            */
#define CRG_TOP_CLK_SNC_CTRL_REG_SNC_STATE_RETAINED_Msk (0x4UL)     /*!< SNC_STATE_RETAINED (Bitfield-Mask: 0x01)              */
#define CRG_TOP_CLK_SNC_CTRL_REG_SNC_CLK_ENABLE_Pos (1UL)           /*!< SNC_CLK_ENABLE (Bit 1)                                */
#define CRG_TOP_CLK_SNC_CTRL_REG_SNC_CLK_ENABLE_Msk (0x2UL)         /*!< SNC_CLK_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_CLK_SNC_CTRL_REG_SNC_RESET_REQ_Pos (0UL)            /*!< SNC_RESET_REQ (Bit 0)                                 */
#define CRG_TOP_CLK_SNC_CTRL_REG_SNC_RESET_REQ_Msk (0x1UL)          /*!< SNC_RESET_REQ (Bitfield-Mask: 0x01)                   */
/* ==================================================  CLK_SWITCH2XTAL_REG  ================================================== */
#define CRG_TOP_CLK_SWITCH2XTAL_REG_SWITCH2XTAL_Pos (0UL)           /*!< SWITCH2XTAL (Bit 0)                                   */
#define CRG_TOP_CLK_SWITCH2XTAL_REG_SWITCH2XTAL_Msk (0x1UL)         /*!< SWITCH2XTAL (Bitfield-Mask: 0x01)                     */
/* ======================================================  CLK_TMR_REG  ====================================================== */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Pos (0UL)               /*!< WAKEUPCT_ENABLE (Bit 0)                               */
#define CRG_TOP_CLK_TMR_REG_WAKEUPCT_ENABLE_Msk (0x1UL)             /*!< WAKEUPCT_ENABLE (Bitfield-Mask: 0x01)                 */
/* ====================================================  CLK_XTAL32K_REG  ==================================================== */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_DISABLE_OUTPUT_Pos (9UL)    /*!< XTAL32K_DISABLE_OUTPUT (Bit 9)                        */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_DISABLE_OUTPUT_Msk (0x200UL) /*!< XTAL32K_DISABLE_OUTPUT (Bitfield-Mask: 0x01)         */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_DISABLE_AMPREG_Pos (7UL)    /*!< XTAL32K_DISABLE_AMPREG (Bit 7)                        */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_DISABLE_AMPREG_Msk (0x80UL) /*!< XTAL32K_DISABLE_AMPREG (Bitfield-Mask: 0x01)          */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_CUR_Pos (3UL)               /*!< XTAL32K_CUR (Bit 3)                                   */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_CUR_Msk (0x78UL)            /*!< XTAL32K_CUR (Bitfield-Mask: 0x0f)                     */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_RBIAS_Pos (1UL)             /*!< XTAL32K_RBIAS (Bit 1)                                 */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_RBIAS_Msk (0x6UL)           /*!< XTAL32K_RBIAS (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_ENABLE_Pos (0UL)            /*!< XTAL32K_ENABLE (Bit 0)                                */
#define CRG_TOP_CLK_XTAL32K_REG_XTAL32K_ENABLE_Msk (0x1UL)          /*!< XTAL32K_ENABLE (Bitfield-Mask: 0x01)                  */
/* ==================================================  DISCHARGE_RAIL_REG  =================================================== */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18F_Pos (5UL)             /*!< RESET_V18F (Bit 5)                                    */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18F_Msk (0x20UL)          /*!< RESET_V18F (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V30_Pos (3UL)              /*!< RESET_V30 (Bit 3)                                     */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V30_Msk (0x8UL)            /*!< RESET_V30 (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18P_Pos (2UL)             /*!< RESET_V18P (Bit 2)                                    */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18P_Msk (0x4UL)           /*!< RESET_V18P (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18_Pos (1UL)              /*!< RESET_V18 (Bit 1)                                     */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V18_Msk (0x2UL)            /*!< RESET_V18 (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V14_Pos (0UL)              /*!< RESET_V14 (Bit 0)                                     */
#define CRG_TOP_DISCHARGE_RAIL_REG_RESET_V14_Msk (0x1UL)            /*!< RESET_V14 (Bitfield-Mask: 0x01)                       */
/* ===================================================  LCD_EXT_CTRL_REG  ==================================================== */
#define CRG_TOP_LCD_EXT_CTRL_REG_LCD_EXT_CLK_EN_Pos (10UL)          /*!< LCD_EXT_CLK_EN (Bit 10)                               */
#define CRG_TOP_LCD_EXT_CTRL_REG_LCD_EXT_CLK_EN_Msk (0x400UL)       /*!< LCD_EXT_CLK_EN (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_LCD_EXT_CTRL_REG_LCD_EXT_CNT_RELOAD_Pos (0UL)       /*!< LCD_EXT_CNT_RELOAD (Bit 0)                            */
#define CRG_TOP_LCD_EXT_CTRL_REG_LCD_EXT_CNT_RELOAD_Msk (0x3ffUL)   /*!< LCD_EXT_CNT_RELOAD (Bitfield-Mask: 0x3ff)             */
/* ===================================================  P0_PAD_LATCH_REG  ==================================================== */
#define CRG_TOP_P0_PAD_LATCH_REG_P0_LATCH_EN_Pos (0UL)              /*!< P0_LATCH_EN (Bit 0)                                   */
#define CRG_TOP_P0_PAD_LATCH_REG_P0_LATCH_EN_Msk (0xffffffffUL)     /*!< P0_LATCH_EN (Bitfield-Mask: 0xffffffff)               */
/* ================================================  P0_RESET_PAD_LATCH_REG  ================================================= */
#define CRG_TOP_P0_RESET_PAD_LATCH_REG_P0_RESET_LATCH_EN_Pos (0UL)  /*!< P0_RESET_LATCH_EN (Bit 0)                             */
#define CRG_TOP_P0_RESET_PAD_LATCH_REG_P0_RESET_LATCH_EN_Msk (0xffffffffUL) /*!< P0_RESET_LATCH_EN (Bitfield-Mask: 0xffffffff) */
/* =================================================  P0_SET_PAD_LATCH_REG  ================================================== */
#define CRG_TOP_P0_SET_PAD_LATCH_REG_P0_SET_LATCH_EN_Pos (0UL)      /*!< P0_SET_LATCH_EN (Bit 0)                               */
#define CRG_TOP_P0_SET_PAD_LATCH_REG_P0_SET_LATCH_EN_Msk (0xffffffffUL) /*!< P0_SET_LATCH_EN (Bitfield-Mask: 0xffffffff)       */
/* ===================================================  P1_PAD_LATCH_REG  ==================================================== */
#define CRG_TOP_P1_PAD_LATCH_REG_P1_LATCH_EN_Pos (0UL)              /*!< P1_LATCH_EN (Bit 0)                                   */
#define CRG_TOP_P1_PAD_LATCH_REG_P1_LATCH_EN_Msk (0xffffffffUL)     /*!< P1_LATCH_EN (Bitfield-Mask: 0xffffffff)               */
/* ================================================  P1_RESET_PAD_LATCH_REG  ================================================= */
#define CRG_TOP_P1_RESET_PAD_LATCH_REG_P1_RESET_LATCH_EN_Pos (0UL)  /*!< P1_RESET_LATCH_EN (Bit 0)                             */
#define CRG_TOP_P1_RESET_PAD_LATCH_REG_P1_RESET_LATCH_EN_Msk (0xffffffffUL) /*!< P1_RESET_LATCH_EN (Bitfield-Mask: 0xffffffff) */
/* =================================================  P1_SET_PAD_LATCH_REG  ================================================== */
#define CRG_TOP_P1_SET_PAD_LATCH_REG_P1_SET_LATCH_EN_Pos (0UL)      /*!< P1_SET_LATCH_EN (Bit 0)                               */
#define CRG_TOP_P1_SET_PAD_LATCH_REG_P1_SET_LATCH_EN_Msk (0xffffffffUL) /*!< P1_SET_LATCH_EN (Bitfield-Mask: 0xffffffff)       */
/* ===================================================  P2_PAD_LATCH_REG  ==================================================== */
#define CRG_TOP_P2_PAD_LATCH_REG_P2_LATCH_EN_Pos (0UL)              /*!< P2_LATCH_EN (Bit 0)                                   */
#define CRG_TOP_P2_PAD_LATCH_REG_P2_LATCH_EN_Msk (0x7fffUL)         /*!< P2_LATCH_EN (Bitfield-Mask: 0x7fff)                   */
/* ================================================  P2_RESET_PAD_LATCH_REG  ================================================= */
#define CRG_TOP_P2_RESET_PAD_LATCH_REG_P2_RESET_LATCH_EN_Pos (0UL)  /*!< P2_RESET_LATCH_EN (Bit 0)                             */
#define CRG_TOP_P2_RESET_PAD_LATCH_REG_P2_RESET_LATCH_EN_Msk (0x7fffUL) /*!< P2_RESET_LATCH_EN (Bitfield-Mask: 0x7fff)         */
/* =================================================  P2_SET_PAD_LATCH_REG  ================================================== */
#define CRG_TOP_P2_SET_PAD_LATCH_REG_P2_SET_LATCH_EN_Pos (0UL)      /*!< P2_SET_LATCH_EN (Bit 0)                               */
#define CRG_TOP_P2_SET_PAD_LATCH_REG_P2_SET_LATCH_EN_Msk (0x7fffUL) /*!< P2_SET_LATCH_EN (Bitfield-Mask: 0x7fff)               */
/* =====================================================  PMU_CTRL_REG  ====================================================== */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_RGP_RAM_Pos (13UL)              /*!< RETAIN_RGP_RAM (Bit 13)                               */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_RGP_RAM_Msk (0x2000UL)          /*!< RETAIN_RGP_RAM (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_GPU_CLUT_Pos (12UL)             /*!< RETAIN_GPU_CLUT (Bit 12)                              */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_GPU_CLUT_Msk (0x1000UL)         /*!< RETAIN_GPU_CLUT (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_DCACHE_Pos (11UL)               /*!< RETAIN_DCACHE (Bit 11)                                */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_DCACHE_Msk (0x800UL)            /*!< RETAIN_DCACHE (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_PMU_CTRL_REG_GPU_SLEEP_Pos (10UL)                   /*!< GPU_SLEEP (Bit 10)                                    */
#define CRG_TOP_PMU_CTRL_REG_GPU_SLEEP_Msk (0x400UL)                /*!< GPU_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_CTRL_SLEEP_Pos (9UL)                   /*!< CTRL_SLEEP (Bit 9)                                    */
#define CRG_TOP_PMU_CTRL_REG_CTRL_SLEEP_Msk (0x200UL)               /*!< CTRL_SLEEP (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Pos (7UL)                 /*!< RETAIN_CACHE (Bit 7)                                  */
#define CRG_TOP_PMU_CTRL_REG_RETAIN_CACHE_Msk (0x80UL)              /*!< RETAIN_CACHE (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_PMU_CTRL_REG_SYS_SLEEP_Pos (6UL)                    /*!< SYS_SLEEP (Bit 6)                                     */
#define CRG_TOP_PMU_CTRL_REG_SYS_SLEEP_Msk (0x40UL)                 /*!< SYS_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Pos (5UL)              /*!< RESET_ON_WAKEUP (Bit 5)                               */
#define CRG_TOP_PMU_CTRL_REG_RESET_ON_WAKEUP_Msk (0x20UL)           /*!< RESET_ON_WAKEUP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_PMU_CTRL_REG_SNC_SLEEP_Pos (3UL)                    /*!< SNC_SLEEP (Bit 3)                                     */
#define CRG_TOP_PMU_CTRL_REG_SNC_SLEEP_Msk (0x8UL)                  /*!< SNC_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_TIM_SLEEP_Pos (2UL)                    /*!< TIM_SLEEP (Bit 2)                                     */
#define CRG_TOP_PMU_CTRL_REG_TIM_SLEEP_Msk (0x4UL)                  /*!< TIM_SLEEP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Pos (1UL)                  /*!< RADIO_SLEEP (Bit 1)                                   */
#define CRG_TOP_PMU_CTRL_REG_RADIO_SLEEP_Msk (0x2UL)                /*!< RADIO_SLEEP (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_PMU_CTRL_REG_AUD_SLEEP_Pos (0UL)                    /*!< AUD_SLEEP (Bit 0)                                     */
#define CRG_TOP_PMU_CTRL_REG_AUD_SLEEP_Msk (0x1UL)                  /*!< AUD_SLEEP (Bitfield-Mask: 0x01)                       */
/* =====================================================  PMU_SLEEP_REG  ===================================================== */
#define CRG_TOP_PMU_SLEEP_REG_ULTRA_FAST_WAKEUP_Pos (31UL)          /*!< ULTRA_FAST_WAKEUP (Bit 31)                            */
#define CRG_TOP_PMU_SLEEP_REG_ULTRA_FAST_WAKEUP_Msk (0x80000000UL)  /*!< ULTRA_FAST_WAKEUP (Bitfield-Mask: 0x01)               */
#define CRG_TOP_PMU_SLEEP_REG_ENABLE_FAST_SWITCH_Pos (30UL)         /*!< ENABLE_FAST_SWITCH (Bit 30)                           */
#define CRG_TOP_PMU_SLEEP_REG_ENABLE_FAST_SWITCH_Msk (0x40000000UL) /*!< ENABLE_FAST_SWITCH (Bitfield-Mask: 0x01)              */
#define CRG_TOP_PMU_SLEEP_REG_VLED_BYPASS_REFRESH_TIME_Pos (23UL)   /*!< VLED_BYPASS_REFRESH_TIME (Bit 23)                     */
#define CRG_TOP_PMU_SLEEP_REG_VLED_BYPASS_REFRESH_TIME_Msk (0x3f800000UL) /*!< VLED_BYPASS_REFRESH_TIME (Bitfield-Mask: 0x7f)  */
#define CRG_TOP_PMU_SLEEP_REG_BOD_SLEEP_INTERVAL_Pos (19UL)         /*!< BOD_SLEEP_INTERVAL (Bit 19)                           */
#define CRG_TOP_PMU_SLEEP_REG_BOD_SLEEP_INTERVAL_Msk (0x780000UL)   /*!< BOD_SLEEP_INTERVAL (Bitfield-Mask: 0x0f)              */
#define CRG_TOP_PMU_SLEEP_REG_RAILS_REFRESH_INTERVAL_Pos (5UL)      /*!< RAILS_REFRESH_INTERVAL (Bit 5)                        */
#define CRG_TOP_PMU_SLEEP_REG_RAILS_REFRESH_INTERVAL_Msk (0x7ffe0UL) /*!< RAILS_REFRESH_INTERVAL (Bitfield-Mask: 0x3fff)       */
#define CRG_TOP_PMU_SLEEP_REG_BASE_REFRESH_INTERVAL_Pos (0UL)       /*!< BASE_REFRESH_INTERVAL (Bit 0)                         */
#define CRG_TOP_PMU_SLEEP_REG_BASE_REFRESH_INTERVAL_Msk (0x1fUL)    /*!< BASE_REFRESH_INTERVAL (Bitfield-Mask: 0x1f)           */
/* =====================================================  POR_CTRL_REG  ====================================================== */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_SLEEP_CYCLE_EN_Pos (11UL)     /*!< POR_VSYS_SLEEP_CYCLE_EN (Bit 11)                      */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_SLEEP_CYCLE_EN_Msk (0x800UL)  /*!< POR_VSYS_SLEEP_CYCLE_EN (Bitfield-Mask: 0x01)         */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_HYST_SEL_Pos (10UL)           /*!< POR_VSYS_HYST_SEL (Bit 10)                            */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_HYST_SEL_Msk (0x400UL)        /*!< POR_VSYS_HYST_SEL (Bitfield-Mask: 0x01)               */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_HYST_DISABLE_Pos (9UL)        /*!< POR_VSYS_HYST_DISABLE (Bit 9)                         */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_HYST_DISABLE_Msk (0x200UL)    /*!< POR_VSYS_HYST_DISABLE (Bitfield-Mask: 0x01)           */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_FORCE_ON_Pos (8UL)            /*!< POR_VSYS_FORCE_ON (Bit 8)                             */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_FORCE_ON_Msk (0x100UL)        /*!< POR_VSYS_FORCE_ON (Bitfield-Mask: 0x01)               */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_MASK_Pos (7UL)                /*!< POR_VSYS_MASK (Bit 7)                                 */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_MASK_Msk (0x80UL)             /*!< POR_VSYS_MASK (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_DISABLE_Pos (6UL)             /*!< POR_VSYS_DISABLE (Bit 6)                              */
#define CRG_TOP_POR_CTRL_REG_POR_VSYS_DISABLE_Msk (0x40UL)          /*!< POR_VSYS_DISABLE (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POR_CTRL_REG_POR_V30_SLEEP_CYCLE_EN_Pos (5UL)       /*!< POR_V30_SLEEP_CYCLE_EN (Bit 5)                        */
#define CRG_TOP_POR_CTRL_REG_POR_V30_SLEEP_CYCLE_EN_Msk (0x20UL)    /*!< POR_V30_SLEEP_CYCLE_EN (Bitfield-Mask: 0x01)          */
#define CRG_TOP_POR_CTRL_REG_POR_V30_HYST_SEL_Pos (4UL)             /*!< POR_V30_HYST_SEL (Bit 4)                              */
#define CRG_TOP_POR_CTRL_REG_POR_V30_HYST_SEL_Msk (0x10UL)          /*!< POR_V30_HYST_SEL (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POR_CTRL_REG_POR_V30_HYST_DISABLE_Pos (3UL)         /*!< POR_V30_HYST_DISABLE (Bit 3)                          */
#define CRG_TOP_POR_CTRL_REG_POR_V30_HYST_DISABLE_Msk (0x8UL)       /*!< POR_V30_HYST_DISABLE (Bitfield-Mask: 0x01)            */
#define CRG_TOP_POR_CTRL_REG_POR_V30_FORCE_ON_Pos (2UL)             /*!< POR_V30_FORCE_ON (Bit 2)                              */
#define CRG_TOP_POR_CTRL_REG_POR_V30_FORCE_ON_Msk (0x4UL)           /*!< POR_V30_FORCE_ON (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POR_CTRL_REG_POR_V30_MASK_Pos (1UL)                 /*!< POR_V30_MASK (Bit 1)                                  */
#define CRG_TOP_POR_CTRL_REG_POR_V30_MASK_Msk (0x2UL)               /*!< POR_V30_MASK (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_POR_CTRL_REG_POR_V30_DISABLE_Pos (0UL)              /*!< POR_V30_DISABLE (Bit 0)                               */
#define CRG_TOP_POR_CTRL_REG_POR_V30_DISABLE_Msk (0x1UL)            /*!< POR_V30_DISABLE (Bitfield-Mask: 0x01)                 */
/* ======================================================  POR_PIN_REG  ====================================================== */
#define CRG_TOP_POR_PIN_REG_POR_PIN_POLARITY_Pos (7UL)              /*!< POR_PIN_POLARITY (Bit 7)                              */
#define CRG_TOP_POR_PIN_REG_POR_PIN_POLARITY_Msk (0x80UL)           /*!< POR_PIN_POLARITY (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POR_PIN_REG_POR_PIN_SELECT_Pos (0UL)                /*!< POR_PIN_SELECT (Bit 0)                                */
#define CRG_TOP_POR_PIN_REG_POR_PIN_SELECT_Msk (0x7fUL)             /*!< POR_PIN_SELECT (Bitfield-Mask: 0x7f)                  */
/* =====================================================  POR_TIMER_REG  ===================================================== */
#define CRG_TOP_POR_TIMER_REG_POR_TIME_Pos (0UL)                    /*!< POR_TIME (Bit 0)                                      */
#define CRG_TOP_POR_TIMER_REG_POR_TIME_Msk (0x7fUL)                 /*!< POR_TIME (Bitfield-Mask: 0x7f)                        */
/* ====================================================  POWER_CTRL_REG  ===================================================== */
#define CRG_TOP_POWER_CTRL_REG_EN_RCX_SUPPLY_BIAS_Pos (27UL)        /*!< EN_RCX_SUPPLY_BIAS (Bit 27)                           */
#define CRG_TOP_POWER_CTRL_REG_EN_RCX_SUPPLY_BIAS_Msk (0x8000000UL) /*!< EN_RCX_SUPPLY_BIAS (Bitfield-Mask: 0x01)              */
