antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define CRG_TOP_POWER_CTRL_REG_DCDC_BOOST_CLAMP_EN_Pos (24UL)       /*!< DCDC_BOOST_CLAMP_EN (Bit 24)                          */
#define CRG_TOP_POWER_CTRL_REG_DCDC_BOOST_CLAMP_EN_Msk (0x1000000UL) /*!< DCDC_BOOST_CLAMP_EN (Bitfield-Mask: 0x01)            */
#define CRG_TOP_POWER_CTRL_REG_SW_V18F_SLEEP_ON_Pos (19UL)          /*!< SW_V18F_SLEEP_ON (Bit 19)                             */
#define CRG_TOP_POWER_CTRL_REG_SW_V18F_SLEEP_ON_Msk (0x80000UL)     /*!< SW_V18F_SLEEP_ON (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POWER_CTRL_REG_SW_V18F_ON_Pos (18UL)                /*!< SW_V18F_ON (Bit 18)                                   */
#define CRG_TOP_POWER_CTRL_REG_SW_V18F_ON_Msk (0x40000UL)           /*!< SW_V18F_ON (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_POWER_CTRL_REG_DCDC_VLED_SLEEP_EN_Pos (17UL)        /*!< DCDC_VLED_SLEEP_EN (Bit 17)                           */
#define CRG_TOP_POWER_CTRL_REG_DCDC_VLED_SLEEP_EN_Msk (0x20000UL)   /*!< DCDC_VLED_SLEEP_EN (Bitfield-Mask: 0x01)              */
#define CRG_TOP_POWER_CTRL_REG_DCDC_VLED_EN_Pos (16UL)              /*!< DCDC_VLED_EN (Bit 16)                                 */
#define CRG_TOP_POWER_CTRL_REG_DCDC_VLED_EN_Msk (0x10000UL)         /*!< DCDC_VLED_EN (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18P_SLEEP_EN_Pos (15UL)        /*!< DCDC_V18P_SLEEP_EN (Bit 15)                           */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18P_SLEEP_EN_Msk (0x8000UL)    /*!< DCDC_V18P_SLEEP_EN (Bitfield-Mask: 0x01)              */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18P_EN_Pos (14UL)              /*!< DCDC_V18P_EN (Bit 14)                                 */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18P_EN_Msk (0x4000UL)          /*!< DCDC_V18P_EN (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18_SLEEP_EN_Pos (13UL)         /*!< DCDC_V18_SLEEP_EN (Bit 13)                            */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18_SLEEP_EN_Msk (0x2000UL)     /*!< DCDC_V18_SLEEP_EN (Bitfield-Mask: 0x01)               */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18_EN_Pos (12UL)               /*!< DCDC_V18_EN (Bit 12)                                  */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V18_EN_Msk (0x1000UL)           /*!< DCDC_V18_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V14_SLEEP_EN_Pos (11UL)         /*!< DCDC_V14_SLEEP_EN (Bit 11)                            */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V14_SLEEP_EN_Msk (0x800UL)      /*!< DCDC_V14_SLEEP_EN (Bitfield-Mask: 0x01)               */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V14_EN_Pos (10UL)               /*!< DCDC_V14_EN (Bit 10)                                  */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V14_EN_Msk (0x400UL)            /*!< DCDC_V14_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V12_SLEEP_EN_Pos (9UL)          /*!< DCDC_V12_SLEEP_EN (Bit 9)                             */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V12_SLEEP_EN_Msk (0x200UL)      /*!< DCDC_V12_SLEEP_EN (Bitfield-Mask: 0x01)               */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V12_EN_Pos (8UL)                /*!< DCDC_V12_EN (Bit 8)                                   */
#define CRG_TOP_POWER_CTRL_REG_DCDC_V12_EN_Msk (0x100UL)            /*!< DCDC_V12_EN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_POWER_CTRL_REG_CLAMP_V12_DIS_Pos (7UL)              /*!< CLAMP_V12_DIS (Bit 7)                                 */
#define CRG_TOP_POWER_CTRL_REG_CLAMP_V12_DIS_Msk (0x80UL)           /*!< CLAMP_V12_DIS (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_POWER_CTRL_REG_CLAMP_V30_EN_Pos (6UL)               /*!< CLAMP_V30_EN (Bit 6)                                  */
#define CRG_TOP_POWER_CTRL_REG_CLAMP_V30_EN_Msk (0x40UL)            /*!< CLAMP_V30_EN (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_POWER_CTRL_REG_LDO_RET_V30_SLEEP_EN_Pos (4UL)       /*!< LDO_RET_V30_SLEEP_EN (Bit 4)                          */
#define CRG_TOP_POWER_CTRL_REG_LDO_RET_V30_SLEEP_EN_Msk (0x10UL)    /*!< LDO_RET_V30_SLEEP_EN (Bitfield-Mask: 0x01)            */
#define CRG_TOP_POWER_CTRL_REG_LDO_RET_V30_EN_Pos (3UL)             /*!< LDO_RET_V30_EN (Bit 3)                                */
#define CRG_TOP_POWER_CTRL_REG_LDO_RET_V30_EN_Msk (0x8UL)           /*!< LDO_RET_V30_EN (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_POWER_CTRL_REG_LDO_V30_SLEEP_EN_Pos (2UL)           /*!< LDO_V30_SLEEP_EN (Bit 2)                              */
#define CRG_TOP_POWER_CTRL_REG_LDO_V30_SLEEP_EN_Msk (0x4UL)         /*!< LDO_V30_SLEEP_EN (Bitfield-Mask: 0x01)                */
#define CRG_TOP_POWER_CTRL_REG_LDO_V30_EN_Pos (1UL)                 /*!< LDO_V30_EN (Bit 1)                                    */
#define CRG_TOP_POWER_CTRL_REG_LDO_V30_EN_Msk (0x2UL)               /*!< LDO_V30_EN (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_POWER_CTRL_REG_LDO_START_DISABLE_Pos (0UL)          /*!< LDO_START_DISABLE (Bit 0)                             */
#define CRG_TOP_POWER_CTRL_REG_LDO_START_DISABLE_Msk (0x1UL)        /*!< LDO_START_DISABLE (Bitfield-Mask: 0x01)               */
/* =====================================================  POWER_LVL_REG  ===================================================== */
#define CRG_TOP_POWER_LVL_REG_VSYS_LEVEL_Pos (17UL)                 /*!< VSYS_LEVEL (Bit 17)                                   */
#define CRG_TOP_POWER_LVL_REG_VSYS_LEVEL_Msk (0x60000UL)            /*!< VSYS_LEVEL (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_POWER_LVL_REG_V18_LEVEL_Pos (16UL)                  /*!< V18_LEVEL (Bit 16)                                    */
#define CRG_TOP_POWER_LVL_REG_V18_LEVEL_Msk (0x10000UL)             /*!< V18_LEVEL (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_POWER_LVL_REG_V14_LEVEL_Pos (14UL)                  /*!< V14_LEVEL (Bit 14)                                    */
#define CRG_TOP_POWER_LVL_REG_V14_LEVEL_Msk (0xc000UL)              /*!< V14_LEVEL (Bitfield-Mask: 0x03)                       */
#define CRG_TOP_POWER_LVL_REG_V12_SLEEP_LEVEL_Pos (12UL)            /*!< V12_SLEEP_LEVEL (Bit 12)                              */
#define CRG_TOP_POWER_LVL_REG_V12_SLEEP_LEVEL_Msk (0x3000UL)        /*!< V12_SLEEP_LEVEL (Bitfield-Mask: 0x03)                 */
#define CRG_TOP_POWER_LVL_REG_V12_LEVEL_Pos (10UL)                  /*!< V12_LEVEL (Bit 10)                                    */
#define CRG_TOP_POWER_LVL_REG_V12_LEVEL_Msk (0xc00UL)               /*!< V12_LEVEL (Bitfield-Mask: 0x03)                       */
#define CRG_TOP_POWER_LVL_REG_V30_SLEEP_LEVEL_Pos (8UL)             /*!< V30_SLEEP_LEVEL (Bit 8)                               */
#define CRG_TOP_POWER_LVL_REG_V30_SLEEP_LEVEL_Msk (0x300UL)         /*!< V30_SLEEP_LEVEL (Bitfield-Mask: 0x03)                 */
#define CRG_TOP_POWER_LVL_REG_V30_LEVEL_Pos (6UL)                   /*!< V30_LEVEL (Bit 6)                                     */
#define CRG_TOP_POWER_LVL_REG_V30_LEVEL_Msk (0xc0UL)                /*!< V30_LEVEL (Bitfield-Mask: 0x03)                       */
/* ===================================================  RAM_PWR_CTRL_REG  ==================================================== */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM13_PWR_CTRL_Pos (26UL)          /*!< RAM13_PWR_CTRL (Bit 26)                               */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM13_PWR_CTRL_Msk (0xc000000UL)   /*!< RAM13_PWR_CTRL (Bitfield-Mask: 0x03)                  */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM12_PWR_CTRL_Pos (24UL)          /*!< RAM12_PWR_CTRL (Bit 24)                               */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM12_PWR_CTRL_Msk (0x3000000UL)   /*!< RAM12_PWR_CTRL (Bitfield-Mask: 0x03)                  */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM11_PWR_CTRL_Pos (22UL)          /*!< RAM11_PWR_CTRL (Bit 22)                               */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM11_PWR_CTRL_Msk (0xc00000UL)    /*!< RAM11_PWR_CTRL (Bitfield-Mask: 0x03)                  */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM10_PWR_CTRL_Pos (20UL)          /*!< RAM10_PWR_CTRL (Bit 20)                               */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM10_PWR_CTRL_Msk (0x300000UL)    /*!< RAM10_PWR_CTRL (Bitfield-Mask: 0x03)                  */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM9_PWR_CTRL_Pos (18UL)           /*!< RAM9_PWR_CTRL (Bit 18)                                */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM9_PWR_CTRL_Msk (0xc0000UL)      /*!< RAM9_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM8_PWR_CTRL_Pos (16UL)           /*!< RAM8_PWR_CTRL (Bit 16)                                */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM8_PWR_CTRL_Msk (0x30000UL)      /*!< RAM8_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM7_PWR_CTRL_Pos (14UL)           /*!< RAM7_PWR_CTRL (Bit 14)                                */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM7_PWR_CTRL_Msk (0xc000UL)       /*!< RAM7_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM6_PWR_CTRL_Pos (12UL)           /*!< RAM6_PWR_CTRL (Bit 12)                                */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM6_PWR_CTRL_Msk (0x3000UL)       /*!< RAM6_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM5_PWR_CTRL_Pos (10UL)           /*!< RAM5_PWR_CTRL (Bit 10)                                */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM5_PWR_CTRL_Msk (0xc00UL)        /*!< RAM5_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM4_PWR_CTRL_Pos (8UL)            /*!< RAM4_PWR_CTRL (Bit 8)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM4_PWR_CTRL_Msk (0x300UL)        /*!< RAM4_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM3_PWR_CTRL_Pos (6UL)            /*!< RAM3_PWR_CTRL (Bit 6)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM3_PWR_CTRL_Msk (0xc0UL)         /*!< RAM3_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM2_PWR_CTRL_Pos (4UL)            /*!< RAM2_PWR_CTRL (Bit 4)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM2_PWR_CTRL_Msk (0x30UL)         /*!< RAM2_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM1_PWR_CTRL_Pos (2UL)            /*!< RAM1_PWR_CTRL (Bit 2)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM1_PWR_CTRL_Msk (0xcUL)          /*!< RAM1_PWR_CTRL (Bitfield-Mask: 0x03)                   */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM0_PWR_CTRL_Pos (0UL)            /*!< RAM0_PWR_CTRL (Bit 0)                                 */
#define CRG_TOP_RAM_PWR_CTRL_REG_RAM0_PWR_CTRL_Msk (0x3UL)          /*!< RAM0_PWR_CTRL (Bitfield-Mask: 0x03)                   */
/* ====================================================  RESET_STAT_REG  ===================================================== */
#define CRG_TOP_RESET_STAT_REG_SNC_WDOGRESET_STAT_Pos (6UL)         /*!< SNC_WDOGRESET_STAT (Bit 6)                            */
#define CRG_TOP_RESET_STAT_REG_SNC_WDOGRESET_STAT_Msk (0x40UL)      /*!< SNC_WDOGRESET_STAT (Bitfield-Mask: 0x01)              */
#define CRG_TOP_RESET_STAT_REG_CMAC_WDOGRESET_STAT_Pos (5UL)        /*!< CMAC_WDOGRESET_STAT (Bit 5)                           */
#define CRG_TOP_RESET_STAT_REG_CMAC_WDOGRESET_STAT_Msk (0x20UL)     /*!< CMAC_WDOGRESET_STAT (Bitfield-Mask: 0x01)             */
#define CRG_TOP_RESET_STAT_REG_SWD_HWRESET_STAT_Pos (4UL)           /*!< SWD_HWRESET_STAT (Bit 4)                              */
#define CRG_TOP_RESET_STAT_REG_SWD_HWRESET_STAT_Msk (0x10UL)        /*!< SWD_HWRESET_STAT (Bitfield-Mask: 0x01)                */
#define CRG_TOP_RESET_STAT_REG_WDOGRESET_STAT_Pos (3UL)             /*!< WDOGRESET_STAT (Bit 3)                                */
#define CRG_TOP_RESET_STAT_REG_WDOGRESET_STAT_Msk (0x8UL)           /*!< WDOGRESET_STAT (Bitfield-Mask: 0x01)                  */
#define CRG_TOP_RESET_STAT_REG_SWRESET_STAT_Pos (2UL)               /*!< SWRESET_STAT (Bit 2)                                  */
#define CRG_TOP_RESET_STAT_REG_SWRESET_STAT_Msk (0x4UL)             /*!< SWRESET_STAT (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_RESET_STAT_REG_HWRESET_STAT_Pos (1UL)               /*!< HWRESET_STAT (Bit 1)                                  */
#define CRG_TOP_RESET_STAT_REG_HWRESET_STAT_Msk (0x2UL)             /*!< HWRESET_STAT (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_RESET_STAT_REG_PORESET_STAT_Pos (0UL)               /*!< PORESET_STAT (Bit 0)                                  */
#define CRG_TOP_RESET_STAT_REG_PORESET_STAT_Msk (0x1UL)             /*!< PORESET_STAT (Bitfield-Mask: 0x01)                    */
/* =====================================================  RST_CTRL_REG  ====================================================== */
#define CRG_TOP_RST_CTRL_REG_SYS_CACHE_FLUSH_WITH_SW_RESET_Pos (0UL) /*!< SYS_CACHE_FLUSH_WITH_SW_RESET (Bit 0)                */
#define CRG_TOP_RST_CTRL_REG_SYS_CACHE_FLUSH_WITH_SW_RESET_Msk (0x1UL) /*!< SYS_CACHE_FLUSH_WITH_SW_RESET (Bitfield-Mask: 0x01) */
/* ====================================================  SECURE_BOOT_REG  ==================================================== */
#define CRG_TOP_SECURE_BOOT_REG_PROT_OTP_CS_WRITE_Pos (9UL)         /*!< PROT_OTP_CS_WRITE (Bit 9)                             */
#define CRG_TOP_SECURE_BOOT_REG_PROT_OTP_CS_WRITE_Msk (0x200UL)     /*!< PROT_OTP_CS_WRITE (Bitfield-Mask: 0x01)               */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_SNC_DEBUGGER_OFF_Pos (8UL)    /*!< FORCE_SNC_DEBUGGER_OFF (Bit 8)                        */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_SNC_DEBUGGER_OFF_Msk (0x100UL) /*!< FORCE_SNC_DEBUGGER_OFF (Bitfield-Mask: 0x01)         */
#define CRG_TOP_SECURE_BOOT_REG_PROT_OQSPIF_KEY_READ_Pos (7UL)      /*!< PROT_OQSPIF_KEY_READ (Bit 7)                          */
#define CRG_TOP_SECURE_BOOT_REG_PROT_OQSPIF_KEY_READ_Msk (0x80UL)   /*!< PROT_OQSPIF_KEY_READ (Bitfield-Mask: 0x01)            */
#define CRG_TOP_SECURE_BOOT_REG_PROT_OQSPIF_KEY_WRITE_Pos (6UL)     /*!< PROT_OQSPIF_KEY_WRITE (Bit 6)                         */
#define CRG_TOP_SECURE_BOOT_REG_PROT_OQSPIF_KEY_WRITE_Msk (0x40UL)  /*!< PROT_OQSPIF_KEY_WRITE (Bitfield-Mask: 0x01)           */
#define CRG_TOP_SECURE_BOOT_REG_PROT_AES_KEY_READ_Pos (5UL)         /*!< PROT_AES_KEY_READ (Bit 5)                             */
#define CRG_TOP_SECURE_BOOT_REG_PROT_AES_KEY_READ_Msk (0x20UL)      /*!< PROT_AES_KEY_READ (Bitfield-Mask: 0x01)               */
#define CRG_TOP_SECURE_BOOT_REG_PROT_AES_KEY_WRITE_Pos (4UL)        /*!< PROT_AES_KEY_WRITE (Bit 4)                            */
#define CRG_TOP_SECURE_BOOT_REG_PROT_AES_KEY_WRITE_Msk (0x10UL)     /*!< PROT_AES_KEY_WRITE (Bitfield-Mask: 0x01)              */
#define CRG_TOP_SECURE_BOOT_REG_PROT_SIG_KEY_WRITE_Pos (3UL)        /*!< PROT_SIG_KEY_WRITE (Bit 3)                            */
#define CRG_TOP_SECURE_BOOT_REG_PROT_SIG_KEY_WRITE_Msk (0x8UL)      /*!< PROT_SIG_KEY_WRITE (Bitfield-Mask: 0x01)              */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_CMAC_DEBUGGER_OFF_Pos (2UL)   /*!< FORCE_CMAC_DEBUGGER_OFF (Bit 2)                       */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_CMAC_DEBUGGER_OFF_Msk (0x4UL) /*!< FORCE_CMAC_DEBUGGER_OFF (Bitfield-Mask: 0x01)         */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_DEBUGGER_OFF_Pos (1UL)        /*!< FORCE_DEBUGGER_OFF (Bit 1)                            */
#define CRG_TOP_SECURE_BOOT_REG_FORCE_DEBUGGER_OFF_Msk (0x2UL)      /*!< FORCE_DEBUGGER_OFF (Bitfield-Mask: 0x01)              */
#define CRG_TOP_SECURE_BOOT_REG_SECURE_BOOT_Pos (0UL)               /*!< SECURE_BOOT (Bit 0)                                   */
#define CRG_TOP_SECURE_BOOT_REG_SECURE_BOOT_Msk (0x1UL)             /*!< SECURE_BOOT (Bitfield-Mask: 0x01)                     */
/* ======================================================  SLP_MAP_REG  ====================================================== */
#define CRG_TOP_SLP_MAP_REG_LCD_INV_EXT_CLK_SLP_MAP_Pos (8UL)       /*!< LCD_INV_EXT_CLK_SLP_MAP (Bit 8)                       */
#define CRG_TOP_SLP_MAP_REG_LCD_INV_EXT_CLK_SLP_MAP_Msk (0x100UL)   /*!< LCD_INV_EXT_CLK_SLP_MAP (Bitfield-Mask: 0x01)         */
#define CRG_TOP_SLP_MAP_REG_LCD_EXT_CLK_SLP_MAP_Pos (7UL)           /*!< LCD_EXT_CLK_SLP_MAP (Bit 7)                           */
#define CRG_TOP_SLP_MAP_REG_LCD_EXT_CLK_SLP_MAP_Msk (0x80UL)        /*!< LCD_EXT_CLK_SLP_MAP (Bitfield-Mask: 0x01)             */
#define CRG_TOP_SLP_MAP_REG_BANDGAP_SLP_MAP_Pos (6UL)               /*!< BANDGAP_SLP_MAP (Bit 6)                               */
#define CRG_TOP_SLP_MAP_REG_BANDGAP_SLP_MAP_Msk (0x40UL)            /*!< BANDGAP_SLP_MAP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_SLP_MAP_REG_RCLP_SLP_MAP_Pos (5UL)                  /*!< RCLP_SLP_MAP (Bit 5)                                  */
#define CRG_TOP_SLP_MAP_REG_RCLP_SLP_MAP_Msk (0x20UL)               /*!< RCLP_SLP_MAP (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_SLP_MAP_REG_XTAL32K_SLP_MAP_Pos (4UL)               /*!< XTAL32K_SLP_MAP (Bit 4)                               */
#define CRG_TOP_SLP_MAP_REG_XTAL32K_SLP_MAP_Msk (0x10UL)            /*!< XTAL32K_SLP_MAP (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_SLP_MAP_REG_RCX_SLP_MAP_Pos (3UL)                   /*!< RCX_SLP_MAP (Bit 3)                                   */
#define CRG_TOP_SLP_MAP_REG_RCX_SLP_MAP_Msk (0x8UL)                 /*!< RCX_SLP_MAP (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SLP_MAP_REG_TMR4_PWM_SLP_MAP_Pos (2UL)              /*!< TMR4_PWM_SLP_MAP (Bit 2)                              */
#define CRG_TOP_SLP_MAP_REG_TMR4_PWM_SLP_MAP_Msk (0x4UL)            /*!< TMR4_PWM_SLP_MAP (Bitfield-Mask: 0x01)                */
#define CRG_TOP_SLP_MAP_REG_TMR3_PWM_SLP_MAP_Pos (1UL)              /*!< TMR3_PWM_SLP_MAP (Bit 1)                              */
#define CRG_TOP_SLP_MAP_REG_TMR3_PWM_SLP_MAP_Msk (0x2UL)            /*!< TMR3_PWM_SLP_MAP (Bitfield-Mask: 0x01)                */
#define CRG_TOP_SLP_MAP_REG_TMR_PWM_SLP_MAP_Pos (0UL)               /*!< TMR_PWM_SLP_MAP (Bit 0)                               */
#define CRG_TOP_SLP_MAP_REG_TMR_PWM_SLP_MAP_Msk (0x1UL)             /*!< TMR_PWM_SLP_MAP (Bitfield-Mask: 0x01)                 */
/* ======================================================  SW_V18F_REG  ====================================================== */
#define CRG_TOP_SW_V18F_REG_DELAY_TRIM_Pos (2UL)                    /*!< DELAY_TRIM (Bit 2)                                    */
#define CRG_TOP_SW_V18F_REG_DELAY_TRIM_Msk (0xcUL)                  /*!< DELAY_TRIM (Bitfield-Mask: 0x03)                      */
#define CRG_TOP_SW_V18F_REG_SKIP_SOFT_START_Pos (1UL)               /*!< SKIP_SOFT_START (Bit 1)                               */
#define CRG_TOP_SW_V18F_REG_SKIP_SOFT_START_Msk (0x2UL)             /*!< SKIP_SOFT_START (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_SW_V18F_REG_FORCE_SW_ON_Pos (0UL)                   /*!< FORCE_SW_ON (Bit 0)                                   */
#define CRG_TOP_SW_V18F_REG_FORCE_SW_ON_Msk (0x1UL)                 /*!< FORCE_SW_ON (Bitfield-Mask: 0x01)                     */
/* =====================================================  SYS_CTRL_REG  ====================================================== */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Pos (15UL)                    /*!< SW_RESET (Bit 15)                                     */
#define CRG_TOP_SYS_CTRL_REG_SW_RESET_Msk (0x8000UL)                /*!< SW_RESET (Bitfield-Mask: 0x01)                        */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Pos (10UL)                /*!< CACHERAM_MUX (Bit 10)                                 */
#define CRG_TOP_SYS_CTRL_REG_CACHERAM_MUX_Msk (0x400UL)             /*!< CACHERAM_MUX (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_SYS_CTRL_REG_TIMEOUT_DISABLE_Pos (9UL)              /*!< TIMEOUT_DISABLE (Bit 9)                               */
#define CRG_TOP_SYS_CTRL_REG_TIMEOUT_DISABLE_Msk (0x200UL)          /*!< TIMEOUT_DISABLE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Pos (7UL)              /*!< DEBUGGER_ENABLE (Bit 7)                               */
#define CRG_TOP_SYS_CTRL_REG_DEBUGGER_ENABLE_Msk (0x80UL)           /*!< DEBUGGER_ENABLE (Bitfield-Mask: 0x01)                 */
#define CRG_TOP_SYS_CTRL_REG_SNC_DEBUGGER_ENABLE_Pos (5UL)          /*!< SNC_DEBUGGER_ENABLE (Bit 5)                           */
#define CRG_TOP_SYS_CTRL_REG_SNC_DEBUGGER_ENABLE_Msk (0x20UL)       /*!< SNC_DEBUGGER_ENABLE (Bitfield-Mask: 0x01)             */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Pos (3UL)                /*!< REMAP_INTVECT (Bit 3)                                 */
#define CRG_TOP_SYS_CTRL_REG_REMAP_INTVECT_Msk (0x8UL)              /*!< REMAP_INTVECT (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Pos (0UL)                   /*!< REMAP_ADR0 (Bit 0)                                    */
#define CRG_TOP_SYS_CTRL_REG_REMAP_ADR0_Msk (0x7UL)                 /*!< REMAP_ADR0 (Bitfield-Mask: 0x07)                      */
/* =====================================================  SYS_STAT_REG  ====================================================== */
#define CRG_TOP_SYS_STAT_REG_GPU_IS_UP_Pos (17UL)                   /*!< GPU_IS_UP (Bit 17)                                    */
#define CRG_TOP_SYS_STAT_REG_GPU_IS_UP_Msk (0x20000UL)              /*!< GPU_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_GPU_IS_DOWN_Pos (16UL)                 /*!< GPU_IS_DOWN (Bit 16)                                  */
#define CRG_TOP_SYS_STAT_REG_GPU_IS_DOWN_Msk (0x10000UL)            /*!< GPU_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_CTRL_IS_UP_Pos (15UL)                  /*!< CTRL_IS_UP (Bit 15)                                   */
#define CRG_TOP_SYS_STAT_REG_CTRL_IS_UP_Msk (0x8000UL)              /*!< CTRL_IS_UP (Bitfield-Mask: 0x01)                      */
#define CRG_TOP_SYS_STAT_REG_CTRL_IS_DOWN_Pos (14UL)                /*!< CTRL_IS_DOWN (Bit 14)                                 */
#define CRG_TOP_SYS_STAT_REG_CTRL_IS_DOWN_Msk (0x4000UL)            /*!< CTRL_IS_DOWN (Bitfield-Mask: 0x01)                    */
#define CRG_TOP_SYS_STAT_REG_POWER_IS_UP_Pos (13UL)                 /*!< POWER_IS_UP (Bit 13)                                  */
#define CRG_TOP_SYS_STAT_REG_POWER_IS_UP_Msk (0x2000UL)             /*!< POWER_IS_UP (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Pos (12UL)               /*!< DBG_IS_ACTIVE (Bit 12)                                */
#define CRG_TOP_SYS_STAT_REG_DBG_IS_ACTIVE_Msk (0x1000UL)           /*!< DBG_IS_ACTIVE (Bitfield-Mask: 0x01)                   */
#define CRG_TOP_SYS_STAT_REG_SNC_IS_UP_Pos (11UL)                   /*!< SNC_IS_UP (Bit 11)                                    */
#define CRG_TOP_SYS_STAT_REG_SNC_IS_UP_Msk (0x800UL)                /*!< SNC_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_SNC_IS_DOWN_Pos (10UL)                 /*!< SNC_IS_DOWN (Bit 10)                                  */
#define CRG_TOP_SYS_STAT_REG_SNC_IS_DOWN_Msk (0x400UL)              /*!< SNC_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_UP_Pos (9UL)                    /*!< TIM_IS_UP (Bit 9)                                     */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_UP_Msk (0x200UL)                /*!< TIM_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_TIM_IS_DOWN_Pos (8UL)                  /*!< TIM_IS_DOWN (Bit 8)                                   */
