antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define CRG_TOP_SYS_STAT_REG_TIM_IS_DOWN_Msk (0x100UL)              /*!< TIM_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_UP_Pos (7UL)                    /*!< MEM_IS_UP (Bit 7)                                     */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_UP_Msk (0x80UL)                 /*!< MEM_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_DOWN_Pos (6UL)                  /*!< MEM_IS_DOWN (Bit 6)                                   */
#define CRG_TOP_SYS_STAT_REG_MEM_IS_DOWN_Msk (0x40UL)               /*!< MEM_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_UP_Pos (5UL)                    /*!< SYS_IS_UP (Bit 5)                                     */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_UP_Msk (0x20UL)                 /*!< SYS_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_DOWN_Pos (4UL)                  /*!< SYS_IS_DOWN (Bit 4)                                   */
#define CRG_TOP_SYS_STAT_REG_SYS_IS_DOWN_Msk (0x10UL)               /*!< SYS_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_UP_Pos (3UL)                    /*!< AUD_IS_UP (Bit 3)                                     */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_UP_Msk (0x8UL)                  /*!< AUD_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_DOWN_Pos (2UL)                  /*!< AUD_IS_DOWN (Bit 2)                                   */
#define CRG_TOP_SYS_STAT_REG_AUD_IS_DOWN_Msk (0x4UL)                /*!< AUD_IS_DOWN (Bitfield-Mask: 0x01)                     */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Pos (1UL)                    /*!< RAD_IS_UP (Bit 1)                                     */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_UP_Msk (0x2UL)                  /*!< RAD_IS_UP (Bitfield-Mask: 0x01)                       */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Pos (0UL)                  /*!< RAD_IS_DOWN (Bit 0)                                   */
#define CRG_TOP_SYS_STAT_REG_RAD_IS_DOWN_Msk (0x1UL)                /*!< RAD_IS_DOWN (Bitfield-Mask: 0x01)                     */
/* ==================================================  VBUS_IRQ_CLEAR_REG  =================================================== */
#define CRG_TOP_VBUS_IRQ_CLEAR_REG_VBUS_IRQ_CLEAR_Pos (0UL)         /*!< VBUS_IRQ_CLEAR (Bit 0)                                */
#define CRG_TOP_VBUS_IRQ_CLEAR_REG_VBUS_IRQ_CLEAR_Msk (0xffffUL)    /*!< VBUS_IRQ_CLEAR (Bitfield-Mask: 0xffff)                */
/* ===================================================  VBUS_IRQ_MASK_REG  =================================================== */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_RISE_Pos (1UL)        /*!< VBUS_IRQ_EN_RISE (Bit 1)                              */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_RISE_Msk (0x2UL)      /*!< VBUS_IRQ_EN_RISE (Bitfield-Mask: 0x01)                */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_FALL_Pos (0UL)        /*!< VBUS_IRQ_EN_FALL (Bit 0)                              */
#define CRG_TOP_VBUS_IRQ_MASK_REG_VBUS_IRQ_EN_FALL_Msk (0x1UL)      /*!< VBUS_IRQ_EN_FALL (Bitfield-Mask: 0x01)                */
/* ===================================================  WAKEUP_HIBERN_REG  =================================================== */
#define CRG_TOP_WAKEUP_HIBERN_REG_HIBERNATION_ENABLE_Pos (12UL)     /*!< HIBERNATION_ENABLE (Bit 12)                           */
#define CRG_TOP_WAKEUP_HIBERN_REG_HIBERNATION_ENABLE_Msk (0x1000UL) /*!< HIBERNATION_ENABLE (Bitfield-Mask: 0x01)              */
#define CRG_TOP_WAKEUP_HIBERN_REG_WAKEUP_PD_EN_Pos (6UL)            /*!< WAKEUP_PD_EN (Bit 6)                                  */
#define CRG_TOP_WAKEUP_HIBERN_REG_WAKEUP_PD_EN_Msk (0x3c0UL)        /*!< WAKEUP_PD_EN (Bitfield-Mask: 0x0f)                    */
#define CRG_TOP_WAKEUP_HIBERN_REG_WAKEUP_EN_Pos (0UL)               /*!< WAKEUP_EN (Bit 0)                                     */
#define CRG_TOP_WAKEUP_HIBERN_REG_WAKEUP_EN_Msk (0xfUL)             /*!< WAKEUP_EN (Bitfield-Mask: 0x0f)                       */


/* =========================================================================================================================== */
/* ================                                         CRG_VSYS                                          ================ */
/* =========================================================================================================================== */

/* ===================================================  VSYS_GEN_CTRL_REG  =================================================== */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_FORCE_VBAT_VSYS_SW_Pos (23UL)    /*!< FORCE_VBAT_VSYS_SW (Bit 23)                           */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_FORCE_VBAT_VSYS_SW_Msk (0x1800000UL) /*!< FORCE_VBAT_VSYS_SW (Bitfield-Mask: 0x03)          */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_FORCE_LDO_ENABLE_Pos (21UL)      /*!< FORCE_LDO_ENABLE (Bit 21)                             */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_FORCE_LDO_ENABLE_Msk (0x600000UL) /*!< FORCE_LDO_ENABLE (Bitfield-Mask: 0x03)               */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_LDO_TEMP_PROTECT_MODE_Pos (19UL) /*!< LDO_TEMP_PROTECT_MODE (Bit 19)                        */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_LDO_TEMP_PROTECT_MODE_Msk (0x180000UL) /*!< LDO_TEMP_PROTECT_MODE (Bitfield-Mask: 0x03)     */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_EN_HEADROOM_Pos (18UL)           /*!< EN_HEADROOM (Bit 18)                                  */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_EN_HEADROOM_Msk (0x40000UL)      /*!< EN_HEADROOM (Bitfield-Mask: 0x01)                     */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_CURLIM_OFFSET_TRIM_Pos (13UL)    /*!< CURLIM_OFFSET_TRIM (Bit 13)                           */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_CURLIM_OFFSET_TRIM_Msk (0x3e000UL) /*!< CURLIM_OFFSET_TRIM (Bitfield-Mask: 0x1f)            */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_CURLIM_GAIN_TRIM_Pos (8UL)       /*!< CURLIM_GAIN_TRIM (Bit 8)                              */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_CURLIM_GAIN_TRIM_Msk (0x1f00UL)  /*!< CURLIM_GAIN_TRIM (Bitfield-Mask: 0x1f)                */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_CURLIM_SET_Pos (1UL)             /*!< CURLIM_SET (Bit 1)                                    */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_CURLIM_SET_Msk (0xfeUL)          /*!< CURLIM_SET (Bitfield-Mask: 0x7f)                      */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_EN_CURLIM_Pos (0UL)              /*!< EN_CURLIM (Bit 0)                                     */
#define CRG_VSYS_VSYS_GEN_CTRL_REG_EN_CURLIM_Msk (0x1UL)            /*!< EN_CURLIM (Bitfield-Mask: 0x01)                       */
/* ================================================  VSYS_GEN_IRQ_CLEAR_REG  ================================================= */
#define CRG_VSYS_VSYS_GEN_IRQ_CLEAR_REG_VBUS_LOW_DRIVE_IRQ_CLEAR_Pos (1UL) /*!< VBUS_LOW_DRIVE_IRQ_CLEAR (Bit 1)               */
#define CRG_VSYS_VSYS_GEN_IRQ_CLEAR_REG_VBUS_LOW_DRIVE_IRQ_CLEAR_Msk (0x2UL) /*!< VBUS_LOW_DRIVE_IRQ_CLEAR (Bitfield-Mask: 0x01) */
#define CRG_VSYS_VSYS_GEN_IRQ_CLEAR_REG_LDO_VSYS_HIGH_TEMP_IRQ_CLEAR_Pos (0UL) /*!< LDO_VSYS_HIGH_TEMP_IRQ_CLEAR (Bit 0)       */
#define CRG_VSYS_VSYS_GEN_IRQ_CLEAR_REG_LDO_VSYS_HIGH_TEMP_IRQ_CLEAR_Msk (0x1UL) /*!< LDO_VSYS_HIGH_TEMP_IRQ_CLEAR (Bitfield-Mask: 0x01) */
/* =================================================  VSYS_GEN_IRQ_MASK_REG  ================================================= */
#define CRG_VSYS_VSYS_GEN_IRQ_MASK_REG_VBUS_LOW_DRIVE_IRQ_MASK_Pos (1UL) /*!< VBUS_LOW_DRIVE_IRQ_MASK (Bit 1)                  */
#define CRG_VSYS_VSYS_GEN_IRQ_MASK_REG_VBUS_LOW_DRIVE_IRQ_MASK_Msk (0x2UL) /*!< VBUS_LOW_DRIVE_IRQ_MASK (Bitfield-Mask: 0x01)  */
#define CRG_VSYS_VSYS_GEN_IRQ_MASK_REG_LDO_VSYS_HIGH_TEMP_IRQ_MASK_Pos (0UL) /*!< LDO_VSYS_HIGH_TEMP_IRQ_MASK (Bit 0)          */
#define CRG_VSYS_VSYS_GEN_IRQ_MASK_REG_LDO_VSYS_HIGH_TEMP_IRQ_MASK_Msk (0x1UL) /*!< LDO_VSYS_HIGH_TEMP_IRQ_MASK (Bitfield-Mask: 0x01) */
/* ================================================  VSYS_GEN_IRQ_STATUS_REG  ================================================ */
#define CRG_VSYS_VSYS_GEN_IRQ_STATUS_REG_VBUS_LOW_DRIVE_IRQ_STATUS_Pos (1UL) /*!< VBUS_LOW_DRIVE_IRQ_STATUS (Bit 1)            */
#define CRG_VSYS_VSYS_GEN_IRQ_STATUS_REG_VBUS_LOW_DRIVE_IRQ_STATUS_Msk (0x2UL) /*!< VBUS_LOW_DRIVE_IRQ_STATUS (Bitfield-Mask: 0x01) */
#define CRG_VSYS_VSYS_GEN_IRQ_STATUS_REG_LDO_VSYS_HIGH_TEMP_IRQ_STATUS_Pos (0UL) /*!< LDO_VSYS_HIGH_TEMP_IRQ_STATUS (Bit 0)    */
#define CRG_VSYS_VSYS_GEN_IRQ_STATUS_REG_LDO_VSYS_HIGH_TEMP_IRQ_STATUS_Msk (0x1UL) /*!< LDO_VSYS_HIGH_TEMP_IRQ_STATUS (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                         CRG_XTAL                                          ================ */
/* =========================================================================================================================== */

