antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ===================================================  PLL_SYS_CTRL1_REG  =================================================== */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_OUT_DIV_Pos (15UL)           /*!< PLL_OUT_DIV (Bit 15)                                  */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_OUT_DIV_Msk (0x8000UL)       /*!< PLL_OUT_DIV (Bitfield-Mask: 0x01)                     */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_SEL_MIN_CUR_INT_Pos (14UL)   /*!< PLL_SEL_MIN_CUR_INT (Bit 14)                          */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_SEL_MIN_CUR_INT_Msk (0x4000UL) /*!< PLL_SEL_MIN_CUR_INT (Bitfield-Mask: 0x01)           */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_PRE_DIV_Pos (11UL)           /*!< PLL_PRE_DIV (Bit 11)                                  */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_PRE_DIV_Msk (0x800UL)        /*!< PLL_PRE_DIV (Bitfield-Mask: 0x01)                     */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_N_DIV_Pos (4UL)              /*!< PLL_N_DIV (Bit 4)                                     */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_N_DIV_Msk (0x7f0UL)          /*!< PLL_N_DIV (Bitfield-Mask: 0x7f)                       */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_LDO_PLL_VREF_HOLD_Pos (3UL)      /*!< LDO_PLL_VREF_HOLD (Bit 3)                             */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_LDO_PLL_VREF_HOLD_Msk (0x8UL)    /*!< LDO_PLL_VREF_HOLD (Bitfield-Mask: 0x01)               */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_LDO_PLL_ENABLE_Pos (2UL)         /*!< LDO_PLL_ENABLE (Bit 2)                                */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_LDO_PLL_ENABLE_Msk (0x4UL)       /*!< LDO_PLL_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_RST_N_Pos (1UL)              /*!< PLL_RST_N (Bit 1)                                     */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_RST_N_Msk (0x2UL)            /*!< PLL_RST_N (Bitfield-Mask: 0x01)                       */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_EN_Pos (0UL)                 /*!< PLL_EN (Bit 0)                                        */
#define CRG_XTAL_PLL_SYS_CTRL1_REG_PLL_EN_Msk (0x1UL)               /*!< PLL_EN (Bitfield-Mask: 0x01)                          */
/* ===================================================  PLL_SYS_CTRL2_REG  =================================================== */
#define CRG_XTAL_PLL_SYS_CTRL2_REG_PLL_RECALIB_Pos (15UL)           /*!< PLL_RECALIB (Bit 15)                                  */
#define CRG_XTAL_PLL_SYS_CTRL2_REG_PLL_RECALIB_Msk (0x8000UL)       /*!< PLL_RECALIB (Bitfield-Mask: 0x01)                     */
/* ===================================================  PLL_SYS_CTRL3_REG  =================================================== */
#define CRG_XTAL_PLL_SYS_CTRL3_REG_PLL_MIN_CURRENT_Pos (1UL)        /*!< PLL_MIN_CURRENT (Bit 1)                               */
#define CRG_XTAL_PLL_SYS_CTRL3_REG_PLL_MIN_CURRENT_Msk (0x7eUL)     /*!< PLL_MIN_CURRENT (Bitfield-Mask: 0x3f)                 */
/* ==================================================  PLL_SYS_STATUS_REG  =================================================== */
#define CRG_XTAL_PLL_SYS_STATUS_REG_LDO_PLL_OK_Pos (15UL)           /*!< LDO_PLL_OK (Bit 15)                                   */
#define CRG_XTAL_PLL_SYS_STATUS_REG_LDO_PLL_OK_Msk (0x8000UL)       /*!< LDO_PLL_OK (Bitfield-Mask: 0x01)                      */
#define CRG_XTAL_PLL_SYS_STATUS_REG_PLL_CALIBRATION_END_Pos (11UL)  /*!< PLL_CALIBRATION_END (Bit 11)                          */
#define CRG_XTAL_PLL_SYS_STATUS_REG_PLL_CALIBRATION_END_Msk (0x800UL) /*!< PLL_CALIBRATION_END (Bitfield-Mask: 0x01)           */
#define CRG_XTAL_PLL_SYS_STATUS_REG_PLL_BEST_MIN_CUR_Pos (5UL)      /*!< PLL_BEST_MIN_CUR (Bit 5)                              */
#define CRG_XTAL_PLL_SYS_STATUS_REG_PLL_BEST_MIN_CUR_Msk (0x7e0UL)  /*!< PLL_BEST_MIN_CUR (Bitfield-Mask: 0x3f)                */
#define CRG_XTAL_PLL_SYS_STATUS_REG_PLL_LOCK_FINE_Pos (0UL)         /*!< PLL_LOCK_FINE (Bit 0)                                 */
#define CRG_XTAL_PLL_SYS_STATUS_REG_PLL_LOCK_FINE_Msk (0x1UL)       /*!< PLL_LOCK_FINE (Bitfield-Mask: 0x01)                   */
/* ===================================================  PLL_USB_CTRL1_REG  =================================================== */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_OUT_DIV_Pos (15UL)           /*!< PLL_OUT_DIV (Bit 15)                                  */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_OUT_DIV_Msk (0x8000UL)       /*!< PLL_OUT_DIV (Bitfield-Mask: 0x01)                     */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_SEL_MIN_CUR_INT_Pos (14UL)   /*!< PLL_SEL_MIN_CUR_INT (Bit 14)                          */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_SEL_MIN_CUR_INT_Msk (0x4000UL) /*!< PLL_SEL_MIN_CUR_INT (Bitfield-Mask: 0x01)           */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_PRE_DIV_Pos (11UL)           /*!< PLL_PRE_DIV (Bit 11)                                  */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_PRE_DIV_Msk (0x800UL)        /*!< PLL_PRE_DIV (Bitfield-Mask: 0x01)                     */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_N_DIV_Pos (4UL)              /*!< PLL_N_DIV (Bit 4)                                     */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_N_DIV_Msk (0x7f0UL)          /*!< PLL_N_DIV (Bitfield-Mask: 0x7f)                       */
#define CRG_XTAL_PLL_USB_CTRL1_REG_LDO_PLL_VREF_HOLD_Pos (3UL)      /*!< LDO_PLL_VREF_HOLD (Bit 3)                             */
#define CRG_XTAL_PLL_USB_CTRL1_REG_LDO_PLL_VREF_HOLD_Msk (0x8UL)    /*!< LDO_PLL_VREF_HOLD (Bitfield-Mask: 0x01)               */
#define CRG_XTAL_PLL_USB_CTRL1_REG_LDO_PLL_ENABLE_Pos (2UL)         /*!< LDO_PLL_ENABLE (Bit 2)                                */
#define CRG_XTAL_PLL_USB_CTRL1_REG_LDO_PLL_ENABLE_Msk (0x4UL)       /*!< LDO_PLL_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_RST_N_Pos (1UL)              /*!< PLL_RST_N (Bit 1)                                     */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_RST_N_Msk (0x2UL)            /*!< PLL_RST_N (Bitfield-Mask: 0x01)                       */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_EN_Pos (0UL)                 /*!< PLL_EN (Bit 0)                                        */
#define CRG_XTAL_PLL_USB_CTRL1_REG_PLL_EN_Msk (0x1UL)               /*!< PLL_EN (Bitfield-Mask: 0x01)                          */
/* ===================================================  PLL_USB_CTRL2_REG  =================================================== */
#define CRG_XTAL_PLL_USB_CTRL2_REG_PLL_RECALIB_Pos (15UL)           /*!< PLL_RECALIB (Bit 15)                                  */
#define CRG_XTAL_PLL_USB_CTRL2_REG_PLL_RECALIB_Msk (0x8000UL)       /*!< PLL_RECALIB (Bitfield-Mask: 0x01)                     */
/* ===================================================  PLL_USB_CTRL3_REG  =================================================== */
#define CRG_XTAL_PLL_USB_CTRL3_REG_PLL_MIN_CURRENT_Pos (1UL)        /*!< PLL_MIN_CURRENT (Bit 1)                               */
#define CRG_XTAL_PLL_USB_CTRL3_REG_PLL_MIN_CURRENT_Msk (0x7eUL)     /*!< PLL_MIN_CURRENT (Bitfield-Mask: 0x3f)                 */
/* ==================================================  PLL_USB_STATUS_REG  =================================================== */
#define CRG_XTAL_PLL_USB_STATUS_REG_LDO_PLL_OK_Pos (15UL)           /*!< LDO_PLL_OK (Bit 15)                                   */
#define CRG_XTAL_PLL_USB_STATUS_REG_LDO_PLL_OK_Msk (0x8000UL)       /*!< LDO_PLL_OK (Bitfield-Mask: 0x01)                      */
#define CRG_XTAL_PLL_USB_STATUS_REG_PLL_CALIBRATION_END_Pos (11UL)  /*!< PLL_CALIBRATION_END (Bit 11)                          */
#define CRG_XTAL_PLL_USB_STATUS_REG_PLL_CALIBRATION_END_Msk (0x800UL) /*!< PLL_CALIBRATION_END (Bitfield-Mask: 0x01)           */
#define CRG_XTAL_PLL_USB_STATUS_REG_PLL_BEST_MIN_CUR_Pos (5UL)      /*!< PLL_BEST_MIN_CUR (Bit 5)                              */
#define CRG_XTAL_PLL_USB_STATUS_REG_PLL_BEST_MIN_CUR_Msk (0x7e0UL)  /*!< PLL_BEST_MIN_CUR (Bitfield-Mask: 0x3f)                */
#define CRG_XTAL_PLL_USB_STATUS_REG_PLL_LOCK_FINE_Pos (0UL)         /*!< PLL_LOCK_FINE (Bit 0)                                 */
#define CRG_XTAL_PLL_USB_STATUS_REG_PLL_LOCK_FINE_Msk (0x1UL)       /*!< PLL_LOCK_FINE (Bitfield-Mask: 0x01)                   */
/* ================================================  RESET_SYS_IRQ_CTRL_REG  ================================================= */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_CMAC2SNC_IRQ_BIT_Pos (5UL)  /*!< CMAC2SNC_IRQ_BIT (Bit 5)                              */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_CMAC2SNC_IRQ_BIT_Msk (0x20UL) /*!< CMAC2SNC_IRQ_BIT (Bitfield-Mask: 0x01)              */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_CMAC2SYS_IRQ_BIT_Pos (4UL)  /*!< CMAC2SYS_IRQ_BIT (Bit 4)                              */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_CMAC2SYS_IRQ_BIT_Msk (0x10UL) /*!< CMAC2SYS_IRQ_BIT (Bitfield-Mask: 0x01)              */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SNC2SYS_IRQ_BIT_Pos (3UL)   /*!< SNC2SYS_IRQ_BIT (Bit 3)                               */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SNC2SYS_IRQ_BIT_Msk (0x8UL) /*!< SNC2SYS_IRQ_BIT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SNC2CMAC_IRQ_BIT_Pos (2UL)  /*!< SNC2CMAC_IRQ_BIT (Bit 2)                              */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SNC2CMAC_IRQ_BIT_Msk (0x4UL) /*!< SNC2CMAC_IRQ_BIT (Bitfield-Mask: 0x01)               */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SYS2SNC_IRQ_BIT_Pos (1UL)   /*!< SYS2SNC_IRQ_BIT (Bit 1)                               */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SYS2SNC_IRQ_BIT_Msk (0x2UL) /*!< SYS2SNC_IRQ_BIT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SYS2CMAC_IRQ_BIT_Pos (0UL)  /*!< SYS2CMAC_IRQ_BIT (Bit 0)                              */
#define CRG_XTAL_RESET_SYS_IRQ_CTRL_REG_SYS2CMAC_IRQ_BIT_Msk (0x1UL) /*!< SYS2CMAC_IRQ_BIT (Bitfield-Mask: 0x01)               */
/* =================================================  SET_SYS_IRQ_CTRL_REG  ================================================== */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_CMAC2SNC_IRQ_BIT_Pos (5UL)    /*!< CMAC2SNC_IRQ_BIT (Bit 5)                              */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_CMAC2SNC_IRQ_BIT_Msk (0x20UL) /*!< CMAC2SNC_IRQ_BIT (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_CMAC2SYS_IRQ_BIT_Pos (4UL)    /*!< CMAC2SYS_IRQ_BIT (Bit 4)                              */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_CMAC2SYS_IRQ_BIT_Msk (0x10UL) /*!< CMAC2SYS_IRQ_BIT (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SNC2SYS_IRQ_BIT_Pos (3UL)     /*!< SNC2SYS_IRQ_BIT (Bit 3)                               */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SNC2SYS_IRQ_BIT_Msk (0x8UL)   /*!< SNC2SYS_IRQ_BIT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SNC2CMAC_IRQ_BIT_Pos (2UL)    /*!< SNC2CMAC_IRQ_BIT (Bit 2)                              */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SNC2CMAC_IRQ_BIT_Msk (0x4UL)  /*!< SNC2CMAC_IRQ_BIT (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SYS2SNC_IRQ_BIT_Pos (1UL)     /*!< SYS2SNC_IRQ_BIT (Bit 1)                               */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SYS2SNC_IRQ_BIT_Msk (0x2UL)   /*!< SYS2SNC_IRQ_BIT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SYS2CMAC_IRQ_BIT_Pos (0UL)    /*!< SYS2CMAC_IRQ_BIT (Bit 0)                              */
#define CRG_XTAL_SET_SYS_IRQ_CTRL_REG_SYS2CMAC_IRQ_BIT_Msk (0x1UL)  /*!< SYS2CMAC_IRQ_BIT (Bitfield-Mask: 0x01)                */
/* ===================================================  SYS_IRQ_CTRL_REG  ==================================================== */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_CMAC2SNC_IRQ_BIT_Pos (5UL)        /*!< CMAC2SNC_IRQ_BIT (Bit 5)                              */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_CMAC2SNC_IRQ_BIT_Msk (0x20UL)     /*!< CMAC2SNC_IRQ_BIT (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_CMAC2SYS_IRQ_BIT_Pos (4UL)        /*!< CMAC2SYS_IRQ_BIT (Bit 4)                              */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_CMAC2SYS_IRQ_BIT_Msk (0x10UL)     /*!< CMAC2SYS_IRQ_BIT (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SNC2SYS_IRQ_BIT_Pos (3UL)         /*!< SNC2SYS_IRQ_BIT (Bit 3)                               */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SNC2SYS_IRQ_BIT_Msk (0x8UL)       /*!< SNC2SYS_IRQ_BIT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SNC2CMAC_IRQ_BIT_Pos (2UL)        /*!< SNC2CMAC_IRQ_BIT (Bit 2)                              */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SNC2CMAC_IRQ_BIT_Msk (0x4UL)      /*!< SNC2CMAC_IRQ_BIT (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SYS2SNC_IRQ_BIT_Pos (1UL)         /*!< SYS2SNC_IRQ_BIT (Bit 1)                               */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SYS2SNC_IRQ_BIT_Msk (0x2UL)       /*!< SYS2SNC_IRQ_BIT (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SYS2CMAC_IRQ_BIT_Pos (0UL)        /*!< SYS2CMAC_IRQ_BIT (Bit 0)                              */
#define CRG_XTAL_SYS_IRQ_CTRL_REG_SYS2CMAC_IRQ_BIT_Msk (0x1UL)      /*!< SYS2CMAC_IRQ_BIT (Bitfield-Mask: 0x01)                */
/* =================================================  XTAL32M_CAP_MEAS_REG  ================================================== */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_TIME_Pos (6UL)   /*!< XTAL32M_MEAS_TIME (Bit 6)                             */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_TIME_Msk (0x1c0UL) /*!< XTAL32M_MEAS_TIME (Bitfield-Mask: 0x07)             */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_START_Pos (5UL)  /*!< XTAL32M_MEAS_START (Bit 5)                            */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_START_Msk (0x20UL) /*!< XTAL32M_MEAS_START (Bitfield-Mask: 0x01)            */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_CUR_Pos (3UL)    /*!< XTAL32M_MEAS_CUR (Bit 3)                              */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_MEAS_CUR_Msk (0x18UL) /*!< XTAL32M_MEAS_CUR (Bitfield-Mask: 0x03)                */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_CAP_SELECT_Pos (0UL)  /*!< XTAL32M_CAP_SELECT (Bit 0)                            */
#define CRG_XTAL_XTAL32M_CAP_MEAS_REG_XTAL32M_CAP_SELECT_Msk (0x7UL) /*!< XTAL32M_CAP_SELECT (Bitfield-Mask: 0x07)             */
/* ===================================================  XTAL32M_CTRL_REG  ==================================================== */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_DRIVE_CYCLES_Pos (9UL)    /*!< XTAL32M_DRIVE_CYCLES (Bit 9)                          */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_DRIVE_CYCLES_Msk (0xe00UL) /*!< XTAL32M_DRIVE_CYCLES (Bitfield-Mask: 0x07)           */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_ENABLE_Pos (8UL)          /*!< XTAL32M_ENABLE (Bit 8)                                */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_ENABLE_Msk (0x100UL)      /*!< XTAL32M_ENABLE (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIASPROT_Pos (6UL)        /*!< XTAL32M_BIASPROT (Bit 6)                              */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIASPROT_Msk (0xc0UL)     /*!< XTAL32M_BIASPROT (Bitfield-Mask: 0x03)                */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_LDO_SAH_Pos (4UL)         /*!< XTAL32M_LDO_SAH (Bit 4)                               */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_LDO_SAH_Msk (0x30UL)      /*!< XTAL32M_LDO_SAH (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_AMPREG_SAH_Pos (2UL)      /*!< XTAL32M_AMPREG_SAH (Bit 2)                            */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_AMPREG_SAH_Msk (0xcUL)    /*!< XTAL32M_AMPREG_SAH (Bitfield-Mask: 0x03)              */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIAS_SAH_Pos (0UL)        /*!< XTAL32M_BIAS_SAH (Bit 0)                              */
#define CRG_XTAL_XTAL32M_CTRL_REG_XTAL32M_BIAS_SAH_Msk (0x3UL)      /*!< XTAL32M_BIAS_SAH (Bitfield-Mask: 0x03)                */
/* ====================================================  XTAL32M_FSM_REG  ==================================================== */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_BOOST_MODE_Pos (5UL)       /*!< XTAL32M_BOOST_MODE (Bit 5)                            */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_BOOST_MODE_Msk (0x20UL)    /*!< XTAL32M_BOOST_MODE (Bitfield-Mask: 0x01)              */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_APPLY_CONFIG_Pos (4UL) /*!< XTAL32M_FSM_APPLY_CONFIG (Bit 4)                      */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_APPLY_CONFIG_Msk (0x10UL) /*!< XTAL32M_FSM_APPLY_CONFIG (Bitfield-Mask: 0x01)     */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_FORCE_IDLE_Pos (3UL)   /*!< XTAL32M_FSM_FORCE_IDLE (Bit 3)                        */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_FSM_FORCE_IDLE_Msk (0x8UL) /*!< XTAL32M_FSM_FORCE_IDLE (Bitfield-Mask: 0x01)          */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CMP_MODE_Pos (2UL)         /*!< XTAL32M_CMP_MODE (Bit 2)                              */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CMP_MODE_Msk (0x4UL)       /*!< XTAL32M_CMP_MODE (Bitfield-Mask: 0x01)                */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_TRIM_MODE_Pos (1UL)        /*!< XTAL32M_TRIM_MODE (Bit 1)                             */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_TRIM_MODE_Msk (0x2UL)      /*!< XTAL32M_TRIM_MODE (Bitfield-Mask: 0x01)               */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CUR_MODE_Pos (0UL)         /*!< XTAL32M_CUR_MODE (Bit 0)                              */
#define CRG_XTAL_XTAL32M_FSM_REG_XTAL32M_CUR_MODE_Msk (0x1UL)       /*!< XTAL32M_CUR_MODE (Bitfield-Mask: 0x01)                */
/* =================================================  XTAL32M_IRQ_CTRL_REG  ================================================== */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CAP_CTRL_Pos (10UL) /*!< XTAL32M_IRQ_CAP_CTRL (Bit 10)                       */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CAP_CTRL_Msk (0xc00UL) /*!< XTAL32M_IRQ_CAP_CTRL (Bitfield-Mask: 0x03)       */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_ENABLE_Pos (9UL)  /*!< XTAL32M_IRQ_ENABLE (Bit 9)                            */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_ENABLE_Msk (0x200UL) /*!< XTAL32M_IRQ_ENABLE (Bitfield-Mask: 0x01)           */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CLK_Pos (8UL)     /*!< XTAL32M_IRQ_CLK (Bit 8)                               */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CLK_Msk (0x100UL) /*!< XTAL32M_IRQ_CLK (Bitfield-Mask: 0x01)                 */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CNT_Pos (0UL)     /*!< XTAL32M_IRQ_CNT (Bit 0)                               */
#define CRG_XTAL_XTAL32M_IRQ_CTRL_REG_XTAL32M_IRQ_CNT_Msk (0xffUL)  /*!< XTAL32M_IRQ_CNT (Bitfield-Mask: 0xff)                 */
/* =================================================  XTAL32M_IRQ_STAT_REG  ================================================== */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_CAP_Pos (8UL) /*!< XTAL32M_IRQ_COUNT_CAP (Bit 8)                       */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_CAP_Msk (0xff00UL) /*!< XTAL32M_IRQ_COUNT_CAP (Bitfield-Mask: 0xff)    */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_STAT_Pos (0UL) /*!< XTAL32M_IRQ_COUNT_STAT (Bit 0)                     */
#define CRG_XTAL_XTAL32M_IRQ_STAT_REG_XTAL32M_IRQ_COUNT_STAT_Msk (0xffUL) /*!< XTAL32M_IRQ_COUNT_STAT (Bitfield-Mask: 0xff)    */
/* ==================================================  XTAL32M_SETTLE_REG  =================================================== */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TIMEOUT_Pos (22UL)      /*!< XTAL32M_TIMEOUT (Bit 22)                              */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TIMEOUT_Msk (0x1fc00000UL) /*!< XTAL32M_TIMEOUT (Bitfield-Mask: 0x7f)              */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_BLANK_Pos (19UL)    /*!< XTAL32M_CMP_BLANK (Bit 19)                            */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_BLANK_Msk (0x380000UL) /*!< XTAL32M_CMP_BLANK (Bitfield-Mask: 0x07)            */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_LVL_Pos (17UL)      /*!< XTAL32M_CMP_LVL (Bit 17)                              */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CMP_LVL_Msk (0x60000UL) /*!< XTAL32M_CMP_LVL (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_AMPL_SET_Pos (14UL)     /*!< XTAL32M_AMPL_SET (Bit 14)                             */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_AMPL_SET_Msk (0x1c000UL) /*!< XTAL32M_AMPL_SET (Bitfield-Mask: 0x07)               */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CUR_SET_Pos (10UL)      /*!< XTAL32M_CUR_SET (Bit 10)                              */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_CUR_SET_Msk (0x3c00UL)  /*!< XTAL32M_CUR_SET (Bitfield-Mask: 0x0f)                 */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TRIM_Pos (0UL)          /*!< XTAL32M_TRIM (Bit 0)                                  */
#define CRG_XTAL_XTAL32M_SETTLE_REG_XTAL32M_TRIM_Msk (0x3ffUL)      /*!< XTAL32M_TRIM (Bitfield-Mask: 0x3ff)                   */
/* ===================================================  XTAL32M_START_REG  =================================================== */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TIMEOUT_Pos (22UL)       /*!< XTAL32M_TIMEOUT (Bit 22)                              */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TIMEOUT_Msk (0x1fc00000UL) /*!< XTAL32M_TIMEOUT (Bitfield-Mask: 0x7f)               */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_BLANK_Pos (19UL)     /*!< XTAL32M_CMP_BLANK (Bit 19)                            */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_BLANK_Msk (0x380000UL) /*!< XTAL32M_CMP_BLANK (Bitfield-Mask: 0x07)             */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_LVL_Pos (17UL)       /*!< XTAL32M_CMP_LVL (Bit 17)                              */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CMP_LVL_Msk (0x60000UL)  /*!< XTAL32M_CMP_LVL (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_AMPL_SET_Pos (14UL)      /*!< XTAL32M_AMPL_SET (Bit 14)                             */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_AMPL_SET_Msk (0x1c000UL) /*!< XTAL32M_AMPL_SET (Bitfield-Mask: 0x07)                */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CUR_SET_Pos (10UL)       /*!< XTAL32M_CUR_SET (Bit 10)                              */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_CUR_SET_Msk (0x3c00UL)   /*!< XTAL32M_CUR_SET (Bitfield-Mask: 0x0f)                 */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TRIM_Pos (0UL)           /*!< XTAL32M_TRIM (Bit 0)                                  */
#define CRG_XTAL_XTAL32M_START_REG_XTAL32M_TRIM_Msk (0x3ffUL)       /*!< XTAL32M_TRIM (Bitfield-Mask: 0x3ff)                   */
/* ===================================================  XTAL32M_STAT0_REG  =================================================== */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_OVERLOAD_Pos (29UL)      /*!< XTAL32M_OVERLOAD (Bit 29)                             */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_OVERLOAD_Msk (0x20000000UL) /*!< XTAL32M_OVERLOAD (Bitfield-Mask: 0x01)             */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_LVL_STAT_Pos (27UL)  /*!< XTAL32M_CMP_LVL_STAT (Bit 27)                         */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_LVL_STAT_Msk (0x18000000UL) /*!< XTAL32M_CMP_LVL_STAT (Bitfield-Mask: 0x03)     */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_AMPL_TRIM_Pos (24UL)     /*!< XTAL32M_AMPL_TRIM (Bit 24)                            */
