antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_AMPL_TRIM_Msk (0x7000000UL) /*!< XTAL32M_AMPL_TRIM (Bitfield-Mask: 0x07)            */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_TRIM_VAL_Pos (14UL)      /*!< XTAL32M_TRIM_VAL (Bit 14)                             */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_TRIM_VAL_Msk (0xffc000UL) /*!< XTAL32M_TRIM_VAL (Bitfield-Mask: 0x3ff)              */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CUR_SET_STAT_Pos (10UL)  /*!< XTAL32M_CUR_SET_STAT (Bit 10)                         */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CUR_SET_STAT_Msk (0x3c00UL) /*!< XTAL32M_CUR_SET_STAT (Bitfield-Mask: 0x0f)         */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_LDO_OK_Pos (9UL)         /*!< XTAL32M_LDO_OK (Bit 9)                                */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_LDO_OK_Msk (0x200UL)     /*!< XTAL32M_LDO_OK (Bitfield-Mask: 0x01)                  */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_OUT_Pos (7UL)        /*!< XTAL32M_CMP_OUT (Bit 7)                               */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_OUT_Msk (0x180UL)    /*!< XTAL32M_CMP_OUT (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_STATE_Pos (3UL)          /*!< XTAL32M_STATE (Bit 3)                                 */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_STATE_Msk (0x78UL)       /*!< XTAL32M_STATE (Bitfield-Mask: 0x0f)                   */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_OUT_HOLD_Pos (1UL)   /*!< XTAL32M_CMP_OUT_HOLD (Bit 1)                          */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_CMP_OUT_HOLD_Msk (0x6UL) /*!< XTAL32M_CMP_OUT_HOLD (Bitfield-Mask: 0x03)            */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_READY_Pos (0UL)          /*!< XTAL32M_READY (Bit 0)                                 */
#define CRG_XTAL_XTAL32M_STAT0_REG_XTAL32M_READY_Msk (0x1UL)        /*!< XTAL32M_READY (Bitfield-Mask: 0x01)                   */
/* ===================================================  XTAL32M_TRIM_REG  ==================================================== */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_BOOST_TRIM_Pos (19UL)     /*!< XTAL32M_BOOST_TRIM (Bit 19)                           */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_BOOST_TRIM_Msk (0x1f80000UL) /*!< XTAL32M_BOOST_TRIM (Bitfield-Mask: 0x3f)           */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CMP_LVL_Pos (17UL)        /*!< XTAL32M_CMP_LVL (Bit 17)                              */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CMP_LVL_Msk (0x60000UL)   /*!< XTAL32M_CMP_LVL (Bitfield-Mask: 0x03)                 */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_AMPL_SET_Pos (14UL)       /*!< XTAL32M_AMPL_SET (Bit 14)                             */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_AMPL_SET_Msk (0x1c000UL)  /*!< XTAL32M_AMPL_SET (Bitfield-Mask: 0x07)                */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CUR_SET_Pos (10UL)        /*!< XTAL32M_CUR_SET (Bit 10)                              */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_CUR_SET_Msk (0x3c00UL)    /*!< XTAL32M_CUR_SET (Bitfield-Mask: 0x0f)                 */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_TRIM_Pos (0UL)            /*!< XTAL32M_TRIM (Bit 0)                                  */
#define CRG_XTAL_XTAL32M_TRIM_REG_XTAL32M_TRIM_Msk (0x3ffUL)        /*!< XTAL32M_TRIM (Bitfield-Mask: 0x3ff)                   */


/* =========================================================================================================================== */
/* ================                                          DCACHE                                           ================ */
/* =========================================================================================================================== */

/* =================================================  DCACHE_BASE_ADDR_REG  ================================================== */
#define DCACHE_DCACHE_BASE_ADDR_REG_DCACHE_BASE_ADDR_Pos (0UL)      /*!< DCACHE_BASE_ADDR (Bit 0)                              */
#define DCACHE_DCACHE_BASE_ADDR_REG_DCACHE_BASE_ADDR_Msk (0x1ffffUL) /*!< DCACHE_BASE_ADDR (Bitfield-Mask: 0x1ffff)            */
/* ====================================================  DCACHE_CTRL_REG  ==================================================== */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_BYPASS_Pos (26UL)             /*!< DCACHE_BYPASS (Bit 26)                                */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_BYPASS_Msk (0x4000000UL)      /*!< DCACHE_BYPASS (Bitfield-Mask: 0x01)                   */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WBUFFER_FLUSH_Pos (24UL)      /*!< DCACHE_WBUFFER_FLUSH (Bit 24)                         */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WBUFFER_FLUSH_Msk (0x1000000UL) /*!< DCACHE_WBUFFER_FLUSH (Bitfield-Mask: 0x01)          */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WBUFFER_EMPTY_Pos (23UL)      /*!< DCACHE_WBUFFER_EMPTY (Bit 23)                         */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WBUFFER_EMPTY_Msk (0x800000UL) /*!< DCACHE_WBUFFER_EMPTY (Bitfield-Mask: 0x01)           */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WFLUSHED_Pos (22UL)           /*!< DCACHE_WFLUSHED (Bit 22)                              */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WFLUSHED_Msk (0x400000UL)     /*!< DCACHE_WFLUSHED (Bitfield-Mask: 0x01)                 */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_READY_Pos (21UL)              /*!< DCACHE_READY (Bit 21)                                 */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_READY_Msk (0x200000UL)        /*!< DCACHE_READY (Bitfield-Mask: 0x01)                    */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WFLUSH_Pos (20UL)             /*!< DCACHE_WFLUSH (Bit 20)                                */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_WFLUSH_Msk (0x100000UL)       /*!< DCACHE_WFLUSH (Bitfield-Mask: 0x01)                   */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_INIT_Pos (19UL)               /*!< DCACHE_INIT (Bit 19)                                  */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_INIT_Msk (0x80000UL)          /*!< DCACHE_INIT (Bitfield-Mask: 0x01)                     */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_ENABLE_Pos (18UL)             /*!< DCACHE_ENABLE (Bit 18)                                */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_ENABLE_Msk (0x40000UL)        /*!< DCACHE_ENABLE (Bitfield-Mask: 0x01)                   */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_LEN_Pos (0UL)                 /*!< DCACHE_LEN (Bit 0)                                    */
#define DCACHE_DCACHE_CTRL_REG_DCACHE_LEN_Msk (0x3ffffUL)           /*!< DCACHE_LEN (Bitfield-Mask: 0x3ffff)                   */
/* ==================================================  DCACHE_MRM_CTRL_REG  ================================================== */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_EVICTS_THRES_STATUS_Pos (5UL) /*!< MRM_IRQ_EVICTS_THRES_STATUS (Bit 5)              */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_EVICTS_THRES_STATUS_Msk (0x20UL) /*!< MRM_IRQ_EVICTS_THRES_STATUS (Bitfield-Mask: 0x01) */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_HITS_THRES_STATUS_Pos (4UL) /*!< MRM_IRQ_HITS_THRES_STATUS (Bit 4)                  */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_HITS_THRES_STATUS_Msk (0x10UL) /*!< MRM_IRQ_HITS_THRES_STATUS (Bitfield-Mask: 0x01) */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_MISSES_THRES_STATUS_Pos (3UL) /*!< MRM_IRQ_MISSES_THRES_STATUS (Bit 3)              */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_MISSES_THRES_STATUS_Msk (0x8UL) /*!< MRM_IRQ_MISSES_THRES_STATUS (Bitfield-Mask: 0x01) */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Pos (2UL)    /*!< MRM_IRQ_TINT_STATUS (Bit 2)                           */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_TINT_STATUS_Msk (0x4UL)  /*!< MRM_IRQ_TINT_STATUS (Bitfield-Mask: 0x01)             */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Pos (1UL)           /*!< MRM_IRQ_MASK (Bit 1)                                  */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_IRQ_MASK_Msk (0x2UL)         /*!< MRM_IRQ_MASK (Bitfield-Mask: 0x01)                    */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_START_Pos (0UL)              /*!< MRM_START (Bit 0)                                     */
#define DCACHE_DCACHE_MRM_CTRL_REG_MRM_START_Msk (0x1UL)            /*!< MRM_START (Bitfield-Mask: 0x01)                       */
/* =================================================  DCACHE_MRM_EVICTS_REG  ================================================= */
#define DCACHE_DCACHE_MRM_EVICTS_REG_MRM_EVICTS_Pos (0UL)           /*!< MRM_EVICTS (Bit 0)                                    */
#define DCACHE_DCACHE_MRM_EVICTS_REG_MRM_EVICTS_Msk (0xffffffffUL)  /*!< MRM_EVICTS (Bitfield-Mask: 0xffffffff)                */
/* ==============================================  DCACHE_MRM_EVICTS_THRES_REG  ============================================== */
#define DCACHE_DCACHE_MRM_EVICTS_THRES_REG_MRM_EVICTS_THRES_Pos (0UL) /*!< MRM_EVICTS_THRES (Bit 0)                            */
#define DCACHE_DCACHE_MRM_EVICTS_THRES_REG_MRM_EVICTS_THRES_Msk (0xffffffffUL) /*!< MRM_EVICTS_THRES (Bitfield-Mask: 0xffffffff) */
/* ==================================================  DCACHE_MRM_HITS_REG  ================================================== */
#define DCACHE_DCACHE_MRM_HITS_REG_MRM_HITS_Pos (0UL)               /*!< MRM_HITS (Bit 0)                                      */
#define DCACHE_DCACHE_MRM_HITS_REG_MRM_HITS_Msk (0xffffffffUL)      /*!< MRM_HITS (Bitfield-Mask: 0xffffffff)                  */
/* ===============================================  DCACHE_MRM_HITS_THRES_REG  =============================================== */
#define DCACHE_DCACHE_MRM_HITS_THRES_REG_MRM_HITS_THRES_Pos (0UL)   /*!< MRM_HITS_THRES (Bit 0)                                */
#define DCACHE_DCACHE_MRM_HITS_THRES_REG_MRM_HITS_THRES_Msk (0xffffffffUL) /*!< MRM_HITS_THRES (Bitfield-Mask: 0xffffffff)     */
/* =================================================  DCACHE_MRM_MISSES_REG  ================================================= */
#define DCACHE_DCACHE_MRM_MISSES_REG_MRM_MISSES_Pos (0UL)           /*!< MRM_MISSES (Bit 0)                                    */
#define DCACHE_DCACHE_MRM_MISSES_REG_MRM_MISSES_Msk (0xffffffffUL)  /*!< MRM_MISSES (Bitfield-Mask: 0xffffffff)                */
/* ==============================================  DCACHE_MRM_MISSES_THRES_REG  ============================================== */
#define DCACHE_DCACHE_MRM_MISSES_THRES_REG_MRM_MISSES_THRES_Pos (0UL) /*!< MRM_MISSES_THRES (Bit 0)                            */
#define DCACHE_DCACHE_MRM_MISSES_THRES_REG_MRM_MISSES_THRES_Msk (0xffffffffUL) /*!< MRM_MISSES_THRES (Bitfield-Mask: 0xffffffff) */
/* ==================================================  DCACHE_MRM_TINT_REG  ================================================== */
#define DCACHE_DCACHE_MRM_TINT_REG_MRM_TINT_Pos (0UL)               /*!< MRM_TINT (Bit 0)                                      */
#define DCACHE_DCACHE_MRM_TINT_REG_MRM_TINT_Msk (0x7ffffUL)         /*!< MRM_TINT (Bitfield-Mask: 0x7ffff)                     */


/* =========================================================================================================================== */
/* ================                                           DCDC                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  BUCK_CTRL_REG  ===================================================== */
#define DCDC_BUCK_CTRL_REG_CFG_TIMEOUT_Pos (14UL)                   /*!< CFG_TIMEOUT (Bit 14)                                  */
#define DCDC_BUCK_CTRL_REG_CFG_TIMEOUT_Msk (0xc000UL)               /*!< CFG_TIMEOUT (Bitfield-Mask: 0x03)                     */
#define DCDC_BUCK_CTRL_REG_EN_FREEWHEEL_Pos (13UL)                  /*!< EN_FREEWHEEL (Bit 13)                                 */
#define DCDC_BUCK_CTRL_REG_EN_FREEWHEEL_Msk (0x2000UL)              /*!< EN_FREEWHEEL (Bitfield-Mask: 0x01)                    */
#define DCDC_BUCK_CTRL_REG_TRIM_BIAS_Pos  (10UL)                    /*!< TRIM_BIAS (Bit 10)                                    */
#define DCDC_BUCK_CTRL_REG_TRIM_BIAS_Msk  (0x1c00UL)                /*!< TRIM_BIAS (Bitfield-Mask: 0x07)                       */
#define DCDC_BUCK_CTRL_REG_CFG_IMAX_UPPER_Pos (5UL)                 /*!< CFG_IMAX_UPPER (Bit 5)                                */
#define DCDC_BUCK_CTRL_REG_CFG_IMAX_UPPER_Msk (0xe0UL)              /*!< CFG_IMAX_UPPER (Bitfield-Mask: 0x07)                  */
#define DCDC_BUCK_CTRL_REG_CFG_IMAX_LOWER_Pos (2UL)                 /*!< CFG_IMAX_LOWER (Bit 2)                                */
#define DCDC_BUCK_CTRL_REG_CFG_IMAX_LOWER_Msk (0x1cUL)              /*!< CFG_IMAX_LOWER (Bitfield-Mask: 0x07)                  */
#define DCDC_BUCK_CTRL_REG_CFG_HYST_Pos   (0UL)                     /*!< CFG_HYST (Bit 0)                                      */
#define DCDC_BUCK_CTRL_REG_CFG_HYST_Msk   (0x3UL)                   /*!< CFG_HYST (Bitfield-Mask: 0x03)                        */


/* =========================================================================================================================== */
/* ================                                        DCDC_BOOST                                         ================ */
/* =========================================================================================================================== */

/* ====================================================  BOOST_CTRL_REG0  ==================================================== */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_TIMEOUT_TRIG_DELAY_Pos (17UL) /*!< BOOST_TIMEOUT_TRIG_DELAY (Bit 17)                  */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_TIMEOUT_TRIG_DELAY_Msk (0x1e0000UL) /*!< BOOST_TIMEOUT_TRIG_DELAY (Bitfield-Mask: 0x0f) */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_PSW_TIMEOUT_Pos (13UL)     /*!< BOOST_PSW_TIMEOUT (Bit 13)                            */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_PSW_TIMEOUT_Msk (0x1e000UL) /*!< BOOST_PSW_TIMEOUT (Bitfield-Mask: 0x0f)              */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_NSW_TIMEOUT_Pos (9UL)      /*!< BOOST_NSW_TIMEOUT (Bit 9)                             */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_NSW_TIMEOUT_Msk (0x1e00UL) /*!< BOOST_NSW_TIMEOUT (Bitfield-Mask: 0x0f)               */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_OK_CLR_COUNT_Pos (7UL)     /*!< BOOST_OK_CLR_COUNT (Bit 7)                            */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_OK_CLR_COUNT_Msk (0x180UL) /*!< BOOST_OK_CLR_COUNT (Bitfield-Mask: 0x03)              */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_IDLE_CLK_DIV_Pos (5UL)     /*!< BOOST_IDLE_CLK_DIV (Bit 5)                            */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_IDLE_CLK_DIV_Msk (0x60UL)  /*!< BOOST_IDLE_CLK_DIV (Bitfield-Mask: 0x03)              */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_VLED_TRIM_Pos (2UL)        /*!< BOOST_VLED_TRIM (Bit 2)                               */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_VLED_TRIM_Msk (0x1cUL)     /*!< BOOST_VLED_TRIM (Bitfield-Mask: 0x07)                 */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_VLED_SEL_Pos (0UL)         /*!< BOOST_VLED_SEL (Bit 0)                                */
#define DCDC_BOOST_BOOST_CTRL_REG0_BOOST_VLED_SEL_Msk (0x3UL)       /*!< BOOST_VLED_SEL (Bitfield-Mask: 0x03)                  */
/* ====================================================  BOOST_CTRL_REG1  ==================================================== */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_SLEEP_FIXED_Pos (17UL) /*!< BOOST_CUR_LIM_SLEEP_FIXED (Bit 17)                */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_SLEEP_FIXED_Msk (0x20000UL) /*!< BOOST_CUR_LIM_SLEEP_FIXED (Bitfield-Mask: 0x01) */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_SLEEP_Pos (12UL)   /*!< BOOST_CUR_LIM_SLEEP (Bit 12)                          */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_SLEEP_Msk (0x1f000UL) /*!< BOOST_CUR_LIM_SLEEP (Bitfield-Mask: 0x1f)          */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_STEP_Pos (10UL)    /*!< BOOST_CUR_LIM_STEP (Bit 10)                           */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_STEP_Msk (0xc00UL) /*!< BOOST_CUR_LIM_STEP (Bitfield-Mask: 0x03)              */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_MAX_Pos (5UL)      /*!< BOOST_CUR_LIM_MAX (Bit 5)                             */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_MAX_Msk (0x3e0UL)  /*!< BOOST_CUR_LIM_MAX (Bitfield-Mask: 0x1f)               */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_MIN_Pos (0UL)      /*!< BOOST_CUR_LIM_MIN (Bit 0)                             */
#define DCDC_BOOST_BOOST_CTRL_REG1_BOOST_CUR_LIM_MIN_Msk (0x1fUL)   /*!< BOOST_CUR_LIM_MIN (Bitfield-Mask: 0x1f)               */
/* ===================================================  BOOST_STATUS_REG  ==================================================== */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_TRIM_Pos (18UL)      /*!< BOOST_COMP_TRIM (Bit 18)                              */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_TRIM_Msk (0xfc0000UL) /*!< BOOST_COMP_TRIM (Bitfield-Mask: 0x3f)                */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_IDLE_Pos (17UL)           /*!< BOOST_IDLE (Bit 17)                                   */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_IDLE_Msk (0x20000UL)      /*!< BOOST_IDLE (Bitfield-Mask: 0x01)                      */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_CUR_LIM_Pos (12UL)        /*!< BOOST_CUR_LIM (Bit 12)                                */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_CUR_LIM_Msk (0x1f000UL)   /*!< BOOST_CUR_LIM (Bitfield-Mask: 0x1f)                   */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_P_DYN_P_Pos (11UL)   /*!< BOOST_COMP_P_DYN_P (Bit 11)                           */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_P_DYN_P_Msk (0x800UL) /*!< BOOST_COMP_P_DYN_P (Bitfield-Mask: 0x01)             */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_P_DYN_N_Pos (10UL)   /*!< BOOST_COMP_P_DYN_N (Bit 10)                           */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_P_DYN_N_Msk (0x400UL) /*!< BOOST_COMP_P_DYN_N (Bitfield-Mask: 0x01)             */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_P_CONT_Pos (9UL)     /*!< BOOST_COMP_P_CONT (Bit 9)                             */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_P_CONT_Msk (0x200UL) /*!< BOOST_COMP_P_CONT (Bitfield-Mask: 0x01)               */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_N_CONT_Pos (8UL)     /*!< BOOST_COMP_N_CONT (Bit 8)                             */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_COMP_N_CONT_Msk (0x100UL) /*!< BOOST_COMP_N_CONT (Bitfield-Mask: 0x01)               */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_TIMEOUT_PSW_Pos (7UL)     /*!< BOOST_TIMEOUT_PSW (Bit 7)                             */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_TIMEOUT_PSW_Msk (0x80UL)  /*!< BOOST_TIMEOUT_PSW (Bitfield-Mask: 0x01)               */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_TIMEOUT_NSW_Pos (6UL)     /*!< BOOST_TIMEOUT_NSW (Bit 6)                             */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_TIMEOUT_NSW_Msk (0x40UL)  /*!< BOOST_TIMEOUT_NSW (Bitfield-Mask: 0x01)               */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_VOUT_NOK_Pos (5UL)        /*!< BOOST_VOUT_NOK (Bit 5)                                */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_VOUT_NOK_Msk (0x20UL)     /*!< BOOST_VOUT_NOK (Bitfield-Mask: 0x01)                  */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_VOUT_OK_Pos (4UL)         /*!< BOOST_VOUT_OK (Bit 4)                                 */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_VOUT_OK_Msk (0x10UL)      /*!< BOOST_VOUT_OK (Bitfield-Mask: 0x01)                   */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_SW_STATE_Pos (2UL)        /*!< BOOST_SW_STATE (Bit 2)                                */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_SW_STATE_Msk (0xcUL)      /*!< BOOST_SW_STATE (Bitfield-Mask: 0x03)                  */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_STARTUP_COMPLETE_Pos (1UL) /*!< BOOST_STARTUP_COMPLETE (Bit 1)                       */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_STARTUP_COMPLETE_Msk (0x2UL) /*!< BOOST_STARTUP_COMPLETE (Bitfield-Mask: 0x01)       */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_VLED_OK_Pos (0UL)         /*!< BOOST_VLED_OK (Bit 0)                                 */
#define DCDC_BOOST_BOOST_STATUS_REG_BOOST_VLED_OK_Msk (0x1UL)       /*!< BOOST_VLED_OK (Bitfield-Mask: 0x01)                   */
/* ===================================================  VLED_PWR_CTRL_REG  =================================================== */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_FORCE_Pos (11UL)      /*!< VLED_PWR_FORCE (Bit 11)                               */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_FORCE_Msk (0x1800UL)  /*!< VLED_PWR_FORCE (Bitfield-Mask: 0x03)                  */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_MANUAL_Pos (10UL)     /*!< VLED_PWR_MANUAL (Bit 10)                              */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_MANUAL_Msk (0x400UL)  /*!< VLED_PWR_MANUAL (Bitfield-Mask: 0x01)                 */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_USE_VSYS_LVL_Pos (9UL) /*!< VLED_PWR_USE_VSYS_LVL (Bit 9)                        */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_USE_VSYS_LVL_Msk (0x200UL) /*!< VLED_PWR_USE_VSYS_LVL (Bitfield-Mask: 0x01)      */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_ENABLE_Pos (8UL)      /*!< VLED_PWR_ENABLE (Bit 8)                               */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VLED_PWR_ENABLE_Msk (0x100UL)  /*!< VLED_PWR_ENABLE (Bitfield-Mask: 0x01)                 */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VSYS_OK_DEBOUNCE_Pos (0UL)     /*!< VSYS_OK_DEBOUNCE (Bit 0)                              */
#define DCDC_BOOST_VLED_PWR_CTRL_REG_VSYS_OK_DEBOUNCE_Msk (0xffUL)  /*!< VSYS_OK_DEBOUNCE (Bitfield-Mask: 0xff)                */
/* ==================================================  VLED_PWR_STATUS_REG  ================================================== */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VLED_PWR_ALLOW_BOOST_Pos (5UL) /*!< VLED_PWR_ALLOW_BOOST (Bit 5)                        */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VLED_PWR_ALLOW_BOOST_Msk (0x20UL) /*!< VLED_PWR_ALLOW_BOOST (Bitfield-Mask: 0x01)       */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VLED_PWR_VSYS_CONNECTED_Pos (4UL) /*!< VLED_PWR_VSYS_CONNECTED (Bit 4)                  */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VLED_PWR_VSYS_CONNECTED_Msk (0x10UL) /*!< VLED_PWR_VSYS_CONNECTED (Bitfield-Mask: 0x01) */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VLED_PWR_SWITCH_CTRL_STATE_Pos (2UL) /*!< VLED_PWR_SWITCH_CTRL_STATE (Bit 2)            */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VLED_PWR_SWITCH_CTRL_STATE_Msk (0xcUL) /*!< VLED_PWR_SWITCH_CTRL_STATE (Bitfield-Mask: 0x03) */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VSYS_OK_DEBOUNCED_Pos (1UL)  /*!< VSYS_OK_DEBOUNCED (Bit 1)                             */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VSYS_OK_DEBOUNCED_Msk (0x2UL) /*!< VSYS_OK_DEBOUNCED (Bitfield-Mask: 0x01)              */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VSYS_OK_Pos (0UL)            /*!< VSYS_OK (Bit 0)                                       */
#define DCDC_BOOST_VLED_PWR_STATUS_REG_VSYS_OK_Msk (0x1UL)          /*!< VSYS_OK (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

