antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define DMA_DMA_INT_MASK_REG_DMA_IRQ_ENABLE0_Pos (0UL)              /*!< DMA_IRQ_ENABLE0 (Bit 0)                               */
#define DMA_DMA_INT_MASK_REG_DMA_IRQ_ENABLE0_Msk (0x1UL)            /*!< DMA_IRQ_ENABLE0 (Bitfield-Mask: 0x01)                 */
/* ==================================================  DMA_INT_STATUS_REG  =================================================== */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR7_Pos (15UL)              /*!< DMA_BUS_ERR7 (Bit 15)                                 */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR7_Msk (0x8000UL)          /*!< DMA_BUS_ERR7 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR6_Pos (14UL)              /*!< DMA_BUS_ERR6 (Bit 14)                                 */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR6_Msk (0x4000UL)          /*!< DMA_BUS_ERR6 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR5_Pos (13UL)              /*!< DMA_BUS_ERR5 (Bit 13)                                 */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR5_Msk (0x2000UL)          /*!< DMA_BUS_ERR5 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR4_Pos (12UL)              /*!< DMA_BUS_ERR4 (Bit 12)                                 */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR4_Msk (0x1000UL)          /*!< DMA_BUS_ERR4 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR3_Pos (11UL)              /*!< DMA_BUS_ERR3 (Bit 11)                                 */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR3_Msk (0x800UL)           /*!< DMA_BUS_ERR3 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR2_Pos (10UL)              /*!< DMA_BUS_ERR2 (Bit 10)                                 */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR2_Msk (0x400UL)           /*!< DMA_BUS_ERR2 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR1_Pos (9UL)               /*!< DMA_BUS_ERR1 (Bit 9)                                  */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR1_Msk (0x200UL)           /*!< DMA_BUS_ERR1 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR0_Pos (8UL)               /*!< DMA_BUS_ERR0 (Bit 8)                                  */
#define DMA_DMA_INT_STATUS_REG_DMA_BUS_ERR0_Msk (0x100UL)           /*!< DMA_BUS_ERR0 (Bitfield-Mask: 0x01)                    */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH7_Pos (7UL)                /*!< DMA_IRQ_CH7 (Bit 7)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH7_Msk (0x80UL)             /*!< DMA_IRQ_CH7 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH6_Pos (6UL)                /*!< DMA_IRQ_CH6 (Bit 6)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH6_Msk (0x40UL)             /*!< DMA_IRQ_CH6 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH5_Pos (5UL)                /*!< DMA_IRQ_CH5 (Bit 5)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH5_Msk (0x20UL)             /*!< DMA_IRQ_CH5 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH4_Pos (4UL)                /*!< DMA_IRQ_CH4 (Bit 4)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH4_Msk (0x10UL)             /*!< DMA_IRQ_CH4 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH3_Pos (3UL)                /*!< DMA_IRQ_CH3 (Bit 3)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH3_Msk (0x8UL)              /*!< DMA_IRQ_CH3 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH2_Pos (2UL)                /*!< DMA_IRQ_CH2 (Bit 2)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH2_Msk (0x4UL)              /*!< DMA_IRQ_CH2 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH1_Pos (1UL)                /*!< DMA_IRQ_CH1 (Bit 1)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH1_Msk (0x2UL)              /*!< DMA_IRQ_CH1 (Bitfield-Mask: 0x01)                     */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH0_Pos (0UL)                /*!< DMA_IRQ_CH0 (Bit 0)                                   */
#define DMA_DMA_INT_STATUS_REG_DMA_IRQ_CH0_Msk (0x1UL)              /*!< DMA_IRQ_CH0 (Bitfield-Mask: 0x01)                     */
/* ====================================================  DMA_REQ_MUX_REG  ==================================================== */
#define DMA_DMA_REQ_MUX_REG_DMA67_SEL_Pos (12UL)                    /*!< DMA67_SEL (Bit 12)                                    */
#define DMA_DMA_REQ_MUX_REG_DMA67_SEL_Msk (0xf000UL)                /*!< DMA67_SEL (Bitfield-Mask: 0x0f)                       */
#define DMA_DMA_REQ_MUX_REG_DMA45_SEL_Pos (8UL)                     /*!< DMA45_SEL (Bit 8)                                     */
#define DMA_DMA_REQ_MUX_REG_DMA45_SEL_Msk (0xf00UL)                 /*!< DMA45_SEL (Bitfield-Mask: 0x0f)                       */
#define DMA_DMA_REQ_MUX_REG_DMA23_SEL_Pos (4UL)                     /*!< DMA23_SEL (Bit 4)                                     */
#define DMA_DMA_REQ_MUX_REG_DMA23_SEL_Msk (0xf0UL)                  /*!< DMA23_SEL (Bitfield-Mask: 0x0f)                       */
#define DMA_DMA_REQ_MUX_REG_DMA01_SEL_Pos (0UL)                     /*!< DMA01_SEL (Bit 0)                                     */
#define DMA_DMA_REQ_MUX_REG_DMA01_SEL_Msk (0xfUL)                   /*!< DMA01_SEL (Bitfield-Mask: 0x0f)                       */
/* ================================================  DMA_RESET_INT_MASK_REG  ================================================= */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE7_Pos (7UL)  /*!< DMA_RESET_IRQ_ENABLE7 (Bit 7)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE7_Msk (0x80UL) /*!< DMA_RESET_IRQ_ENABLE7 (Bitfield-Mask: 0x01)         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE6_Pos (6UL)  /*!< DMA_RESET_IRQ_ENABLE6 (Bit 6)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE6_Msk (0x40UL) /*!< DMA_RESET_IRQ_ENABLE6 (Bitfield-Mask: 0x01)         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE5_Pos (5UL)  /*!< DMA_RESET_IRQ_ENABLE5 (Bit 5)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE5_Msk (0x20UL) /*!< DMA_RESET_IRQ_ENABLE5 (Bitfield-Mask: 0x01)         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE4_Pos (4UL)  /*!< DMA_RESET_IRQ_ENABLE4 (Bit 4)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE4_Msk (0x10UL) /*!< DMA_RESET_IRQ_ENABLE4 (Bitfield-Mask: 0x01)         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE3_Pos (3UL)  /*!< DMA_RESET_IRQ_ENABLE3 (Bit 3)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE3_Msk (0x8UL) /*!< DMA_RESET_IRQ_ENABLE3 (Bitfield-Mask: 0x01)          */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE2_Pos (2UL)  /*!< DMA_RESET_IRQ_ENABLE2 (Bit 2)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE2_Msk (0x4UL) /*!< DMA_RESET_IRQ_ENABLE2 (Bitfield-Mask: 0x01)          */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE1_Pos (1UL)  /*!< DMA_RESET_IRQ_ENABLE1 (Bit 1)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE1_Msk (0x2UL) /*!< DMA_RESET_IRQ_ENABLE1 (Bitfield-Mask: 0x01)          */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE0_Pos (0UL)  /*!< DMA_RESET_IRQ_ENABLE0 (Bit 0)                         */
#define DMA_DMA_RESET_INT_MASK_REG_DMA_RESET_IRQ_ENABLE0_Msk (0x1UL) /*!< DMA_RESET_IRQ_ENABLE0 (Bitfield-Mask: 0x01)          */
/* =================================================  DMA_SET_INT_MASK_REG  ================================================== */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE7_Pos (7UL)      /*!< DMA_SET_IRQ_ENABLE7 (Bit 7)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE7_Msk (0x80UL)   /*!< DMA_SET_IRQ_ENABLE7 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE6_Pos (6UL)      /*!< DMA_SET_IRQ_ENABLE6 (Bit 6)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE6_Msk (0x40UL)   /*!< DMA_SET_IRQ_ENABLE6 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE5_Pos (5UL)      /*!< DMA_SET_IRQ_ENABLE5 (Bit 5)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE5_Msk (0x20UL)   /*!< DMA_SET_IRQ_ENABLE5 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE4_Pos (4UL)      /*!< DMA_SET_IRQ_ENABLE4 (Bit 4)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE4_Msk (0x10UL)   /*!< DMA_SET_IRQ_ENABLE4 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE3_Pos (3UL)      /*!< DMA_SET_IRQ_ENABLE3 (Bit 3)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE3_Msk (0x8UL)    /*!< DMA_SET_IRQ_ENABLE3 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE2_Pos (2UL)      /*!< DMA_SET_IRQ_ENABLE2 (Bit 2)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE2_Msk (0x4UL)    /*!< DMA_SET_IRQ_ENABLE2 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE1_Pos (1UL)      /*!< DMA_SET_IRQ_ENABLE1 (Bit 1)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE1_Msk (0x2UL)    /*!< DMA_SET_IRQ_ENABLE1 (Bitfield-Mask: 0x01)             */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE0_Pos (0UL)      /*!< DMA_SET_IRQ_ENABLE0 (Bit 0)                           */
#define DMA_DMA_SET_INT_MASK_REG_DMA_SET_IRQ_ENABLE0_Msk (0x1UL)    /*!< DMA_SET_IRQ_ENABLE0 (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                           EMMC                                            ================ */
/* =========================================================================================================================== */

