antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ===============================================  EMMC_ADMA_ERR_STAT_R_REG  ================================================ */
#define EMMC_EMMC_ADMA_ERR_STAT_R_REG_ADMA_LEN_ERR_Pos (2UL)        /*!< ADMA_LEN_ERR (Bit 2)                                  */
#define EMMC_EMMC_ADMA_ERR_STAT_R_REG_ADMA_LEN_ERR_Msk (0x4UL)      /*!< ADMA_LEN_ERR (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_ADMA_ERR_STAT_R_REG_ADMA_ERR_STATES_Pos (0UL)     /*!< ADMA_ERR_STATES (Bit 0)                               */
#define EMMC_EMMC_ADMA_ERR_STAT_R_REG_ADMA_ERR_STATES_Msk (0x3UL)   /*!< ADMA_ERR_STATES (Bitfield-Mask: 0x03)                 */
/* ================================================  EMMC_ADMA_SA_LOW_R_REG  ================================================= */
#define EMMC_EMMC_ADMA_SA_LOW_R_REG_ADMA_SA_LOW_Pos (0UL)           /*!< ADMA_SA_LOW (Bit 0)                                   */
#define EMMC_EMMC_ADMA_SA_LOW_R_REG_ADMA_SA_LOW_Msk (0xffffffffUL)  /*!< ADMA_SA_LOW (Bitfield-Mask: 0xffffffff)               */
/* ==================================================  EMMC_ARGUMENT_R_REG  ================================================== */
#define EMMC_EMMC_ARGUMENT_R_REG_ARGUMENT_Pos (0UL)                 /*!< ARGUMENT (Bit 0)                                      */
#define EMMC_EMMC_ARGUMENT_R_REG_ARGUMENT_Msk (0xffffffffUL)        /*!< ARGUMENT (Bitfield-Mask: 0xffffffff)                  */
/* ==================================================  EMMC_AT_CTRL_R_REG  =================================================== */
#define EMMC_EMMC_AT_CTRL_R_REG_SWIN_TH_VAL_Pos (24UL)              /*!< SWIN_TH_VAL (Bit 24)                                  */
#define EMMC_EMMC_AT_CTRL_R_REG_SWIN_TH_VAL_Msk (0x7000000UL)       /*!< SWIN_TH_VAL (Bitfield-Mask: 0x07)                     */
#define EMMC_EMMC_AT_CTRL_R_REG_POST_CHANGE_DLY_Pos (19UL)          /*!< POST_CHANGE_DLY (Bit 19)                              */
#define EMMC_EMMC_AT_CTRL_R_REG_POST_CHANGE_DLY_Msk (0x180000UL)    /*!< POST_CHANGE_DLY (Bitfield-Mask: 0x03)                 */
#define EMMC_EMMC_AT_CTRL_R_REG_PRE_CHANGE_DLY_Pos (17UL)           /*!< PRE_CHANGE_DLY (Bit 17)                               */
#define EMMC_EMMC_AT_CTRL_R_REG_PRE_CHANGE_DLY_Msk (0x60000UL)      /*!< PRE_CHANGE_DLY (Bitfield-Mask: 0x03)                  */
#define EMMC_EMMC_AT_CTRL_R_REG_TUNE_CLK_STOP_EN_Pos (16UL)         /*!< TUNE_CLK_STOP_EN (Bit 16)                             */
#define EMMC_EMMC_AT_CTRL_R_REG_TUNE_CLK_STOP_EN_Msk (0x10000UL)    /*!< TUNE_CLK_STOP_EN (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_AT_CTRL_R_REG_SW_TUNE_EN_Pos (4UL)                /*!< SW_TUNE_EN (Bit 4)                                    */
#define EMMC_EMMC_AT_CTRL_R_REG_SW_TUNE_EN_Msk (0x10UL)             /*!< SW_TUNE_EN (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_AT_CTRL_R_REG_RPT_TUNE_ERR_Pos (3UL)              /*!< RPT_TUNE_ERR (Bit 3)                                  */
#define EMMC_EMMC_AT_CTRL_R_REG_RPT_TUNE_ERR_Msk (0x8UL)            /*!< RPT_TUNE_ERR (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_AT_CTRL_R_REG_SWIN_TH_EN_Pos (2UL)                /*!< SWIN_TH_EN (Bit 2)                                    */
#define EMMC_EMMC_AT_CTRL_R_REG_SWIN_TH_EN_Msk (0x4UL)              /*!< SWIN_TH_EN (Bitfield-Mask: 0x01)                      */
/* ==================================================  EMMC_AT_STAT_R_REG  =================================================== */
#define EMMC_EMMC_AT_STAT_R_REG_L_EDGE_PH_CODE_Pos (16UL)           /*!< L_EDGE_PH_CODE (Bit 16)                               */
#define EMMC_EMMC_AT_STAT_R_REG_L_EDGE_PH_CODE_Msk (0xff0000UL)     /*!< L_EDGE_PH_CODE (Bitfield-Mask: 0xff)                  */
#define EMMC_EMMC_AT_STAT_R_REG_R_EDGE_PH_CODE_Pos (8UL)            /*!< R_EDGE_PH_CODE (Bit 8)                                */
#define EMMC_EMMC_AT_STAT_R_REG_R_EDGE_PH_CODE_Msk (0xff00UL)       /*!< R_EDGE_PH_CODE (Bitfield-Mask: 0xff)                  */
#define EMMC_EMMC_AT_STAT_R_REG_CENTER_PH_CODE_Pos (0UL)            /*!< CENTER_PH_CODE (Bit 0)                                */
#define EMMC_EMMC_AT_STAT_R_REG_CENTER_PH_CODE_Msk (0xffUL)         /*!< CENTER_PH_CODE (Bitfield-Mask: 0xff)                  */
/* ===============================================  EMMC_AUTO_CMD_STAT_R_REG  ================================================ */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_CMD_NOT_ISSUED_AUTO_CMD12_Pos (7UL) /*!< CMD_NOT_ISSUED_AUTO_CMD12 (Bit 7)               */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_CMD_NOT_ISSUED_AUTO_CMD12_Msk (0x80UL) /*!< CMD_NOT_ISSUED_AUTO_CMD12 (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_RESP_ERR_Pos (5UL)   /*!< AUTO_CMD_RESP_ERR (Bit 5)                             */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_RESP_ERR_Msk (0x20UL) /*!< AUTO_CMD_RESP_ERR (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_IDX_ERR_Pos (4UL)    /*!< AUTO_CMD_IDX_ERR (Bit 4)                              */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_IDX_ERR_Msk (0x10UL) /*!< AUTO_CMD_IDX_ERR (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_EBIT_ERR_Pos (3UL)   /*!< AUTO_CMD_EBIT_ERR (Bit 3)                             */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_EBIT_ERR_Msk (0x8UL) /*!< AUTO_CMD_EBIT_ERR (Bitfield-Mask: 0x01)               */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_CRC_ERR_Pos (2UL)    /*!< AUTO_CMD_CRC_ERR (Bit 2)                              */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_CRC_ERR_Msk (0x4UL)  /*!< AUTO_CMD_CRC_ERR (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_TOUT_ERR_Pos (1UL)   /*!< AUTO_CMD_TOUT_ERR (Bit 1)                             */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD_TOUT_ERR_Msk (0x2UL) /*!< AUTO_CMD_TOUT_ERR (Bitfield-Mask: 0x01)               */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD12_NOT_EXEC_Pos (0UL) /*!< AUTO_CMD12_NOT_EXEC (Bit 0)                           */
#define EMMC_EMMC_AUTO_CMD_STAT_R_REG_AUTO_CMD12_NOT_EXEC_Msk (0x1UL) /*!< AUTO_CMD12_NOT_EXEC (Bitfield-Mask: 0x01)           */
/* =================================================  EMMC_BGAP_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_BGAP_CTRL_R_REG_RD_WAIT_CTRL_Pos (2UL)            /*!< RD_WAIT_CTRL (Bit 2)                                  */
#define EMMC_EMMC_BGAP_CTRL_R_REG_RD_WAIT_CTRL_Msk (0x4UL)          /*!< RD_WAIT_CTRL (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_BGAP_CTRL_R_REG_CONTINUE_REQ_Pos (1UL)            /*!< CONTINUE_REQ (Bit 1)                                  */
#define EMMC_EMMC_BGAP_CTRL_R_REG_CONTINUE_REQ_Msk (0x2UL)          /*!< CONTINUE_REQ (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_BGAP_CTRL_R_REG_STOP_BG_REQ_Pos (0UL)             /*!< STOP_BG_REQ (Bit 0)                                   */
#define EMMC_EMMC_BGAP_CTRL_R_REG_STOP_BG_REQ_Msk (0x1UL)           /*!< STOP_BG_REQ (Bitfield-Mask: 0x01)                     */
/* =================================================  EMMC_BLOCKCOUNT_R_REG  ================================================= */
#define EMMC_EMMC_BLOCKCOUNT_R_REG_BLOCK_CNT_Pos (0UL)              /*!< BLOCK_CNT (Bit 0)                                     */
#define EMMC_EMMC_BLOCKCOUNT_R_REG_BLOCK_CNT_Msk (0xffffUL)         /*!< BLOCK_CNT (Bitfield-Mask: 0xffff)                     */
/* =================================================  EMMC_BLOCKSIZE_R_REG  ================================================== */
#define EMMC_EMMC_BLOCKSIZE_R_REG_SDMA_BUF_BDARY_Pos (12UL)         /*!< SDMA_BUF_BDARY (Bit 12)                               */
#define EMMC_EMMC_BLOCKSIZE_R_REG_SDMA_BUF_BDARY_Msk (0x7000UL)     /*!< SDMA_BUF_BDARY (Bitfield-Mask: 0x07)                  */
#define EMMC_EMMC_BLOCKSIZE_R_REG_XFER_BLOCK_SIZE_Pos (0UL)         /*!< XFER_BLOCK_SIZE (Bit 0)                               */
#define EMMC_EMMC_BLOCKSIZE_R_REG_XFER_BLOCK_SIZE_Msk (0xfffUL)     /*!< XFER_BLOCK_SIZE (Bitfield-Mask: 0xfff)                */
/* =================================================  EMMC_BOOT_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_BOOT_CTRL_R_REG_BOOT_TOUT_CNT_Pos (12UL)          /*!< BOOT_TOUT_CNT (Bit 12)                                */
#define EMMC_EMMC_BOOT_CTRL_R_REG_BOOT_TOUT_CNT_Msk (0xf000UL)      /*!< BOOT_TOUT_CNT (Bitfield-Mask: 0x0f)                   */
#define EMMC_EMMC_BOOT_CTRL_R_REG_BOOT_ACK_ENABLE_Pos (8UL)         /*!< BOOT_ACK_ENABLE (Bit 8)                               */
#define EMMC_EMMC_BOOT_CTRL_R_REG_BOOT_ACK_ENABLE_Msk (0x100UL)     /*!< BOOT_ACK_ENABLE (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_BOOT_CTRL_R_REG_VALIDATE_BOOT_Pos (7UL)           /*!< VALIDATE_BOOT (Bit 7)                                 */
#define EMMC_EMMC_BOOT_CTRL_R_REG_VALIDATE_BOOT_Msk (0x80UL)        /*!< VALIDATE_BOOT (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_BOOT_CTRL_R_REG_MAN_BOOT_EN_Pos (0UL)             /*!< MAN_BOOT_EN (Bit 0)                                   */
#define EMMC_EMMC_BOOT_CTRL_R_REG_MAN_BOOT_EN_Msk (0x1UL)           /*!< MAN_BOOT_EN (Bitfield-Mask: 0x01)                     */
/* ==================================================  EMMC_BUF_DATA_R_REG  ================================================== */
#define EMMC_EMMC_BUF_DATA_R_REG_BUF_DATA_Pos (0UL)                 /*!< BUF_DATA (Bit 0)                                      */
#define EMMC_EMMC_BUF_DATA_R_REG_BUF_DATA_Msk (0xffffffffUL)        /*!< BUF_DATA (Bitfield-Mask: 0xffffffff)                  */
/* ===============================================  EMMC_CAPABILITIES1_R_REG  ================================================ */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SLOT_TYPE_R_Pos (30UL)        /*!< SLOT_TYPE_R (Bit 30)                                  */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SLOT_TYPE_R_Msk (0xc0000000UL) /*!< SLOT_TYPE_R (Bitfield-Mask: 0x03)                    */
#define EMMC_EMMC_CAPABILITIES1_R_REG_ASYNC_INT_SUPPORT_Pos (29UL)  /*!< ASYNC_INT_SUPPORT (Bit 29)                            */
#define EMMC_EMMC_CAPABILITIES1_R_REG_ASYNC_INT_SUPPORT_Msk (0x20000000UL) /*!< ASYNC_INT_SUPPORT (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SYS_ADDR_64_V3_Pos (28UL)     /*!< SYS_ADDR_64_V3 (Bit 28)                               */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SYS_ADDR_64_V3_Msk (0x10000000UL) /*!< SYS_ADDR_64_V3 (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SYS_ADDR_64_V4_Pos (27UL)     /*!< SYS_ADDR_64_V4 (Bit 27)                               */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SYS_ADDR_64_V4_Msk (0x8000000UL) /*!< SYS_ADDR_64_V4 (Bitfield-Mask: 0x01)               */
#define EMMC_EMMC_CAPABILITIES1_R_REG_VOLT_18_Pos (26UL)            /*!< VOLT_18 (Bit 26)                                      */
#define EMMC_EMMC_CAPABILITIES1_R_REG_VOLT_18_Msk (0x4000000UL)     /*!< VOLT_18 (Bitfield-Mask: 0x01)                         */
#define EMMC_EMMC_CAPABILITIES1_R_REG_VOLT_30_Pos (25UL)            /*!< VOLT_30 (Bit 25)                                      */
#define EMMC_EMMC_CAPABILITIES1_R_REG_VOLT_30_Msk (0x2000000UL)     /*!< VOLT_30 (Bitfield-Mask: 0x01)                         */
#define EMMC_EMMC_CAPABILITIES1_R_REG_VOLT_33_Pos (24UL)            /*!< VOLT_33 (Bit 24)                                      */
#define EMMC_EMMC_CAPABILITIES1_R_REG_VOLT_33_Msk (0x1000000UL)     /*!< VOLT_33 (Bitfield-Mask: 0x01)                         */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SUS_RES_SUPPORT_Pos (23UL)    /*!< SUS_RES_SUPPORT (Bit 23)                              */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SUS_RES_SUPPORT_Msk (0x800000UL) /*!< SUS_RES_SUPPORT (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SDMA_SUPPORT_Pos (22UL)       /*!< SDMA_SUPPORT (Bit 22)                                 */
#define EMMC_EMMC_CAPABILITIES1_R_REG_SDMA_SUPPORT_Msk (0x400000UL) /*!< SDMA_SUPPORT (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_CAPABILITIES1_R_REG_HIGH_SPEED_SUPPORT_Pos (21UL) /*!< HIGH_SPEED_SUPPORT (Bit 21)                           */
#define EMMC_EMMC_CAPABILITIES1_R_REG_HIGH_SPEED_SUPPORT_Msk (0x200000UL) /*!< HIGH_SPEED_SUPPORT (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_CAPABILITIES1_R_REG_ADMA2_SUPPORT_Pos (19UL)      /*!< ADMA2_SUPPORT (Bit 19)                                */
#define EMMC_EMMC_CAPABILITIES1_R_REG_ADMA2_SUPPORT_Msk (0x80000UL) /*!< ADMA2_SUPPORT (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_CAPABILITIES1_R_REG_EMBEDDED_8_BIT_Pos (18UL)     /*!< EMBEDDED_8_BIT (Bit 18)                               */
#define EMMC_EMMC_CAPABILITIES1_R_REG_EMBEDDED_8_BIT_Msk (0x40000UL) /*!< EMBEDDED_8_BIT (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_CAPABILITIES1_R_REG_MAX_BLK_LEN_Pos (16UL)        /*!< MAX_BLK_LEN (Bit 16)                                  */
#define EMMC_EMMC_CAPABILITIES1_R_REG_MAX_BLK_LEN_Msk (0x30000UL)   /*!< MAX_BLK_LEN (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_CAPABILITIES1_R_REG_BASE_CLK_FREQ_Pos (8UL)       /*!< BASE_CLK_FREQ (Bit 8)                                 */
#define EMMC_EMMC_CAPABILITIES1_R_REG_BASE_CLK_FREQ_Msk (0xff00UL)  /*!< BASE_CLK_FREQ (Bitfield-Mask: 0xff)                   */
#define EMMC_EMMC_CAPABILITIES1_R_REG_TOUT_CLK_UNIT_Pos (7UL)       /*!< TOUT_CLK_UNIT (Bit 7)                                 */
#define EMMC_EMMC_CAPABILITIES1_R_REG_TOUT_CLK_UNIT_Msk (0x80UL)    /*!< TOUT_CLK_UNIT (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_CAPABILITIES1_R_REG_TOUT_CLK_FREQ_Pos (0UL)       /*!< TOUT_CLK_FREQ (Bit 0)                                 */
#define EMMC_EMMC_CAPABILITIES1_R_REG_TOUT_CLK_FREQ_Msk (0x3fUL)    /*!< TOUT_CLK_FREQ (Bitfield-Mask: 0x3f)                   */
/* ===============================================  EMMC_CAPABILITIES2_R_REG  ================================================ */
#define EMMC_EMMC_CAPABILITIES2_R_REG_VDD2_18V_SUPPORT_Pos (28UL)   /*!< VDD2_18V_SUPPORT (Bit 28)                             */
#define EMMC_EMMC_CAPABILITIES2_R_REG_VDD2_18V_SUPPORT_Msk (0x10000000UL) /*!< VDD2_18V_SUPPORT (Bitfield-Mask: 0x01)          */
#define EMMC_EMMC_CAPABILITIES2_R_REG_ADMA3_SUPPORT_Pos (27UL)      /*!< ADMA3_SUPPORT (Bit 27)                                */
#define EMMC_EMMC_CAPABILITIES2_R_REG_ADMA3_SUPPORT_Msk (0x8000000UL) /*!< ADMA3_SUPPORT (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_CAPABILITIES2_R_REG_CLK_MUL_Pos (16UL)            /*!< CLK_MUL (Bit 16)                                      */
#define EMMC_EMMC_CAPABILITIES2_R_REG_CLK_MUL_Msk (0xff0000UL)      /*!< CLK_MUL (Bitfield-Mask: 0xff)                         */
#define EMMC_EMMC_CAPABILITIES2_R_REG_RE_TUNING_MODES_Pos (14UL)    /*!< RE_TUNING_MODES (Bit 14)                              */
#define EMMC_EMMC_CAPABILITIES2_R_REG_RE_TUNING_MODES_Msk (0xc000UL) /*!< RE_TUNING_MODES (Bitfield-Mask: 0x03)                */
#define EMMC_EMMC_CAPABILITIES2_R_REG_USE_TUNING_SDR50_Pos (13UL)   /*!< USE_TUNING_SDR50 (Bit 13)                             */
#define EMMC_EMMC_CAPABILITIES2_R_REG_USE_TUNING_SDR50_Msk (0x2000UL) /*!< USE_TUNING_SDR50 (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_CAPABILITIES2_R_REG_RETUNE_CNT_Pos (8UL)          /*!< RETUNE_CNT (Bit 8)                                    */
#define EMMC_EMMC_CAPABILITIES2_R_REG_RETUNE_CNT_Msk (0xf00UL)      /*!< RETUNE_CNT (Bitfield-Mask: 0x0f)                      */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DRV_TYPED_Pos (6UL)           /*!< DRV_TYPED (Bit 6)                                     */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DRV_TYPED_Msk (0x40UL)        /*!< DRV_TYPED (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DRV_TYPEC_Pos (5UL)           /*!< DRV_TYPEC (Bit 5)                                     */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DRV_TYPEC_Msk (0x20UL)        /*!< DRV_TYPEC (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DRV_TYPEA_Pos (4UL)           /*!< DRV_TYPEA (Bit 4)                                     */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DRV_TYPEA_Msk (0x10UL)        /*!< DRV_TYPEA (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_CAPABILITIES2_R_REG_UHS2_SUPPORT_Pos (3UL)        /*!< UHS2_SUPPORT (Bit 3)                                  */
#define EMMC_EMMC_CAPABILITIES2_R_REG_UHS2_SUPPORT_Msk (0x8UL)      /*!< UHS2_SUPPORT (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DDR50_SUPPORT_Pos (2UL)       /*!< DDR50_SUPPORT (Bit 2)                                 */
#define EMMC_EMMC_CAPABILITIES2_R_REG_DDR50_SUPPORT_Msk (0x4UL)     /*!< DDR50_SUPPORT (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_CAPABILITIES2_R_REG_SDR104_SUPPORT_Pos (1UL)      /*!< SDR104_SUPPORT (Bit 1)                                */
#define EMMC_EMMC_CAPABILITIES2_R_REG_SDR104_SUPPORT_Msk (0x2UL)    /*!< SDR104_SUPPORT (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_CAPABILITIES2_R_REG_SDR50_SUPPORT_Pos (0UL)       /*!< SDR50_SUPPORT (Bit 0)                                 */
#define EMMC_EMMC_CAPABILITIES2_R_REG_SDR50_SUPPORT_Msk (0x1UL)     /*!< SDR50_SUPPORT (Bitfield-Mask: 0x01)                   */
/* ==================================================  EMMC_CLK_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_CLK_CTRL_R_REG_FREQ_SEL_Pos (8UL)                 /*!< FREQ_SEL (Bit 8)                                      */
#define EMMC_EMMC_CLK_CTRL_R_REG_FREQ_SEL_Msk (0xff00UL)            /*!< FREQ_SEL (Bitfield-Mask: 0xff)                        */
#define EMMC_EMMC_CLK_CTRL_R_REG_UPPER_FREQ_SEL_Pos (6UL)           /*!< UPPER_FREQ_SEL (Bit 6)                                */
#define EMMC_EMMC_CLK_CTRL_R_REG_UPPER_FREQ_SEL_Msk (0xc0UL)        /*!< UPPER_FREQ_SEL (Bitfield-Mask: 0x03)                  */
#define EMMC_EMMC_CLK_CTRL_R_REG_CLK_GEN_SELECT_Pos (5UL)           /*!< CLK_GEN_SELECT (Bit 5)                                */
#define EMMC_EMMC_CLK_CTRL_R_REG_CLK_GEN_SELECT_Msk (0x20UL)        /*!< CLK_GEN_SELECT (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_CLK_CTRL_R_REG_PLL_ENABLE_Pos (3UL)               /*!< PLL_ENABLE (Bit 3)                                    */
#define EMMC_EMMC_CLK_CTRL_R_REG_PLL_ENABLE_Msk (0x8UL)             /*!< PLL_ENABLE (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_CLK_CTRL_R_REG_SD_CLK_EN_Pos (2UL)                /*!< SD_CLK_EN (Bit 2)                                     */
#define EMMC_EMMC_CLK_CTRL_R_REG_SD_CLK_EN_Msk (0x4UL)              /*!< SD_CLK_EN (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_CLK_CTRL_R_REG_INTERNAL_CLK_STABLE_Pos (1UL)      /*!< INTERNAL_CLK_STABLE (Bit 1)                           */
#define EMMC_EMMC_CLK_CTRL_R_REG_INTERNAL_CLK_STABLE_Msk (0x2UL)    /*!< INTERNAL_CLK_STABLE (Bitfield-Mask: 0x01)             */
#define EMMC_EMMC_CLK_CTRL_R_REG_INTERNAL_CLK_EN_Pos (0UL)          /*!< INTERNAL_CLK_EN (Bit 0)                               */
#define EMMC_EMMC_CLK_CTRL_R_REG_INTERNAL_CLK_EN_Msk (0x1UL)        /*!< INTERNAL_CLK_EN (Bitfield-Mask: 0x01)                 */
/* ====================================================  EMMC_CMD_R_REG  ===================================================== */
#define EMMC_EMMC_CMD_R_REG_CMD_INDEX_Pos (8UL)                     /*!< CMD_INDEX (Bit 8)                                     */
#define EMMC_EMMC_CMD_R_REG_CMD_INDEX_Msk (0x3f00UL)                /*!< CMD_INDEX (Bitfield-Mask: 0x3f)                       */
#define EMMC_EMMC_CMD_R_REG_CMD_TYPE_Pos  (6UL)                     /*!< CMD_TYPE (Bit 6)                                      */
#define EMMC_EMMC_CMD_R_REG_CMD_TYPE_Msk  (0xc0UL)                  /*!< CMD_TYPE (Bitfield-Mask: 0x03)                        */
#define EMMC_EMMC_CMD_R_REG_DATA_PRESENT_SEL_Pos (5UL)              /*!< DATA_PRESENT_SEL (Bit 5)                              */
#define EMMC_EMMC_CMD_R_REG_DATA_PRESENT_SEL_Msk (0x20UL)           /*!< DATA_PRESENT_SEL (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_CMD_R_REG_CMD_IDX_CHK_ENABLE_Pos (4UL)            /*!< CMD_IDX_CHK_ENABLE (Bit 4)                            */
#define EMMC_EMMC_CMD_R_REG_CMD_IDX_CHK_ENABLE_Msk (0x10UL)         /*!< CMD_IDX_CHK_ENABLE (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_CMD_R_REG_CMD_CRC_CHK_ENABLE_Pos (3UL)            /*!< CMD_CRC_CHK_ENABLE (Bit 3)                            */
#define EMMC_EMMC_CMD_R_REG_CMD_CRC_CHK_ENABLE_Msk (0x8UL)          /*!< CMD_CRC_CHK_ENABLE (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_CMD_R_REG_SUB_CMD_FLAG_Pos (2UL)                  /*!< SUB_CMD_FLAG (Bit 2)                                  */
#define EMMC_EMMC_CMD_R_REG_SUB_CMD_FLAG_Msk (0x4UL)                /*!< SUB_CMD_FLAG (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_CMD_R_REG_RESP_TYPE_SELECT_Pos (0UL)              /*!< RESP_TYPE_SELECT (Bit 0)                              */
#define EMMC_EMMC_CMD_R_REG_RESP_TYPE_SELECT_Msk (0x3UL)            /*!< RESP_TYPE_SELECT (Bitfield-Mask: 0x03)                */
/* ====================================================  EMMC_CQCAP_REG  ===================================================== */
#define EMMC_EMMC_CQCAP_REG_CRYPTO_SUPPORT_Pos (28UL)               /*!< CRYPTO_SUPPORT (Bit 28)                               */
#define EMMC_EMMC_CQCAP_REG_CRYPTO_SUPPORT_Msk (0x10000000UL)       /*!< CRYPTO_SUPPORT (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_CQCAP_REG_CQCCAP_RSVD2_Pos (16UL)                 /*!< CQCCAP_RSVD2 (Bit 16)                                 */
#define EMMC_EMMC_CQCAP_REG_CQCCAP_RSVD2_Msk (0xfff0000UL)          /*!< CQCCAP_RSVD2 (Bitfield-Mask: 0xfff)                   */
#define EMMC_EMMC_CQCAP_REG_ITCFMUL_Pos   (12UL)                    /*!< ITCFMUL (Bit 12)                                      */
#define EMMC_EMMC_CQCAP_REG_ITCFMUL_Msk   (0xf000UL)                /*!< ITCFMUL (Bitfield-Mask: 0x0f)                         */
#define EMMC_EMMC_CQCAP_REG_ITCFVAL_Pos   (0UL)                     /*!< ITCFVAL (Bit 0)                                       */
#define EMMC_EMMC_CQCAP_REG_ITCFVAL_Msk   (0x3ffUL)                 /*!< ITCFVAL (Bitfield-Mask: 0x3ff)                        */
/* ====================================================  EMMC_CTRL_R_REG  ==================================================== */
#define EMMC_EMMC_CTRL_R_REG_SW_CG_DIS_Pos (4UL)                    /*!< SW_CG_DIS (Bit 4)                                     */
#define EMMC_EMMC_CTRL_R_REG_SW_CG_DIS_Msk (0x10UL)                 /*!< SW_CG_DIS (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_CTRL_R_REG_CMD_CONFLICT_CHECK_Pos (0UL)           /*!< CMD_CONFLICT_CHECK (Bit 0)                            */
#define EMMC_EMMC_CTRL_R_REG_CMD_CONFLICT_CHECK_Msk (0x1UL)         /*!< CMD_CONFLICT_CHECK (Bitfield-Mask: 0x01)              */
/* =============================================  EMMC_CURR_CAPABILITIES1_R_REG  ============================================= */
#define EMMC_EMMC_CURR_CAPABILITIES1_R_REG_MAX_CUR_18V_Pos (16UL)   /*!< MAX_CUR_18V (Bit 16)                                  */
#define EMMC_EMMC_CURR_CAPABILITIES1_R_REG_MAX_CUR_18V_Msk (0xff0000UL) /*!< MAX_CUR_18V (Bitfield-Mask: 0xff)                 */
#define EMMC_EMMC_CURR_CAPABILITIES1_R_REG_MAX_CUR_30V_Pos (8UL)    /*!< MAX_CUR_30V (Bit 8)                                   */
#define EMMC_EMMC_CURR_CAPABILITIES1_R_REG_MAX_CUR_30V_Msk (0xff00UL) /*!< MAX_CUR_30V (Bitfield-Mask: 0xff)                   */
