antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define EMMC_EMMC_CURR_CAPABILITIES1_R_REG_MAX_CUR_33V_Pos (0UL)    /*!< MAX_CUR_33V (Bit 0)                                   */
#define EMMC_EMMC_CURR_CAPABILITIES1_R_REG_MAX_CUR_33V_Msk (0xffUL) /*!< MAX_CUR_33V (Bitfield-Mask: 0xff)                     */
/* =============================================  EMMC_CURR_CAPABILITIES2_R_REG  ============================================= */
#define EMMC_EMMC_CURR_CAPABILITIES2_R_REG_MAX_CUR_VDD2_18V_Pos (0UL) /*!< MAX_CUR_VDD2_18V (Bit 0)                            */
#define EMMC_EMMC_CURR_CAPABILITIES2_R_REG_MAX_CUR_VDD2_18V_Msk (0xffUL) /*!< MAX_CUR_VDD2_18V (Bitfield-Mask: 0xff)           */
/* ===============================================  EMMC_EMBEDDED_CTRL_R_REG  ================================================ */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_BACK_END_PWR_CTRL_Pos (24UL)  /*!< BACK_END_PWR_CTRL (Bit 24)                            */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_BACK_END_PWR_CTRL_Msk (0x7f000000UL) /*!< BACK_END_PWR_CTRL (Bitfield-Mask: 0x7f)        */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_INT_PIN_SEL_Pos (20UL)        /*!< INT_PIN_SEL (Bit 20)                                  */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_INT_PIN_SEL_Msk (0x700000UL)  /*!< INT_PIN_SEL (Bitfield-Mask: 0x07)                     */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_CLK_PIN_SEL_Pos (16UL)        /*!< CLK_PIN_SEL (Bit 16)                                  */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_CLK_PIN_SEL_Msk (0x70000UL)   /*!< CLK_PIN_SEL (Bitfield-Mask: 0x07)                     */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_BUS_WIDTH_PRESET_Pos (8UL)    /*!< BUS_WIDTH_PRESET (Bit 8)                              */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_BUS_WIDTH_PRESET_Msk (0x7f00UL) /*!< BUS_WIDTH_PRESET (Bitfield-Mask: 0x7f)              */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_NUM_INT_PIN_Pos (4UL)         /*!< NUM_INT_PIN (Bit 4)                                   */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_NUM_INT_PIN_Msk (0x30UL)      /*!< NUM_INT_PIN (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_NUM_CLK_PIN_Pos (0UL)         /*!< NUM_CLK_PIN (Bit 0)                                   */
#define EMMC_EMMC_EMBEDDED_CTRL_R_REG_NUM_CLK_PIN_Msk (0x7UL)       /*!< NUM_CLK_PIN (Bitfield-Mask: 0x07)                     */
/* =================================================  EMMC_EMMC_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_EMMC_CTRL_R_REG_EMMC_RST_N_OE_Pos (3UL)           /*!< EMMC_RST_N_OE (Bit 3)                                 */
#define EMMC_EMMC_EMMC_CTRL_R_REG_EMMC_RST_N_OE_Msk (0x8UL)         /*!< EMMC_RST_N_OE (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_EMMC_CTRL_R_REG_EMMC_RST_N_Pos (2UL)              /*!< EMMC_RST_N (Bit 2)                                    */
#define EMMC_EMMC_EMMC_CTRL_R_REG_EMMC_RST_N_Msk (0x4UL)            /*!< EMMC_RST_N (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_EMMC_CTRL_R_REG_DISABLE_DATA_CRC_CHK_Pos (1UL)    /*!< DISABLE_DATA_CRC_CHK (Bit 1)                          */
#define EMMC_EMMC_EMMC_CTRL_R_REG_DISABLE_DATA_CRC_CHK_Msk (0x2UL)  /*!< DISABLE_DATA_CRC_CHK (Bitfield-Mask: 0x01)            */
#define EMMC_EMMC_EMMC_CTRL_R_REG_CARD_IS_EMMC_Pos (0UL)            /*!< CARD_IS_EMMC (Bit 0)                                  */
#define EMMC_EMMC_EMMC_CTRL_R_REG_CARD_IS_EMMC_Msk (0x1UL)          /*!< CARD_IS_EMMC (Bitfield-Mask: 0x01)                    */
/* ============================================  EMMC_ERROR_INT_SIGNAL_EN_R_REG  ============================================= */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_VENDOR_ERR_SIGNAL_EN3_Pos (15UL) /*!< VENDOR_ERR_SIGNAL_EN3 (Bit 15)               */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_VENDOR_ERR_SIGNAL_EN3_Msk (0x8000UL) /*!< VENDOR_ERR_SIGNAL_EN3 (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_VENDOR_ERR_SIGNAL_EN2_Pos (14UL) /*!< VENDOR_ERR_SIGNAL_EN2 (Bit 14)               */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_VENDOR_ERR_SIGNAL_EN2_Msk (0x4000UL) /*!< VENDOR_ERR_SIGNAL_EN2 (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_VENDOR_ERR_SIGNAL_EN1_Pos (13UL) /*!< VENDOR_ERR_SIGNAL_EN1 (Bit 13)               */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_VENDOR_ERR_SIGNAL_EN1_Msk (0x2000UL) /*!< VENDOR_ERR_SIGNAL_EN1 (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_BOOT_ACK_ERR_SIGNAL_EN_Pos (12UL) /*!< BOOT_ACK_ERR_SIGNAL_EN (Bit 12)             */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_BOOT_ACK_ERR_SIGNAL_EN_Msk (0x1000UL) /*!< BOOT_ACK_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_RESP_ERR_SIGNAL_EN_Pos (11UL) /*!< RESP_ERR_SIGNAL_EN (Bit 11)                     */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_RESP_ERR_SIGNAL_EN_Msk (0x800UL) /*!< RESP_ERR_SIGNAL_EN (Bitfield-Mask: 0x01)     */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_TUNING_ERR_SIGNAL_EN_Pos (10UL) /*!< TUNING_ERR_SIGNAL_EN (Bit 10)                 */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_TUNING_ERR_SIGNAL_EN_Msk (0x400UL) /*!< TUNING_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_ADMA_ERR_SIGNAL_EN_Pos (9UL) /*!< ADMA_ERR_SIGNAL_EN (Bit 9)                       */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_ADMA_ERR_SIGNAL_EN_Msk (0x200UL) /*!< ADMA_ERR_SIGNAL_EN (Bitfield-Mask: 0x01)     */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_AUTO_CMD_ERR_SIGNAL_EN_Pos (8UL) /*!< AUTO_CMD_ERR_SIGNAL_EN (Bit 8)               */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_AUTO_CMD_ERR_SIGNAL_EN_Msk (0x100UL) /*!< AUTO_CMD_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CUR_LMT_ERR_SIGNAL_EN_Pos (7UL) /*!< CUR_LMT_ERR_SIGNAL_EN (Bit 7)                 */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CUR_LMT_ERR_SIGNAL_EN_Msk (0x80UL) /*!< CUR_LMT_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_DATA_END_BIT_ERR_SIGNAL_EN_Pos (6UL) /*!< DATA_END_BIT_ERR_SIGNAL_EN (Bit 6)       */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_DATA_END_BIT_ERR_SIGNAL_EN_Msk (0x40UL) /*!< DATA_END_BIT_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_DATA_CRC_ERR_SIGNAL_EN_Pos (5UL) /*!< DATA_CRC_ERR_SIGNAL_EN (Bit 5)               */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_DATA_CRC_ERR_SIGNAL_EN_Msk (0x20UL) /*!< DATA_CRC_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_DATA_TOUT_ERR_SIGNAL_EN_Pos (4UL) /*!< DATA_TOUT_ERR_SIGNAL_EN (Bit 4)             */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_DATA_TOUT_ERR_SIGNAL_EN_Msk (0x10UL) /*!< DATA_TOUT_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_IDX_ERR_SIGNAL_EN_Pos (3UL) /*!< CMD_IDX_ERR_SIGNAL_EN (Bit 3)                 */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_IDX_ERR_SIGNAL_EN_Msk (0x8UL) /*!< CMD_IDX_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_END_BIT_ERR_SIGNAL_EN_Pos (2UL) /*!< CMD_END_BIT_ERR_SIGNAL_EN (Bit 2)         */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_END_BIT_ERR_SIGNAL_EN_Msk (0x4UL) /*!< CMD_END_BIT_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_CRC_ERR_SIGNAL_EN_Pos (1UL) /*!< CMD_CRC_ERR_SIGNAL_EN (Bit 1)                 */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_CRC_ERR_SIGNAL_EN_Msk (0x2UL) /*!< CMD_CRC_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_TOUT_ERR_SIGNAL_EN_Pos (0UL) /*!< CMD_TOUT_ERR_SIGNAL_EN (Bit 0)               */
#define EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_REG_CMD_TOUT_ERR_SIGNAL_EN_Msk (0x1UL) /*!< CMD_TOUT_ERR_SIGNAL_EN (Bitfield-Mask: 0x01) */
/* =============================================  EMMC_ERROR_INT_STAT_EN_R_REG  ============================================== */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_VENDOR_ERR_STAT_EN3_Pos (15UL) /*!< VENDOR_ERR_STAT_EN3 (Bit 15)                     */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_VENDOR_ERR_STAT_EN3_Msk (0x8000UL) /*!< VENDOR_ERR_STAT_EN3 (Bitfield-Mask: 0x01)    */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_VENDOR_ERR_STAT_EN2_Pos (14UL) /*!< VENDOR_ERR_STAT_EN2 (Bit 14)                     */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_VENDOR_ERR_STAT_EN2_Msk (0x4000UL) /*!< VENDOR_ERR_STAT_EN2 (Bitfield-Mask: 0x01)    */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_VENDOR_ERR_STAT_EN1_Pos (13UL) /*!< VENDOR_ERR_STAT_EN1 (Bit 13)                     */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_VENDOR_ERR_STAT_EN1_Msk (0x2000UL) /*!< VENDOR_ERR_STAT_EN1 (Bitfield-Mask: 0x01)    */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_BOOT_ACK_ERR_STAT_EN_Pos (12UL) /*!< BOOT_ACK_ERR_STAT_EN (Bit 12)                   */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_BOOT_ACK_ERR_STAT_EN_Msk (0x1000UL) /*!< BOOT_ACK_ERR_STAT_EN (Bitfield-Mask: 0x01)  */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_RESP_ERR_STAT_EN_Pos (11UL) /*!< RESP_ERR_STAT_EN (Bit 11)                           */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_RESP_ERR_STAT_EN_Msk (0x800UL) /*!< RESP_ERR_STAT_EN (Bitfield-Mask: 0x01)           */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_TUNING_ERR_STAT_EN_Pos (10UL) /*!< TUNING_ERR_STAT_EN (Bit 10)                       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_TUNING_ERR_STAT_EN_Msk (0x400UL) /*!< TUNING_ERR_STAT_EN (Bitfield-Mask: 0x01)       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_ADMA_ERR_STAT_EN_Pos (9UL) /*!< ADMA_ERR_STAT_EN (Bit 9)                             */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_ADMA_ERR_STAT_EN_Msk (0x200UL) /*!< ADMA_ERR_STAT_EN (Bitfield-Mask: 0x01)           */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_AUTO_CMD_ERR_STAT_EN_Pos (8UL) /*!< AUTO_CMD_ERR_STAT_EN (Bit 8)                     */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_AUTO_CMD_ERR_STAT_EN_Msk (0x100UL) /*!< AUTO_CMD_ERR_STAT_EN (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CUR_LMT_ERR_STAT_EN_Pos (7UL) /*!< CUR_LMT_ERR_STAT_EN (Bit 7)                       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CUR_LMT_ERR_STAT_EN_Msk (0x80UL) /*!< CUR_LMT_ERR_STAT_EN (Bitfield-Mask: 0x01)      */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_DATA_END_BIT_ERR_STAT_EN_Pos (6UL) /*!< DATA_END_BIT_ERR_STAT_EN (Bit 6)             */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_DATA_END_BIT_ERR_STAT_EN_Msk (0x40UL) /*!< DATA_END_BIT_ERR_STAT_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_DATA_CRC_ERR_STAT_EN_Pos (5UL) /*!< DATA_CRC_ERR_STAT_EN (Bit 5)                     */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_DATA_CRC_ERR_STAT_EN_Msk (0x20UL) /*!< DATA_CRC_ERR_STAT_EN (Bitfield-Mask: 0x01)    */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_DATA_TOUT_ERR_STAT_EN_Pos (4UL) /*!< DATA_TOUT_ERR_STAT_EN (Bit 4)                   */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_DATA_TOUT_ERR_STAT_EN_Msk (0x10UL) /*!< DATA_TOUT_ERR_STAT_EN (Bitfield-Mask: 0x01)  */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_IDX_ERR_STAT_EN_Pos (3UL) /*!< CMD_IDX_ERR_STAT_EN (Bit 3)                       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_IDX_ERR_STAT_EN_Msk (0x8UL) /*!< CMD_IDX_ERR_STAT_EN (Bitfield-Mask: 0x01)       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_END_BIT_ERR_STAT_EN_Pos (2UL) /*!< CMD_END_BIT_ERR_STAT_EN (Bit 2)               */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_END_BIT_ERR_STAT_EN_Msk (0x4UL) /*!< CMD_END_BIT_ERR_STAT_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_CRC_ERR_STAT_EN_Pos (1UL) /*!< CMD_CRC_ERR_STAT_EN (Bit 1)                       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_CRC_ERR_STAT_EN_Msk (0x2UL) /*!< CMD_CRC_ERR_STAT_EN (Bitfield-Mask: 0x01)       */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_TOUT_ERR_STAT_EN_Pos (0UL) /*!< CMD_TOUT_ERR_STAT_EN (Bit 0)                     */
#define EMMC_EMMC_ERROR_INT_STAT_EN_R_REG_CMD_TOUT_ERR_STAT_EN_Msk (0x1UL) /*!< CMD_TOUT_ERR_STAT_EN (Bitfield-Mask: 0x01)     */
/* ===============================================  EMMC_ERROR_INT_STAT_R_REG  =============================================== */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_BOOT_ACK_ERR_Pos (12UL)      /*!< BOOT_ACK_ERR (Bit 12)                                 */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_BOOT_ACK_ERR_Msk (0x1000UL)  /*!< BOOT_ACK_ERR (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_RESP_ERR_Pos (11UL)          /*!< RESP_ERR (Bit 11)                                     */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_RESP_ERR_Msk (0x800UL)       /*!< RESP_ERR (Bitfield-Mask: 0x01)                        */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_TUNING_ERR_Pos (10UL)        /*!< TUNING_ERR (Bit 10)                                   */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_TUNING_ERR_Msk (0x400UL)     /*!< TUNING_ERR (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_ADMA_ERR_Pos (9UL)           /*!< ADMA_ERR (Bit 9)                                      */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_ADMA_ERR_Msk (0x200UL)       /*!< ADMA_ERR (Bitfield-Mask: 0x01)                        */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_AUTO_CMD_ERR_Pos (8UL)       /*!< AUTO_CMD_ERR (Bit 8)                                  */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_AUTO_CMD_ERR_Msk (0x100UL)   /*!< AUTO_CMD_ERR (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CUR_LMT_ERR_Pos (7UL)        /*!< CUR_LMT_ERR (Bit 7)                                   */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CUR_LMT_ERR_Msk (0x80UL)     /*!< CUR_LMT_ERR (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_DATA_END_BIT_ERR_Pos (6UL)   /*!< DATA_END_BIT_ERR (Bit 6)                              */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_DATA_END_BIT_ERR_Msk (0x40UL) /*!< DATA_END_BIT_ERR (Bitfield-Mask: 0x01)               */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_DATA_CRC_ERR_Pos (5UL)       /*!< DATA_CRC_ERR (Bit 5)                                  */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_DATA_CRC_ERR_Msk (0x20UL)    /*!< DATA_CRC_ERR (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_DATA_TOUT_ERR_Pos (4UL)      /*!< DATA_TOUT_ERR (Bit 4)                                 */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_DATA_TOUT_ERR_Msk (0x10UL)   /*!< DATA_TOUT_ERR (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_IDX_ERR_Pos (3UL)        /*!< CMD_IDX_ERR (Bit 3)                                   */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_IDX_ERR_Msk (0x8UL)      /*!< CMD_IDX_ERR (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_END_BIT_ERR_Pos (2UL)    /*!< CMD_END_BIT_ERR (Bit 2)                               */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_END_BIT_ERR_Msk (0x4UL)  /*!< CMD_END_BIT_ERR (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_CRC_ERR_Pos (1UL)        /*!< CMD_CRC_ERR (Bit 1)                                   */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_CRC_ERR_Msk (0x2UL)      /*!< CMD_CRC_ERR (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_TOUT_ERR_Pos (0UL)       /*!< CMD_TOUT_ERR (Bit 0)                                  */
#define EMMC_EMMC_ERROR_INT_STAT_R_REG_CMD_TOUT_ERR_Msk (0x1UL)     /*!< CMD_TOUT_ERR (Bitfield-Mask: 0x01)                    */
/* ============================================  EMMC_FORCE_AUTO_CMD_STAT_R_REG  ============================================= */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_Pos (7UL) /*!< FORCE_CMD_NOT_ISSUED_AUTO_CMD12 (Bit 7) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_CMD_NOT_ISSUED_AUTO_CMD12_Msk (0x80UL) /*!< FORCE_CMD_NOT_ISSUED_AUTO_CMD12 (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_RESP_ERR_Pos (5UL) /*!< FORCE_AUTO_CMD_RESP_ERR (Bit 5)             */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_RESP_ERR_Msk (0x20UL) /*!< FORCE_AUTO_CMD_RESP_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_IDX_ERR_Pos (4UL) /*!< FORCE_AUTO_CMD_IDX_ERR (Bit 4)               */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_IDX_ERR_Msk (0x10UL) /*!< FORCE_AUTO_CMD_IDX_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_EBIT_ERR_Pos (3UL) /*!< FORCE_AUTO_CMD_EBIT_ERR (Bit 3)             */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_EBIT_ERR_Msk (0x8UL) /*!< FORCE_AUTO_CMD_EBIT_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_CRC_ERR_Pos (2UL) /*!< FORCE_AUTO_CMD_CRC_ERR (Bit 2)               */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_CRC_ERR_Msk (0x4UL) /*!< FORCE_AUTO_CMD_CRC_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_TOUT_ERR_Pos (1UL) /*!< FORCE_AUTO_CMD_TOUT_ERR (Bit 1)             */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD_TOUT_ERR_Msk (0x2UL) /*!< FORCE_AUTO_CMD_TOUT_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD12_NOT_EXEC_Pos (0UL) /*!< FORCE_AUTO_CMD12_NOT_EXEC (Bit 0)         */
#define EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_REG_FORCE_AUTO_CMD12_NOT_EXEC_Msk (0x1UL) /*!< FORCE_AUTO_CMD12_NOT_EXEC (Bitfield-Mask: 0x01) */
/* ============================================  EMMC_FORCE_ERROR_INT_STAT_R_REG  ============================================ */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_VENDOR_ERR3_Pos (15UL) /*!< FORCE_VENDOR_ERR3 (Bit 15)                      */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_VENDOR_ERR3_Msk (0x8000UL) /*!< FORCE_VENDOR_ERR3 (Bitfield-Mask: 0x01)     */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_VENDOR_ERR2_Pos (14UL) /*!< FORCE_VENDOR_ERR2 (Bit 14)                      */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_VENDOR_ERR2_Msk (0x4000UL) /*!< FORCE_VENDOR_ERR2 (Bitfield-Mask: 0x01)     */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_VENDOR_ERR1_Pos (13UL) /*!< FORCE_VENDOR_ERR1 (Bit 13)                      */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_VENDOR_ERR1_Msk (0x2000UL) /*!< FORCE_VENDOR_ERR1 (Bitfield-Mask: 0x01)     */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_BOOT_ACK_ERR_Pos (12UL) /*!< FORCE_BOOT_ACK_ERR (Bit 12)                    */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_BOOT_ACK_ERR_Msk (0x1000UL) /*!< FORCE_BOOT_ACK_ERR (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_RESP_ERR_Pos (11UL) /*!< FORCE_RESP_ERR (Bit 11)                            */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_RESP_ERR_Msk (0x800UL) /*!< FORCE_RESP_ERR (Bitfield-Mask: 0x01)            */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_TUNING_ERR_Pos (10UL) /*!< FORCE_TUNING_ERR (Bit 10)                        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_TUNING_ERR_Msk (0x400UL) /*!< FORCE_TUNING_ERR (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_ADMA_ERR_Pos (9UL) /*!< FORCE_ADMA_ERR (Bit 9)                              */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_ADMA_ERR_Msk (0x200UL) /*!< FORCE_ADMA_ERR (Bitfield-Mask: 0x01)            */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_AUTO_CMD_ERR_Pos (8UL) /*!< FORCE_AUTO_CMD_ERR (Bit 8)                      */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_AUTO_CMD_ERR_Msk (0x100UL) /*!< FORCE_AUTO_CMD_ERR (Bitfield-Mask: 0x01)    */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CUR_LMT_ERR_Pos (7UL) /*!< FORCE_CUR_LMT_ERR (Bit 7)                        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CUR_LMT_ERR_Msk (0x80UL) /*!< FORCE_CUR_LMT_ERR (Bitfield-Mask: 0x01)       */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_DATA_END_BIT_ERR_Pos (6UL) /*!< FORCE_DATA_END_BIT_ERR (Bit 6)              */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_DATA_END_BIT_ERR_Msk (0x40UL) /*!< FORCE_DATA_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_DATA_CRC_ERR_Pos (5UL) /*!< FORCE_DATA_CRC_ERR (Bit 5)                      */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_DATA_CRC_ERR_Msk (0x20UL) /*!< FORCE_DATA_CRC_ERR (Bitfield-Mask: 0x01)     */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_DATA_TOUT_ERR_Pos (4UL) /*!< FORCE_DATA_TOUT_ERR (Bit 4)                    */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_DATA_TOUT_ERR_Msk (0x10UL) /*!< FORCE_DATA_TOUT_ERR (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_IDX_ERR_Pos (3UL) /*!< FORCE_CMD_IDX_ERR (Bit 3)                        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_IDX_ERR_Msk (0x8UL) /*!< FORCE_CMD_IDX_ERR (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_END_BIT_ERR_Pos (2UL) /*!< FORCE_CMD_END_BIT_ERR (Bit 2)                */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_END_BIT_ERR_Msk (0x4UL) /*!< FORCE_CMD_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_CRC_ERR_Pos (1UL) /*!< FORCE_CMD_CRC_ERR (Bit 1)                        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_CRC_ERR_Msk (0x2UL) /*!< FORCE_CMD_CRC_ERR (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_TOUT_ERR_Pos (0UL) /*!< FORCE_CMD_TOUT_ERR (Bit 0)                      */
#define EMMC_EMMC_FORCE_ERROR_INT_STAT_R_REG_FORCE_CMD_TOUT_ERR_Msk (0x1UL) /*!< FORCE_CMD_TOUT_ERR (Bitfield-Mask: 0x01)      */
/* ==============================================  EMMC_HOST_CNTRL_VERS_R_REG  =============================================== */
#define EMMC_EMMC_HOST_CNTRL_VERS_R_REG_VENDOR_VERSION_NUM_Pos (8UL) /*!< VENDOR_VERSION_NUM (Bit 8)                           */
#define EMMC_EMMC_HOST_CNTRL_VERS_R_REG_VENDOR_VERSION_NUM_Msk (0xff00UL) /*!< VENDOR_VERSION_NUM (Bitfield-Mask: 0xff)        */
#define EMMC_EMMC_HOST_CNTRL_VERS_R_REG_SPEC_VERSION_NUM_Pos (0UL)  /*!< SPEC_VERSION_NUM (Bit 0)                              */
#define EMMC_EMMC_HOST_CNTRL_VERS_R_REG_SPEC_VERSION_NUM_Msk (0xffUL) /*!< SPEC_VERSION_NUM (Bitfield-Mask: 0xff)              */
/* =================================================  EMMC_HOST_CTRL1_R_REG  ================================================= */
#define EMMC_EMMC_HOST_CTRL1_R_REG_CARD_DETECT_SIG_SEL_Pos (7UL)    /*!< CARD_DETECT_SIG_SEL (Bit 7)                           */
#define EMMC_EMMC_HOST_CTRL1_R_REG_CARD_DETECT_SIG_SEL_Msk (0x80UL) /*!< CARD_DETECT_SIG_SEL (Bitfield-Mask: 0x01)             */
#define EMMC_EMMC_HOST_CTRL1_R_REG_CARD_DETECT_TEST_LVL_Pos (6UL)   /*!< CARD_DETECT_TEST_LVL (Bit 6)                          */
#define EMMC_EMMC_HOST_CTRL1_R_REG_CARD_DETECT_TEST_LVL_Msk (0x40UL) /*!< CARD_DETECT_TEST_LVL (Bitfield-Mask: 0x01)           */
#define EMMC_EMMC_HOST_CTRL1_R_REG_EXT_DAT_XFER_Pos (5UL)           /*!< EXT_DAT_XFER (Bit 5)                                  */
#define EMMC_EMMC_HOST_CTRL1_R_REG_EXT_DAT_XFER_Msk (0x20UL)        /*!< EXT_DAT_XFER (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_HOST_CTRL1_R_REG_DMA_SEL_Pos (3UL)                /*!< DMA_SEL (Bit 3)                                       */
#define EMMC_EMMC_HOST_CTRL1_R_REG_DMA_SEL_Msk (0x18UL)             /*!< DMA_SEL (Bitfield-Mask: 0x03)                         */
#define EMMC_EMMC_HOST_CTRL1_R_REG_HIGH_SPEED_EN_Pos (2UL)          /*!< HIGH_SPEED_EN (Bit 2)                                 */
