antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define EMMC_EMMC_HOST_CTRL1_R_REG_HIGH_SPEED_EN_Msk (0x4UL)        /*!< HIGH_SPEED_EN (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_HOST_CTRL1_R_REG_DAT_XFER_WIDTH_Pos (1UL)         /*!< DAT_XFER_WIDTH (Bit 1)                                */
#define EMMC_EMMC_HOST_CTRL1_R_REG_DAT_XFER_WIDTH_Msk (0x2UL)       /*!< DAT_XFER_WIDTH (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_HOST_CTRL1_R_REG_LED_CTRL_Pos (0UL)               /*!< LED_CTRL (Bit 0)                                      */
#define EMMC_EMMC_HOST_CTRL1_R_REG_LED_CTRL_Msk (0x1UL)             /*!< LED_CTRL (Bitfield-Mask: 0x01)                        */
/* =================================================  EMMC_HOST_CTRL2_R_REG  ================================================= */
#define EMMC_EMMC_HOST_CTRL2_R_REG_PRESET_VAL_ENABLE_Pos (15UL)     /*!< PRESET_VAL_ENABLE (Bit 15)                            */
#define EMMC_EMMC_HOST_CTRL2_R_REG_PRESET_VAL_ENABLE_Msk (0x8000UL) /*!< PRESET_VAL_ENABLE (Bitfield-Mask: 0x01)               */
#define EMMC_EMMC_HOST_CTRL2_R_REG_ASYNC_INT_ENABLE_Pos (14UL)      /*!< ASYNC_INT_ENABLE (Bit 14)                             */
#define EMMC_EMMC_HOST_CTRL2_R_REG_ASYNC_INT_ENABLE_Msk (0x4000UL)  /*!< ASYNC_INT_ENABLE (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_HOST_CTRL2_R_REG_ADDRESSING_Pos (13UL)            /*!< ADDRESSING (Bit 13)                                   */
#define EMMC_EMMC_HOST_CTRL2_R_REG_ADDRESSING_Msk (0x2000UL)        /*!< ADDRESSING (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_HOST_CTRL2_R_REG_HOST_VER4_ENABLE_Pos (12UL)      /*!< HOST_VER4_ENABLE (Bit 12)                             */
#define EMMC_EMMC_HOST_CTRL2_R_REG_HOST_VER4_ENABLE_Msk (0x1000UL)  /*!< HOST_VER4_ENABLE (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_HOST_CTRL2_R_REG_CMD23_ENABLE_Pos (11UL)          /*!< CMD23_ENABLE (Bit 11)                                 */
#define EMMC_EMMC_HOST_CTRL2_R_REG_CMD23_ENABLE_Msk (0x800UL)       /*!< CMD23_ENABLE (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_HOST_CTRL2_R_REG_ADMA2_LEN_MODE_Pos (10UL)        /*!< ADMA2_LEN_MODE (Bit 10)                               */
#define EMMC_EMMC_HOST_CTRL2_R_REG_ADMA2_LEN_MODE_Msk (0x400UL)     /*!< ADMA2_LEN_MODE (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_HOST_CTRL2_R_REG_UHS2_IF_ENABLE_Pos (8UL)         /*!< UHS2_IF_ENABLE (Bit 8)                                */
#define EMMC_EMMC_HOST_CTRL2_R_REG_UHS2_IF_ENABLE_Msk (0x100UL)     /*!< UHS2_IF_ENABLE (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_HOST_CTRL2_R_REG_SAMPLE_CLK_SEL_Pos (7UL)         /*!< SAMPLE_CLK_SEL (Bit 7)                                */
#define EMMC_EMMC_HOST_CTRL2_R_REG_SAMPLE_CLK_SEL_Msk (0x80UL)      /*!< SAMPLE_CLK_SEL (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_HOST_CTRL2_R_REG_EXEC_TUNING_Pos (6UL)            /*!< EXEC_TUNING (Bit 6)                                   */
#define EMMC_EMMC_HOST_CTRL2_R_REG_EXEC_TUNING_Msk (0x40UL)         /*!< EXEC_TUNING (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_HOST_CTRL2_R_REG_DRV_STRENGTH_SEL_Pos (4UL)       /*!< DRV_STRENGTH_SEL (Bit 4)                              */
#define EMMC_EMMC_HOST_CTRL2_R_REG_DRV_STRENGTH_SEL_Msk (0x30UL)    /*!< DRV_STRENGTH_SEL (Bitfield-Mask: 0x03)                */
#define EMMC_EMMC_HOST_CTRL2_R_REG_SIGNALING_EN_Pos (3UL)           /*!< SIGNALING_EN (Bit 3)                                  */
#define EMMC_EMMC_HOST_CTRL2_R_REG_SIGNALING_EN_Msk (0x8UL)         /*!< SIGNALING_EN (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_HOST_CTRL2_R_REG_UHS_MODE_SEL_Pos (0UL)           /*!< UHS_MODE_SEL (Bit 0)                                  */
#define EMMC_EMMC_HOST_CTRL2_R_REG_UHS_MODE_SEL_Msk (0x7UL)         /*!< UHS_MODE_SEL (Bitfield-Mask: 0x07)                    */
/* =================================================  EMMC_MBIU_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_MBIU_CTRL_R_REG_BURST_INCR16_EN_Pos (3UL)         /*!< BURST_INCR16_EN (Bit 3)                               */
#define EMMC_EMMC_MBIU_CTRL_R_REG_BURST_INCR16_EN_Msk (0x8UL)       /*!< BURST_INCR16_EN (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_MBIU_CTRL_R_REG_BURST_INCR8_EN_Pos (2UL)          /*!< BURST_INCR8_EN (Bit 2)                                */
#define EMMC_EMMC_MBIU_CTRL_R_REG_BURST_INCR8_EN_Msk (0x4UL)        /*!< BURST_INCR8_EN (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_MBIU_CTRL_R_REG_BURST_INCR4_EN_Pos (1UL)          /*!< BURST_INCR4_EN (Bit 1)                                */
#define EMMC_EMMC_MBIU_CTRL_R_REG_BURST_INCR4_EN_Msk (0x2UL)        /*!< BURST_INCR4_EN (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_MBIU_CTRL_R_REG_UNDEFL_INCR_EN_Pos (0UL)          /*!< UNDEFL_INCR_EN (Bit 0)                                */
#define EMMC_EMMC_MBIU_CTRL_R_REG_UNDEFL_INCR_EN_Msk (0x1UL)        /*!< UNDEFL_INCR_EN (Bitfield-Mask: 0x01)                  */
/* ============================================  EMMC_NORMAL_INT_SIGNAL_EN_R_REG  ============================================ */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CQE_EVENT_SIGNAL_EN_Pos (14UL) /*!< CQE_EVENT_SIGNAL_EN (Bit 14)                  */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CQE_EVENT_SIGNAL_EN_Msk (0x4000UL) /*!< CQE_EVENT_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_FX_EVENT_SIGNAL_EN_Pos (13UL) /*!< FX_EVENT_SIGNAL_EN (Bit 13)                    */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_FX_EVENT_SIGNAL_EN_Msk (0x2000UL) /*!< FX_EVENT_SIGNAL_EN (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_RE_TUNE_EVENT_SIGNAL_EN_Pos (12UL) /*!< RE_TUNE_EVENT_SIGNAL_EN (Bit 12)          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_RE_TUNE_EVENT_SIGNAL_EN_Msk (0x1000UL) /*!< RE_TUNE_EVENT_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_INT_C_SIGNAL_EN_Pos (11UL) /*!< INT_C_SIGNAL_EN (Bit 11)                          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_INT_C_SIGNAL_EN_Msk (0x800UL) /*!< INT_C_SIGNAL_EN (Bitfield-Mask: 0x01)          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_INT_B_SIGNAL_EN_Pos (10UL) /*!< INT_B_SIGNAL_EN (Bit 10)                          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_INT_B_SIGNAL_EN_Msk (0x400UL) /*!< INT_B_SIGNAL_EN (Bitfield-Mask: 0x01)          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_INT_A_SIGNAL_EN_Pos (9UL) /*!< INT_A_SIGNAL_EN (Bit 9)                            */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_INT_A_SIGNAL_EN_Msk (0x200UL) /*!< INT_A_SIGNAL_EN (Bitfield-Mask: 0x01)          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CARD_INTERRUPT_SIGNAL_EN_Pos (8UL) /*!< CARD_INTERRUPT_SIGNAL_EN (Bit 8)          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CARD_INTERRUPT_SIGNAL_EN_Msk (0x100UL) /*!< CARD_INTERRUPT_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CARD_REMOVAL_SIGNAL_EN_Pos (7UL) /*!< CARD_REMOVAL_SIGNAL_EN (Bit 7)              */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CARD_REMOVAL_SIGNAL_EN_Msk (0x80UL) /*!< CARD_REMOVAL_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CARD_INSERTION_SIGNAL_EN_Pos (6UL) /*!< CARD_INSERTION_SIGNAL_EN (Bit 6)          */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CARD_INSERTION_SIGNAL_EN_Msk (0x40UL) /*!< CARD_INSERTION_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_BUF_RD_READY_SIGNAL_EN_Pos (5UL) /*!< BUF_RD_READY_SIGNAL_EN (Bit 5)              */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_BUF_RD_READY_SIGNAL_EN_Msk (0x20UL) /*!< BUF_RD_READY_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_BUF_WR_READY_SIGNAL_EN_Pos (4UL) /*!< BUF_WR_READY_SIGNAL_EN (Bit 4)              */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_BUF_WR_READY_SIGNAL_EN_Msk (0x10UL) /*!< BUF_WR_READY_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_DMA_INTERRUPT_SIGNAL_EN_Pos (3UL) /*!< DMA_INTERRUPT_SIGNAL_EN (Bit 3)            */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_DMA_INTERRUPT_SIGNAL_EN_Msk (0x8UL) /*!< DMA_INTERRUPT_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_BGAP_EVENT_SIGNAL_EN_Pos (2UL) /*!< BGAP_EVENT_SIGNAL_EN (Bit 2)                  */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_BGAP_EVENT_SIGNAL_EN_Msk (0x4UL) /*!< BGAP_EVENT_SIGNAL_EN (Bitfield-Mask: 0x01)  */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_XFER_COMPLETE_SIGNAL_EN_Pos (1UL) /*!< XFER_COMPLETE_SIGNAL_EN (Bit 1)            */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_XFER_COMPLETE_SIGNAL_EN_Msk (0x2UL) /*!< XFER_COMPLETE_SIGNAL_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CMD_COMPLETE_SIGNAL_EN_Pos (0UL) /*!< CMD_COMPLETE_SIGNAL_EN (Bit 0)              */
#define EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_REG_CMD_COMPLETE_SIGNAL_EN_Msk (0x1UL) /*!< CMD_COMPLETE_SIGNAL_EN (Bitfield-Mask: 0x01) */
/* =============================================  EMMC_NORMAL_INT_STAT_EN_R_REG  ============================================= */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CQE_EVENT_STAT_EN_Pos (14UL) /*!< CQE_EVENT_STAT_EN (Bit 14)                        */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CQE_EVENT_STAT_EN_Msk (0x4000UL) /*!< CQE_EVENT_STAT_EN (Bitfield-Mask: 0x01)       */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_FX_EVENT_STAT_EN_Pos (13UL) /*!< FX_EVENT_STAT_EN (Bit 13)                          */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_FX_EVENT_STAT_EN_Msk (0x2000UL) /*!< FX_EVENT_STAT_EN (Bitfield-Mask: 0x01)         */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_RE_TUNE_EVENT_STAT_EN_Pos (12UL) /*!< RE_TUNE_EVENT_STAT_EN (Bit 12)                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_RE_TUNE_EVENT_STAT_EN_Msk (0x1000UL) /*!< RE_TUNE_EVENT_STAT_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_INT_C_STAT_EN_Pos (11UL) /*!< INT_C_STAT_EN (Bit 11)                                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_INT_C_STAT_EN_Msk (0x800UL) /*!< INT_C_STAT_EN (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_INT_B_STAT_EN_Pos (10UL) /*!< INT_B_STAT_EN (Bit 10)                                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_INT_B_STAT_EN_Msk (0x400UL) /*!< INT_B_STAT_EN (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_INT_A_STAT_EN_Pos (9UL)  /*!< INT_A_STAT_EN (Bit 9)                                 */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_INT_A_STAT_EN_Msk (0x200UL) /*!< INT_A_STAT_EN (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CARD_INTERRUPT_STAT_EN_Pos (8UL) /*!< CARD_INTERRUPT_STAT_EN (Bit 8)                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CARD_INTERRUPT_STAT_EN_Msk (0x100UL) /*!< CARD_INTERRUPT_STAT_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CARD_REMOVAL_STAT_EN_Pos (7UL) /*!< CARD_REMOVAL_STAT_EN (Bit 7)                    */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CARD_REMOVAL_STAT_EN_Msk (0x80UL) /*!< CARD_REMOVAL_STAT_EN (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CARD_INSERTION_STAT_EN_Pos (6UL) /*!< CARD_INSERTION_STAT_EN (Bit 6)                */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CARD_INSERTION_STAT_EN_Msk (0x40UL) /*!< CARD_INSERTION_STAT_EN (Bitfield-Mask: 0x01) */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_BUF_RD_READY_STAT_EN_Pos (5UL) /*!< BUF_RD_READY_STAT_EN (Bit 5)                    */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_BUF_RD_READY_STAT_EN_Msk (0x20UL) /*!< BUF_RD_READY_STAT_EN (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_BUF_WR_READY_STAT_EN_Pos (4UL) /*!< BUF_WR_READY_STAT_EN (Bit 4)                    */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_BUF_WR_READY_STAT_EN_Msk (0x10UL) /*!< BUF_WR_READY_STAT_EN (Bitfield-Mask: 0x01)   */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_DMA_INTERRUPT_STAT_EN_Pos (3UL) /*!< DMA_INTERRUPT_STAT_EN (Bit 3)                  */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_DMA_INTERRUPT_STAT_EN_Msk (0x8UL) /*!< DMA_INTERRUPT_STAT_EN (Bitfield-Mask: 0x01)  */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_BGAP_EVENT_STAT_EN_Pos (2UL) /*!< BGAP_EVENT_STAT_EN (Bit 2)                        */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_BGAP_EVENT_STAT_EN_Msk (0x4UL) /*!< BGAP_EVENT_STAT_EN (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_XFER_COMPLETE_STAT_EN_Pos (1UL) /*!< XFER_COMPLETE_STAT_EN (Bit 1)                  */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_XFER_COMPLETE_STAT_EN_Msk (0x2UL) /*!< XFER_COMPLETE_STAT_EN (Bitfield-Mask: 0x01)  */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CMD_COMPLETE_STAT_EN_Pos (0UL) /*!< CMD_COMPLETE_STAT_EN (Bit 0)                    */
#define EMMC_EMMC_NORMAL_INT_STAT_EN_R_REG_CMD_COMPLETE_STAT_EN_Msk (0x1UL) /*!< CMD_COMPLETE_STAT_EN (Bitfield-Mask: 0x01)    */
/* ==============================================  EMMC_NORMAL_INT_STAT_R_REG  =============================================== */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_ERR_INTERRUPT_Pos (15UL)    /*!< ERR_INTERRUPT (Bit 15)                                */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_ERR_INTERRUPT_Msk (0x8000UL) /*!< ERR_INTERRUPT (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CQE_EVENT_Pos (14UL)        /*!< CQE_EVENT (Bit 14)                                    */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CQE_EVENT_Msk (0x4000UL)    /*!< CQE_EVENT (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_FX_EVENT_Pos (13UL)         /*!< FX_EVENT (Bit 13)                                     */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_FX_EVENT_Msk (0x2000UL)     /*!< FX_EVENT (Bitfield-Mask: 0x01)                        */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_RE_TUNE_EVENT_Pos (12UL)    /*!< RE_TUNE_EVENT (Bit 12)                                */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_RE_TUNE_EVENT_Msk (0x1000UL) /*!< RE_TUNE_EVENT (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_INT_C_Pos (11UL)            /*!< INT_C (Bit 11)                                        */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_INT_C_Msk (0x800UL)         /*!< INT_C (Bitfield-Mask: 0x01)                           */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_INT_B_Pos (10UL)            /*!< INT_B (Bit 10)                                        */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_INT_B_Msk (0x400UL)         /*!< INT_B (Bitfield-Mask: 0x01)                           */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_INT_A_Pos (9UL)             /*!< INT_A (Bit 9)                                         */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_INT_A_Msk (0x200UL)         /*!< INT_A (Bitfield-Mask: 0x01)                           */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CARD_INTERRUPT_Pos (8UL)    /*!< CARD_INTERRUPT (Bit 8)                                */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CARD_INTERRUPT_Msk (0x100UL) /*!< CARD_INTERRUPT (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CARD_REMOVAL_STAT_R_Pos (7UL) /*!< CARD_REMOVAL_STAT_R (Bit 7)                         */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CARD_REMOVAL_STAT_R_Msk (0x80UL) /*!< CARD_REMOVAL_STAT_R (Bitfield-Mask: 0x01)        */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CARD_INSERTION_Pos (6UL)    /*!< CARD_INSERTION (Bit 6)                                */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CARD_INSERTION_Msk (0x40UL) /*!< CARD_INSERTION (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_BUF_RD_READY_Pos (5UL)      /*!< BUF_RD_READY (Bit 5)                                  */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_BUF_RD_READY_Msk (0x20UL)   /*!< BUF_RD_READY (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_BUF_WR_READY_Pos (4UL)      /*!< BUF_WR_READY (Bit 4)                                  */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_BUF_WR_READY_Msk (0x10UL)   /*!< BUF_WR_READY (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_DMA_INTERRUPT_Pos (3UL)     /*!< DMA_INTERRUPT (Bit 3)                                 */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_DMA_INTERRUPT_Msk (0x8UL)   /*!< DMA_INTERRUPT (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_BGAP_EVENT_Pos (2UL)        /*!< BGAP_EVENT (Bit 2)                                    */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_BGAP_EVENT_Msk (0x4UL)      /*!< BGAP_EVENT (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_XFER_COMPLETE_Pos (1UL)     /*!< XFER_COMPLETE (Bit 1)                                 */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_XFER_COMPLETE_Msk (0x2UL)   /*!< XFER_COMPLETE (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CMD_COMPLETE_Pos (0UL)      /*!< CMD_COMPLETE (Bit 0)                                  */
#define EMMC_EMMC_NORMAL_INT_STAT_R_REG_CMD_COMPLETE_Msk (0x1UL)    /*!< CMD_COMPLETE (Bitfield-Mask: 0x01)                    */
/* ================================================  EMMC_PRESET_DDR50_R_REG  ================================================ */
#define EMMC_EMMC_PRESET_DDR50_R_REG_DRV_SEL_VAL_Pos (14UL)         /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_DDR50_R_REG_DRV_SEL_VAL_Msk (0xc000UL)     /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_DDR50_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)     /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_DDR50_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)  /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_DDR50_R_REG_FREQ_SEL_VAL_Pos (0UL)         /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_DDR50_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)     /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* =================================================  EMMC_PRESET_DS_R_REG  ================================================== */
#define EMMC_EMMC_PRESET_DS_R_REG_DRV_SEL_VAL_Pos (14UL)            /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_DS_R_REG_DRV_SEL_VAL_Msk (0xc000UL)        /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_DS_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)        /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_DS_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)     /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_DS_R_REG_FREQ_SEL_VAL_Pos (0UL)            /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_DS_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)        /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* =================================================  EMMC_PRESET_HS_R_REG  ================================================== */
#define EMMC_EMMC_PRESET_HS_R_REG_DRV_SEL_VAL_Pos (14UL)            /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_HS_R_REG_DRV_SEL_VAL_Msk (0xc000UL)        /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_HS_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)        /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_HS_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)     /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_HS_R_REG_FREQ_SEL_VAL_Pos (0UL)            /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_HS_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)        /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ================================================  EMMC_PRESET_INIT_R_REG  ================================================= */
#define EMMC_EMMC_PRESET_INIT_R_REG_DRV_SEL_VAL_Pos (14UL)          /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_INIT_R_REG_DRV_SEL_VAL_Msk (0xc000UL)      /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_INIT_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)      /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_INIT_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)   /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_INIT_R_REG_FREQ_SEL_VAL_Pos (0UL)          /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_INIT_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)      /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ===============================================  EMMC_PRESET_SDR104_R_REG  ================================================ */
#define EMMC_EMMC_PRESET_SDR104_R_REG_DRV_SEL_VAL_Pos (14UL)        /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_SDR104_R_REG_DRV_SEL_VAL_Msk (0xc000UL)    /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_SDR104_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)    /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_SDR104_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL) /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_SDR104_R_REG_FREQ_SEL_VAL_Pos (0UL)        /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_SDR104_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)    /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ================================================  EMMC_PRESET_SDR12_R_REG  ================================================ */
#define EMMC_EMMC_PRESET_SDR12_R_REG_DRV_SEL_VAL_Pos (14UL)         /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_SDR12_R_REG_DRV_SEL_VAL_Msk (0xc000UL)     /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_SDR12_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)     /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_SDR12_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)  /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_SDR12_R_REG_FREQ_SEL_VAL_Pos (0UL)         /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_SDR12_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)     /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ================================================  EMMC_PRESET_SDR25_R_REG  ================================================ */
#define EMMC_EMMC_PRESET_SDR25_R_REG_DRV_SEL_VAL_Pos (14UL)         /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_SDR25_R_REG_DRV_SEL_VAL_Msk (0xc000UL)     /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_SDR25_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)     /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_SDR25_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)  /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_SDR25_R_REG_FREQ_SEL_VAL_Pos (0UL)         /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_SDR25_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)     /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ================================================  EMMC_PRESET_SDR50_R_REG  ================================================ */
