antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define EMMC_EMMC_PRESET_SDR50_R_REG_DRV_SEL_VAL_Pos (14UL)         /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_SDR50_R_REG_DRV_SEL_VAL_Msk (0xc000UL)     /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_SDR50_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)     /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_SDR50_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)  /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_SDR50_R_REG_FREQ_SEL_VAL_Pos (0UL)         /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_SDR50_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)     /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ================================================  EMMC_PRESET_UHS2_R_REG  ================================================= */
#define EMMC_EMMC_PRESET_UHS2_R_REG_DRV_SEL_VAL_Pos (14UL)          /*!< DRV_SEL_VAL (Bit 14)                                  */
#define EMMC_EMMC_PRESET_UHS2_R_REG_DRV_SEL_VAL_Msk (0xc000UL)      /*!< DRV_SEL_VAL (Bitfield-Mask: 0x03)                     */
#define EMMC_EMMC_PRESET_UHS2_R_REG_CLK_GEN_SEL_VAL_Pos (10UL)      /*!< CLK_GEN_SEL_VAL (Bit 10)                              */
#define EMMC_EMMC_PRESET_UHS2_R_REG_CLK_GEN_SEL_VAL_Msk (0x400UL)   /*!< CLK_GEN_SEL_VAL (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PRESET_UHS2_R_REG_FREQ_SEL_VAL_Pos (0UL)          /*!< FREQ_SEL_VAL (Bit 0)                                  */
#define EMMC_EMMC_PRESET_UHS2_R_REG_FREQ_SEL_VAL_Msk (0x3ffUL)      /*!< FREQ_SEL_VAL (Bitfield-Mask: 0x3ff)                   */
/* ====================================================  EMMC_PSTATE_REG  ==================================================== */
#define EMMC_EMMC_PSTATE_REG_UHS2_IF_DETECT_Pos (31UL)              /*!< UHS2_IF_DETECT (Bit 31)                               */
#define EMMC_EMMC_PSTATE_REG_UHS2_IF_DETECT_Msk (0x80000000UL)      /*!< UHS2_IF_DETECT (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_PSTATE_REG_LANE_SYNC_Pos (30UL)                   /*!< LANE_SYNC (Bit 30)                                    */
#define EMMC_EMMC_PSTATE_REG_LANE_SYNC_Msk (0x40000000UL)           /*!< LANE_SYNC (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_PSTATE_REG_IN_DORMANT_ST_Pos (29UL)               /*!< IN_DORMANT_ST (Bit 29)                                */
#define EMMC_EMMC_PSTATE_REG_IN_DORMANT_ST_Msk (0x20000000UL)       /*!< IN_DORMANT_ST (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_PSTATE_REG_SUB_CMD_STAT_Pos (28UL)                /*!< SUB_CMD_STAT (Bit 28)                                 */
#define EMMC_EMMC_PSTATE_REG_SUB_CMD_STAT_Msk (0x10000000UL)        /*!< SUB_CMD_STAT (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_PSTATE_REG_CMD_ISSUE_ERR_Pos (27UL)               /*!< CMD_ISSUE_ERR (Bit 27)                                */
#define EMMC_EMMC_PSTATE_REG_CMD_ISSUE_ERR_Msk (0x8000000UL)        /*!< CMD_ISSUE_ERR (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_PSTATE_REG_HOST_REG_VOL_Pos (25UL)                /*!< HOST_REG_VOL (Bit 25)                                 */
#define EMMC_EMMC_PSTATE_REG_HOST_REG_VOL_Msk (0x2000000UL)         /*!< HOST_REG_VOL (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_PSTATE_REG_CMD_LINE_LVL_Pos (24UL)                /*!< CMD_LINE_LVL (Bit 24)                                 */
#define EMMC_EMMC_PSTATE_REG_CMD_LINE_LVL_Msk (0x1000000UL)         /*!< CMD_LINE_LVL (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_PSTATE_REG_DAT_3_0_Pos  (20UL)                    /*!< DAT_3_0 (Bit 20)                                      */
#define EMMC_EMMC_PSTATE_REG_DAT_3_0_Msk  (0xf00000UL)              /*!< DAT_3_0 (Bitfield-Mask: 0x0f)                         */
#define EMMC_EMMC_PSTATE_REG_WR_PROTECT_SW_LVL_Pos (19UL)           /*!< WR_PROTECT_SW_LVL (Bit 19)                            */
#define EMMC_EMMC_PSTATE_REG_WR_PROTECT_SW_LVL_Msk (0x80000UL)      /*!< WR_PROTECT_SW_LVL (Bitfield-Mask: 0x01)               */
#define EMMC_EMMC_PSTATE_REG_CARD_DETECT_PIN_LEVEL_Pos (18UL)       /*!< CARD_DETECT_PIN_LEVEL (Bit 18)                        */
#define EMMC_EMMC_PSTATE_REG_CARD_DETECT_PIN_LEVEL_Msk (0x40000UL)  /*!< CARD_DETECT_PIN_LEVEL (Bitfield-Mask: 0x01)           */
#define EMMC_EMMC_PSTATE_REG_CARD_STABLE_Pos (17UL)                 /*!< CARD_STABLE (Bit 17)                                  */
#define EMMC_EMMC_PSTATE_REG_CARD_STABLE_Msk (0x20000UL)            /*!< CARD_STABLE (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_PSTATE_REG_CARD_INSERTED_Pos (16UL)               /*!< CARD_INSERTED (Bit 16)                                */
#define EMMC_EMMC_PSTATE_REG_CARD_INSERTED_Msk (0x10000UL)          /*!< CARD_INSERTED (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_PSTATE_REG_BUF_RD_ENABLE_Pos (11UL)               /*!< BUF_RD_ENABLE (Bit 11)                                */
#define EMMC_EMMC_PSTATE_REG_BUF_RD_ENABLE_Msk (0x800UL)            /*!< BUF_RD_ENABLE (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_PSTATE_REG_BUF_WR_ENABLE_Pos (10UL)               /*!< BUF_WR_ENABLE (Bit 10)                                */
#define EMMC_EMMC_PSTATE_REG_BUF_WR_ENABLE_Msk (0x400UL)            /*!< BUF_WR_ENABLE (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_PSTATE_REG_RD_XFER_ACTIVE_Pos (9UL)               /*!< RD_XFER_ACTIVE (Bit 9)                                */
#define EMMC_EMMC_PSTATE_REG_RD_XFER_ACTIVE_Msk (0x200UL)           /*!< RD_XFER_ACTIVE (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_PSTATE_REG_WR_XFER_ACTIVE_Pos (8UL)               /*!< WR_XFER_ACTIVE (Bit 8)                                */
#define EMMC_EMMC_PSTATE_REG_WR_XFER_ACTIVE_Msk (0x100UL)           /*!< WR_XFER_ACTIVE (Bitfield-Mask: 0x01)                  */
#define EMMC_EMMC_PSTATE_REG_DAT_7_4_Pos  (4UL)                     /*!< DAT_7_4 (Bit 4)                                       */
#define EMMC_EMMC_PSTATE_REG_DAT_7_4_Msk  (0xf0UL)                  /*!< DAT_7_4 (Bitfield-Mask: 0x0f)                         */
#define EMMC_EMMC_PSTATE_REG_RE_TUNE_REQ_Pos (3UL)                  /*!< RE_TUNE_REQ (Bit 3)                                   */
#define EMMC_EMMC_PSTATE_REG_RE_TUNE_REQ_Msk (0x8UL)                /*!< RE_TUNE_REQ (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_PSTATE_REG_DAT_LINE_ACTIVE_Pos (2UL)              /*!< DAT_LINE_ACTIVE (Bit 2)                               */
#define EMMC_EMMC_PSTATE_REG_DAT_LINE_ACTIVE_Msk (0x4UL)            /*!< DAT_LINE_ACTIVE (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PSTATE_REG_CMD_INHIBIT_DAT_Pos (1UL)              /*!< CMD_INHIBIT_DAT (Bit 1)                               */
#define EMMC_EMMC_PSTATE_REG_CMD_INHIBIT_DAT_Msk (0x2UL)            /*!< CMD_INHIBIT_DAT (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PSTATE_REG_CMD_INHIBIT_Pos (0UL)                  /*!< CMD_INHIBIT (Bit 0)                                   */
#define EMMC_EMMC_PSTATE_REG_CMD_INHIBIT_Msk (0x1UL)                /*!< CMD_INHIBIT (Bitfield-Mask: 0x01)                     */
/* ==================================================  EMMC_PWR_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_VOL_VDD2_Pos (5UL)          /*!< SD_BUS_VOL_VDD2 (Bit 5)                               */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_VOL_VDD2_Msk (0xe0UL)       /*!< SD_BUS_VOL_VDD2 (Bitfield-Mask: 0x07)                 */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_PWR_VDD2_Pos (4UL)          /*!< SD_BUS_PWR_VDD2 (Bit 4)                               */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_PWR_VDD2_Msk (0x10UL)       /*!< SD_BUS_PWR_VDD2 (Bitfield-Mask: 0x01)                 */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_VOL_VDD1_Pos (1UL)          /*!< SD_BUS_VOL_VDD1 (Bit 1)                               */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_VOL_VDD1_Msk (0xeUL)        /*!< SD_BUS_VOL_VDD1 (Bitfield-Mask: 0x07)                 */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_PWR_VDD1_Pos (0UL)          /*!< SD_BUS_PWR_VDD1 (Bit 0)                               */
#define EMMC_EMMC_PWR_CTRL_R_REG_SD_BUS_PWR_VDD1_Msk (0x1UL)        /*!< SD_BUS_PWR_VDD1 (Bitfield-Mask: 0x01)                 */
/* ===============================================  EMMC_P_EMBEDDED_CNTRL_REG  =============================================== */
#define EMMC_EMMC_P_EMBEDDED_CNTRL_REG_REG_OFFSET_EMBEDDED_CNTRL_ADDR_Pos (0UL) /*!< REG_OFFSET_EMBEDDED_CNTRL_ADDR (Bit 0)    */
#define EMMC_EMMC_P_EMBEDDED_CNTRL_REG_REG_OFFSET_EMBEDDED_CNTRL_ADDR_Msk (0xfffUL) /*!< REG_OFFSET_EMBEDDED_CNTRL_ADDR (Bitfield-Mask: 0xfff) */
/* ============================================  EMMC_P_VENDOR_SPECIFIC_AREA_REG  ============================================ */
#define EMMC_EMMC_P_VENDOR_SPECIFIC_AREA_REG_REG_OFFSET_ADDR_VENDOR_Pos (0UL) /*!< REG_OFFSET_ADDR_VENDOR (Bit 0)              */
#define EMMC_EMMC_P_VENDOR_SPECIFIC_AREA_REG_REG_OFFSET_ADDR_VENDOR_Msk (0xfffUL) /*!< REG_OFFSET_ADDR_VENDOR (Bitfield-Mask: 0xfff) */
/* ============================================  EMMC_P_VNDR2_SPECIFIC_AREA_REG  ============================================= */
#define EMMC_EMMC_P_VNDR2_SPECIFIC_AREA_REG_REG_OFFSET_ADDR_VNDR2_Pos (0UL) /*!< REG_OFFSET_ADDR_VNDR2 (Bit 0)                 */
#define EMMC_EMMC_P_VNDR2_SPECIFIC_AREA_REG_REG_OFFSET_ADDR_VNDR2_Msk (0xffffUL) /*!< REG_OFFSET_ADDR_VNDR2 (Bitfield-Mask: 0xffff) */
/* ===================================================  EMMC_RESP01_R_REG  =================================================== */
#define EMMC_EMMC_RESP01_R_REG_RESP01_Pos (0UL)                     /*!< RESP01 (Bit 0)                                        */
#define EMMC_EMMC_RESP01_R_REG_RESP01_Msk (0xffffffffUL)            /*!< RESP01 (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  EMMC_RESP23_R_REG  =================================================== */
#define EMMC_EMMC_RESP23_R_REG_RESP23_Pos (0UL)                     /*!< RESP23 (Bit 0)                                        */
#define EMMC_EMMC_RESP23_R_REG_RESP23_Msk (0xffffffffUL)            /*!< RESP23 (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  EMMC_RESP45_R_REG  =================================================== */
#define EMMC_EMMC_RESP45_R_REG_RESP45_Pos (0UL)                     /*!< RESP45 (Bit 0)                                        */
#define EMMC_EMMC_RESP45_R_REG_RESP45_Msk (0xffffffffUL)            /*!< RESP45 (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  EMMC_RESP67_R_REG  =================================================== */
#define EMMC_EMMC_RESP67_R_REG_RESP67_Pos (0UL)                     /*!< RESP67 (Bit 0)                                        */
#define EMMC_EMMC_RESP67_R_REG_RESP67_Msk (0xffffffffUL)            /*!< RESP67 (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  EMMC_SDMASA_R_REG  =================================================== */
#define EMMC_EMMC_SDMASA_R_REG_BLOCKCNT_SDMASA_Pos (0UL)            /*!< BLOCKCNT_SDMASA (Bit 0)                               */
#define EMMC_EMMC_SDMASA_R_REG_BLOCKCNT_SDMASA_Msk (0xffffffffUL)   /*!< BLOCKCNT_SDMASA (Bitfield-Mask: 0xffffffff)           */
/* ==============================================  EMMC_SLOT_INTR_STATUS_R_REG  ============================================== */
#define EMMC_EMMC_SLOT_INTR_STATUS_R_REG_INTR_SLOT_Pos (0UL)        /*!< INTR_SLOT (Bit 0)                                     */
#define EMMC_EMMC_SLOT_INTR_STATUS_R_REG_INTR_SLOT_Msk (0xffUL)     /*!< INTR_SLOT (Bitfield-Mask: 0xff)                       */
/* ===================================================  EMMC_SW_RST_R_REG  =================================================== */
#define EMMC_EMMC_SW_RST_R_REG_SW_RST_DAT_Pos (2UL)                 /*!< SW_RST_DAT (Bit 2)                                    */
#define EMMC_EMMC_SW_RST_R_REG_SW_RST_DAT_Msk (0x4UL)               /*!< SW_RST_DAT (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_SW_RST_R_REG_SW_RST_CMD_Pos (1UL)                 /*!< SW_RST_CMD (Bit 1)                                    */
#define EMMC_EMMC_SW_RST_R_REG_SW_RST_CMD_Msk (0x2UL)               /*!< SW_RST_CMD (Bitfield-Mask: 0x01)                      */
#define EMMC_EMMC_SW_RST_R_REG_SW_RST_ALL_Pos (0UL)                 /*!< SW_RST_ALL (Bit 0)                                    */
#define EMMC_EMMC_SW_RST_R_REG_SW_RST_ALL_Msk (0x1UL)               /*!< SW_RST_ALL (Bitfield-Mask: 0x01)                      */
/* =================================================  EMMC_TOUT_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_TOUT_CTRL_R_REG_TOUT_CNT_Pos (0UL)                /*!< TOUT_CNT (Bit 0)                                      */
#define EMMC_EMMC_TOUT_CTRL_R_REG_TOUT_CNT_Msk (0xfUL)              /*!< TOUT_CNT (Bitfield-Mask: 0x0f)                        */
/* ===================================================  EMMC_VER_ID_R_REG  =================================================== */
#define EMMC_EMMC_VER_ID_R_REG_VER_ID_Pos (0UL)                     /*!< VER_ID (Bit 0)                                        */
#define EMMC_EMMC_VER_ID_R_REG_VER_ID_Msk (0xffffffffUL)            /*!< VER_ID (Bitfield-Mask: 0xffffffff)                    */
/* ==================================================  EMMC_VER_TYPE_R_REG  ================================================== */
#define EMMC_EMMC_VER_TYPE_R_REG_VER_TYPE_Pos (0UL)                 /*!< VER_TYPE (Bit 0)                                      */
#define EMMC_EMMC_VER_TYPE_R_REG_VER_TYPE_Msk (0xffffffffUL)        /*!< VER_TYPE (Bitfield-Mask: 0xffffffff)                  */
/* ==================================================  EMMC_WUP_CTRL_R_REG  ================================================== */
#define EMMC_EMMC_WUP_CTRL_R_REG_CARD_REMOVAL_Pos (2UL)             /*!< CARD_REMOVAL (Bit 2)                                  */
#define EMMC_EMMC_WUP_CTRL_R_REG_CARD_REMOVAL_Msk (0x4UL)           /*!< CARD_REMOVAL (Bitfield-Mask: 0x01)                    */
#define EMMC_EMMC_WUP_CTRL_R_REG_CARD_INSERT_Pos (1UL)              /*!< CARD_INSERT (Bit 1)                                   */
#define EMMC_EMMC_WUP_CTRL_R_REG_CARD_INSERT_Msk (0x2UL)            /*!< CARD_INSERT (Bitfield-Mask: 0x01)                     */
#define EMMC_EMMC_WUP_CTRL_R_REG_CARD_INT_Pos (0UL)                 /*!< CARD_INT (Bit 0)                                      */
#define EMMC_EMMC_WUP_CTRL_R_REG_CARD_INT_Msk (0x1UL)               /*!< CARD_INT (Bitfield-Mask: 0x01)                        */
/* =================================================  EMMC_XFER_MODE_R_REG  ================================================== */
#define EMMC_EMMC_XFER_MODE_R_REG_RESP_INT_DISABLE_Pos (8UL)        /*!< RESP_INT_DISABLE (Bit 8)                              */
#define EMMC_EMMC_XFER_MODE_R_REG_RESP_INT_DISABLE_Msk (0x100UL)    /*!< RESP_INT_DISABLE (Bitfield-Mask: 0x01)                */
#define EMMC_EMMC_XFER_MODE_R_REG_RESP_ERR_CHK_ENABLE_Pos (7UL)     /*!< RESP_ERR_CHK_ENABLE (Bit 7)                           */
#define EMMC_EMMC_XFER_MODE_R_REG_RESP_ERR_CHK_ENABLE_Msk (0x80UL)  /*!< RESP_ERR_CHK_ENABLE (Bitfield-Mask: 0x01)             */
#define EMMC_EMMC_XFER_MODE_R_REG_RESP_TYPE_Pos (6UL)               /*!< RESP_TYPE (Bit 6)                                     */
#define EMMC_EMMC_XFER_MODE_R_REG_RESP_TYPE_Msk (0x40UL)            /*!< RESP_TYPE (Bitfield-Mask: 0x01)                       */
#define EMMC_EMMC_XFER_MODE_R_REG_MULTI_BLK_SEL_Pos (5UL)           /*!< MULTI_BLK_SEL (Bit 5)                                 */
#define EMMC_EMMC_XFER_MODE_R_REG_MULTI_BLK_SEL_Msk (0x20UL)        /*!< MULTI_BLK_SEL (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_XFER_MODE_R_REG_DATA_XFER_DIR_Pos (4UL)           /*!< DATA_XFER_DIR (Bit 4)                                 */
#define EMMC_EMMC_XFER_MODE_R_REG_DATA_XFER_DIR_Msk (0x10UL)        /*!< DATA_XFER_DIR (Bitfield-Mask: 0x01)                   */
#define EMMC_EMMC_XFER_MODE_R_REG_AUTO_CMD_ENABLE_Pos (2UL)         /*!< AUTO_CMD_ENABLE (Bit 2)                               */
#define EMMC_EMMC_XFER_MODE_R_REG_AUTO_CMD_ENABLE_Msk (0xcUL)       /*!< AUTO_CMD_ENABLE (Bitfield-Mask: 0x03)                 */
#define EMMC_EMMC_XFER_MODE_R_REG_BLOCK_COUNT_ENABLE_Pos (1UL)      /*!< BLOCK_COUNT_ENABLE (Bit 1)                            */
#define EMMC_EMMC_XFER_MODE_R_REG_BLOCK_COUNT_ENABLE_Msk (0x2UL)    /*!< BLOCK_COUNT_ENABLE (Bitfield-Mask: 0x01)              */
#define EMMC_EMMC_XFER_MODE_R_REG_DMA_EN_EMMC_Pos (0UL)             /*!< DMA_EN_EMMC (Bit 0)                                   */
#define EMMC_EMMC_XFER_MODE_R_REG_DMA_EN_EMMC_Msk (0x1UL)           /*!< DMA_EN_EMMC (Bitfield-Mask: 0x01)                     */


/* =========================================================================================================================== */
/* ================                                           GPADC                                           ================ */
/* =========================================================================================================================== */

