antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* =================================================  GP_ADC_CLEAR_INT_REG  ================================================== */
#define GPADC_GP_ADC_CLEAR_INT_REG_GP_ADC_CLR_INT_Pos (0UL)         /*!< GP_ADC_CLR_INT (Bit 0)                                */
#define GPADC_GP_ADC_CLEAR_INT_REG_GP_ADC_CLR_INT_Msk (0xffffUL)    /*!< GP_ADC_CLR_INT (Bitfield-Mask: 0xffff)                */
/* ===================================================  GP_ADC_CTRL2_REG  ==================================================== */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_STORE_DEL_Pos (13UL)          /*!< GP_ADC_STORE_DEL (Bit 13)                             */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_STORE_DEL_Msk (0xe000UL)      /*!< GP_ADC_STORE_DEL (Bitfield-Mask: 0x07)                */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_SMPL_TIME_Pos (9UL)           /*!< GP_ADC_SMPL_TIME (Bit 9)                              */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_SMPL_TIME_Msk (0x1e00UL)      /*!< GP_ADC_SMPL_TIME (Bitfield-Mask: 0x0f)                */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_CONV_NRS_Pos (6UL)            /*!< GP_ADC_CONV_NRS (Bit 6)                               */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_CONV_NRS_Msk (0x1c0UL)        /*!< GP_ADC_CONV_NRS (Bitfield-Mask: 0x07)                 */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_I20U_Pos (2UL)                /*!< GP_ADC_I20U (Bit 2)                                   */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_I20U_Msk (0x4UL)              /*!< GP_ADC_I20U (Bitfield-Mask: 0x01)                     */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_ATTN_Pos (0UL)                /*!< GP_ADC_ATTN (Bit 0)                                   */
#define GPADC_GP_ADC_CTRL2_REG_GP_ADC_ATTN_Msk (0x3UL)              /*!< GP_ADC_ATTN (Bitfield-Mask: 0x03)                     */
/* ===================================================  GP_ADC_CTRL3_REG  ==================================================== */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_INTERVAL_Pos (8UL)            /*!< GP_ADC_INTERVAL (Bit 8)                               */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_INTERVAL_Msk (0xff00UL)       /*!< GP_ADC_INTERVAL (Bitfield-Mask: 0xff)                 */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_EN_DEL_Pos (0UL)              /*!< GP_ADC_EN_DEL (Bit 0)                                 */
#define GPADC_GP_ADC_CTRL3_REG_GP_ADC_EN_DEL_Msk (0xffUL)           /*!< GP_ADC_EN_DEL (Bitfield-Mask: 0xff)                   */
/* ====================================================  GP_ADC_CTRL_REG  ==================================================== */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_RESULT_MODE_Pos (15UL)         /*!< GP_ADC_RESULT_MODE (Bit 15)                           */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_RESULT_MODE_Msk (0x18000UL)    /*!< GP_ADC_RESULT_MODE (Bitfield-Mask: 0x03)              */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DIE_TEMP_EN_Pos (14UL)         /*!< GP_ADC_DIE_TEMP_EN (Bit 14)                           */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DIE_TEMP_EN_Msk (0x4000UL)     /*!< GP_ADC_DIE_TEMP_EN (Bitfield-Mask: 0x01)              */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DIFF_TEMP_SEL_Pos (12UL)       /*!< GP_ADC_DIFF_TEMP_SEL (Bit 12)                         */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DIFF_TEMP_SEL_Msk (0x3000UL)   /*!< GP_ADC_DIFF_TEMP_SEL (Bitfield-Mask: 0x03)            */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DIFF_TEMP_EN_Pos (11UL)        /*!< GP_ADC_DIFF_TEMP_EN (Bit 11)                          */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DIFF_TEMP_EN_Msk (0x800UL)     /*!< GP_ADC_DIFF_TEMP_EN (Bitfield-Mask: 0x01)             */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_LDO_HOLD_Pos (10UL)            /*!< GP_ADC_LDO_HOLD (Bit 10)                              */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_LDO_HOLD_Msk (0x400UL)         /*!< GP_ADC_LDO_HOLD (Bitfield-Mask: 0x01)                 */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CHOP_Pos (9UL)                 /*!< GP_ADC_CHOP (Bit 9)                                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CHOP_Msk (0x200UL)             /*!< GP_ADC_CHOP (Bitfield-Mask: 0x01)                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SIGN_Pos (8UL)                 /*!< GP_ADC_SIGN (Bit 8)                                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SIGN_Msk (0x100UL)             /*!< GP_ADC_SIGN (Bitfield-Mask: 0x01)                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MUTE_Pos (7UL)                 /*!< GP_ADC_MUTE (Bit 7)                                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MUTE_Msk (0x80UL)              /*!< GP_ADC_MUTE (Bitfield-Mask: 0x01)                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SE_Pos (6UL)                   /*!< GP_ADC_SE (Bit 6)                                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_SE_Msk (0x40UL)                /*!< GP_ADC_SE (Bitfield-Mask: 0x01)                       */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MINT_Pos (5UL)                 /*!< GP_ADC_MINT (Bit 5)                                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_MINT_Msk (0x20UL)              /*!< GP_ADC_MINT (Bitfield-Mask: 0x01)                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_INT_Pos (4UL)                  /*!< GP_ADC_INT (Bit 4)                                    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_INT_Msk (0x10UL)               /*!< GP_ADC_INT (Bitfield-Mask: 0x01)                      */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DMA_EN_Pos (3UL)               /*!< GP_ADC_DMA_EN (Bit 3)                                 */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_DMA_EN_Msk (0x8UL)             /*!< GP_ADC_DMA_EN (Bitfield-Mask: 0x01)                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CONT_Pos (2UL)                 /*!< GP_ADC_CONT (Bit 2)                                   */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_CONT_Msk (0x4UL)               /*!< GP_ADC_CONT (Bitfield-Mask: 0x01)                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_START_Pos (1UL)                /*!< GP_ADC_START (Bit 1)                                  */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_START_Msk (0x2UL)              /*!< GP_ADC_START (Bitfield-Mask: 0x01)                    */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_EN_Pos (0UL)                   /*!< GP_ADC_EN (Bit 0)                                     */
#define GPADC_GP_ADC_CTRL_REG_GP_ADC_EN_Msk (0x1UL)                 /*!< GP_ADC_EN (Bitfield-Mask: 0x01)                       */
/* ====================================================  GP_ADC_OFFN_REG  ==================================================== */
#define GPADC_GP_ADC_OFFN_REG_GP_ADC_OFFN_Pos (0UL)                 /*!< GP_ADC_OFFN (Bit 0)                                   */
#define GPADC_GP_ADC_OFFN_REG_GP_ADC_OFFN_Msk (0x3ffUL)             /*!< GP_ADC_OFFN (Bitfield-Mask: 0x3ff)                    */
/* ====================================================  GP_ADC_OFFP_REG  ==================================================== */
#define GPADC_GP_ADC_OFFP_REG_GP_ADC_OFFP_Pos (0UL)                 /*!< GP_ADC_OFFP (Bit 0)                                   */
#define GPADC_GP_ADC_OFFP_REG_GP_ADC_OFFP_Msk (0x3ffUL)             /*!< GP_ADC_OFFP (Bitfield-Mask: 0x3ff)                    */
/* ===================================================  GP_ADC_RESULT_REG  =================================================== */
#define GPADC_GP_ADC_RESULT_REG_GP_ADC_VAL_Pos (0UL)                /*!< GP_ADC_VAL (Bit 0)                                    */
#define GPADC_GP_ADC_RESULT_REG_GP_ADC_VAL_Msk (0xffffUL)           /*!< GP_ADC_VAL (Bitfield-Mask: 0xffff)                    */
/* ====================================================  GP_ADC_SEL_REG  ===================================================== */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_MUX2_Pos (11UL)             /*!< GP_ADC_SEL_MUX2 (Bit 11)                              */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_MUX2_Msk (0x3800UL)         /*!< GP_ADC_SEL_MUX2 (Bitfield-Mask: 0x07)                 */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_MUX1_Pos (8UL)              /*!< GP_ADC_SEL_MUX1 (Bit 8)                               */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_MUX1_Msk (0x700UL)          /*!< GP_ADC_SEL_MUX1 (Bitfield-Mask: 0x07)                 */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_P_Pos (4UL)                 /*!< GP_ADC_SEL_P (Bit 4)                                  */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_P_Msk (0x70UL)              /*!< GP_ADC_SEL_P (Bitfield-Mask: 0x07)                    */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_N_Pos (0UL)                 /*!< GP_ADC_SEL_N (Bit 0)                                  */
#define GPADC_GP_ADC_SEL_REG_GP_ADC_SEL_N_Msk (0x7UL)               /*!< GP_ADC_SEL_N (Bitfield-Mask: 0x07)                    */
/* ====================================================  GP_ADC_TRIM_REG  ==================================================== */
#define GPADC_GP_ADC_TRIM_REG_GP_ADC_LDO_LEVEL_Pos (0UL)            /*!< GP_ADC_LDO_LEVEL (Bit 0)                              */
#define GPADC_GP_ADC_TRIM_REG_GP_ADC_LDO_LEVEL_Msk (0x7UL)          /*!< GP_ADC_LDO_LEVEL (Bitfield-Mask: 0x07)                */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

