antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define GPIO_P0_19_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_19_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_20_MODE_REG  ===================================================== */
#define GPIO_P0_20_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_20_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_20_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_20_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_20_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_20_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_21_MODE_REG  ===================================================== */
#define GPIO_P0_21_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_21_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_21_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_21_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_21_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_21_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_22_MODE_REG  ===================================================== */
#define GPIO_P0_22_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_22_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_22_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_22_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_22_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_22_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_23_MODE_REG  ===================================================== */
#define GPIO_P0_23_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_23_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_23_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_23_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_23_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_23_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_24_MODE_REG  ===================================================== */
#define GPIO_P0_24_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_24_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_24_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_24_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_24_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_24_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_25_MODE_REG  ===================================================== */
#define GPIO_P0_25_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_25_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_25_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_25_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_25_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_25_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_26_MODE_REG  ===================================================== */
#define GPIO_P0_26_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_26_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_26_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_26_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_26_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_26_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_27_MODE_REG  ===================================================== */
#define GPIO_P0_27_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_27_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_27_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_27_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_27_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_27_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_28_MODE_REG  ===================================================== */
#define GPIO_P0_28_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_28_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_28_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_28_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_28_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_28_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_29_MODE_REG  ===================================================== */
#define GPIO_P0_29_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_29_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_29_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_29_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_29_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_29_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_30_MODE_REG  ===================================================== */
#define GPIO_P0_30_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_30_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_30_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_30_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_30_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_30_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P0_31_MODE_REG  ===================================================== */
#define GPIO_P0_31_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P0_31_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P0_31_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P0_31_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P0_31_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P0_31_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ======================================================  P0_DATA_REG  ====================================================== */
#define GPIO_P0_DATA_REG_P0_DATA_Pos      (0UL)                     /*!< P0_DATA (Bit 0)                                       */
#define GPIO_P0_DATA_REG_P0_DATA_Msk      (0xffffffffUL)            /*!< P0_DATA (Bitfield-Mask: 0xffffffff)                   */
/* ==================================================  P0_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P0_PADPWR_CTRL_REG_P0_31_OUT_CTRL_Pos (31UL)           /*!< P0_31_OUT_CTRL (Bit 31)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_31_OUT_CTRL_Msk (0x80000000UL)   /*!< P0_31_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_30_OUT_CTRL_Pos (30UL)           /*!< P0_30_OUT_CTRL (Bit 30)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_30_OUT_CTRL_Msk (0x40000000UL)   /*!< P0_30_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_29_OUT_CTRL_Pos (29UL)           /*!< P0_29_OUT_CTRL (Bit 29)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_29_OUT_CTRL_Msk (0x20000000UL)   /*!< P0_29_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_28_OUT_CTRL_Pos (28UL)           /*!< P0_28_OUT_CTRL (Bit 28)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_28_OUT_CTRL_Msk (0x10000000UL)   /*!< P0_28_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_27_OUT_CTRL_Pos (27UL)           /*!< P0_27_OUT_CTRL (Bit 27)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_27_OUT_CTRL_Msk (0x8000000UL)    /*!< P0_27_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_24_OUT_CTRL_Pos (24UL)           /*!< P0_24_OUT_CTRL (Bit 24)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_24_OUT_CTRL_Msk (0x1000000UL)    /*!< P0_24_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_23_OUT_CTRL_Pos (23UL)           /*!< P0_23_OUT_CTRL (Bit 23)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_23_OUT_CTRL_Msk (0x800000UL)     /*!< P0_23_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_22_OUT_CTRL_Pos (22UL)           /*!< P0_22_OUT_CTRL (Bit 22)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_22_OUT_CTRL_Msk (0x400000UL)     /*!< P0_22_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_21_OUT_CTRL_Pos (21UL)           /*!< P0_21_OUT_CTRL (Bit 21)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_21_OUT_CTRL_Msk (0x200000UL)     /*!< P0_21_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_20_OUT_CTRL_Pos (20UL)           /*!< P0_20_OUT_CTRL (Bit 20)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_20_OUT_CTRL_Msk (0x100000UL)     /*!< P0_20_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_19_OUT_CTRL_Pos (19UL)           /*!< P0_19_OUT_CTRL (Bit 19)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_19_OUT_CTRL_Msk (0x80000UL)      /*!< P0_19_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_18_OUT_CTRL_Pos (18UL)           /*!< P0_18_OUT_CTRL (Bit 18)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_18_OUT_CTRL_Msk (0x40000UL)      /*!< P0_18_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_17_OUT_CTRL_Pos (17UL)           /*!< P0_17_OUT_CTRL (Bit 17)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_17_OUT_CTRL_Msk (0x20000UL)      /*!< P0_17_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_16_OUT_CTRL_Pos (16UL)           /*!< P0_16_OUT_CTRL (Bit 16)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_16_OUT_CTRL_Msk (0x10000UL)      /*!< P0_16_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_15_OUT_CTRL_Pos (15UL)           /*!< P0_15_OUT_CTRL (Bit 15)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_15_OUT_CTRL_Msk (0x8000UL)       /*!< P0_15_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_14_OUT_CTRL_Pos (14UL)           /*!< P0_14_OUT_CTRL (Bit 14)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_14_OUT_CTRL_Msk (0x4000UL)       /*!< P0_14_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_11_OUT_CTRL_Pos (11UL)           /*!< P0_11_OUT_CTRL (Bit 11)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_11_OUT_CTRL_Msk (0x800UL)        /*!< P0_11_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_10_OUT_CTRL_Pos (10UL)           /*!< P0_10_OUT_CTRL (Bit 10)                               */
#define GPIO_P0_PADPWR_CTRL_REG_P0_10_OUT_CTRL_Msk (0x400UL)        /*!< P0_10_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_09_OUT_CTRL_Pos (9UL)            /*!< P0_09_OUT_CTRL (Bit 9)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_09_OUT_CTRL_Msk (0x200UL)        /*!< P0_09_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_08_OUT_CTRL_Pos (8UL)            /*!< P0_08_OUT_CTRL (Bit 8)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_08_OUT_CTRL_Msk (0x100UL)        /*!< P0_08_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_07_OUT_CTRL_Pos (7UL)            /*!< P0_07_OUT_CTRL (Bit 7)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_07_OUT_CTRL_Msk (0x80UL)         /*!< P0_07_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_06_OUT_CTRL_Pos (6UL)            /*!< P0_06_OUT_CTRL (Bit 6)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_06_OUT_CTRL_Msk (0x40UL)         /*!< P0_06_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_05_OUT_CTRL_Pos (5UL)            /*!< P0_05_OUT_CTRL (Bit 5)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_05_OUT_CTRL_Msk (0x20UL)         /*!< P0_05_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_04_OUT_CTRL_Pos (4UL)            /*!< P0_04_OUT_CTRL (Bit 4)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_04_OUT_CTRL_Msk (0x10UL)         /*!< P0_04_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_03_OUT_CTRL_Pos (3UL)            /*!< P0_03_OUT_CTRL (Bit 3)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_03_OUT_CTRL_Msk (0x8UL)          /*!< P0_03_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_02_OUT_CTRL_Pos (2UL)            /*!< P0_02_OUT_CTRL (Bit 2)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_02_OUT_CTRL_Msk (0x4UL)          /*!< P0_02_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_01_OUT_CTRL_Pos (1UL)            /*!< P0_01_OUT_CTRL (Bit 1)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_01_OUT_CTRL_Msk (0x2UL)          /*!< P0_01_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P0_PADPWR_CTRL_REG_P0_00_OUT_CTRL_Pos (0UL)            /*!< P0_00_OUT_CTRL (Bit 0)                                */
#define GPIO_P0_PADPWR_CTRL_REG_P0_00_OUT_CTRL_Msk (0x1UL)          /*!< P0_00_OUT_CTRL (Bitfield-Mask: 0x01)                  */
/* ===================================================  P0_RESET_DATA_REG  =================================================== */
#define GPIO_P0_RESET_DATA_REG_P0_RESET_Pos (0UL)                   /*!< P0_RESET (Bit 0)                                      */
#define GPIO_P0_RESET_DATA_REG_P0_RESET_Msk (0xffffffffUL)          /*!< P0_RESET (Bitfield-Mask: 0xffffffff)                  */
/* ====================================================  P0_SET_DATA_REG  ==================================================== */
#define GPIO_P0_SET_DATA_REG_P0_SET_Pos   (0UL)                     /*!< P0_SET (Bit 0)                                        */
#define GPIO_P0_SET_DATA_REG_P0_SET_Msk   (0xffffffffUL)            /*!< P0_SET (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  P0_WEAK_CTRL_REG  ==================================================== */
#define GPIO_P0_WEAK_CTRL_REG_P0_31_LOWDRV_Pos (31UL)               /*!< P0_31_LOWDRV (Bit 31)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_31_LOWDRV_Msk (0x80000000UL)       /*!< P0_31_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_30_LOWDRV_Pos (30UL)               /*!< P0_30_LOWDRV (Bit 30)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_30_LOWDRV_Msk (0x40000000UL)       /*!< P0_30_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_29_LOWDRV_Pos (29UL)               /*!< P0_29_LOWDRV (Bit 29)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_29_LOWDRV_Msk (0x20000000UL)       /*!< P0_29_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_28_LOWDRV_Pos (28UL)               /*!< P0_28_LOWDRV (Bit 28)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_28_LOWDRV_Msk (0x10000000UL)       /*!< P0_28_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_27_LOWDRV_Pos (27UL)               /*!< P0_27_LOWDRV (Bit 27)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_27_LOWDRV_Msk (0x8000000UL)        /*!< P0_27_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_24_LOWDRV_Pos (24UL)               /*!< P0_24_LOWDRV (Bit 24)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_24_LOWDRV_Msk (0x1000000UL)        /*!< P0_24_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_23_LOWDRV_Pos (23UL)               /*!< P0_23_LOWDRV (Bit 23)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_23_LOWDRV_Msk (0x800000UL)         /*!< P0_23_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_22_LOWDRV_Pos (22UL)               /*!< P0_22_LOWDRV (Bit 22)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_22_LOWDRV_Msk (0x400000UL)         /*!< P0_22_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_21_LOWDRV_Pos (21UL)               /*!< P0_21_LOWDRV (Bit 21)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_21_LOWDRV_Msk (0x200000UL)         /*!< P0_21_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_20_LOWDRV_Pos (20UL)               /*!< P0_20_LOWDRV (Bit 20)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_20_LOWDRV_Msk (0x100000UL)         /*!< P0_20_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_19_LOWDRV_Pos (19UL)               /*!< P0_19_LOWDRV (Bit 19)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_19_LOWDRV_Msk (0x80000UL)          /*!< P0_19_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_18_LOWDRV_Pos (18UL)               /*!< P0_18_LOWDRV (Bit 18)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_18_LOWDRV_Msk (0x40000UL)          /*!< P0_18_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_17_LOWDRV_Pos (17UL)               /*!< P0_17_LOWDRV (Bit 17)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_17_LOWDRV_Msk (0x20000UL)          /*!< P0_17_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_16_LOWDRV_Pos (16UL)               /*!< P0_16_LOWDRV (Bit 16)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_16_LOWDRV_Msk (0x10000UL)          /*!< P0_16_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_15_LOWDRV_Pos (15UL)               /*!< P0_15_LOWDRV (Bit 15)                                 */
#define GPIO_P0_WEAK_CTRL_REG_P0_15_LOWDRV_Msk (0x8000UL)           /*!< P0_15_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P0_WEAK_CTRL_REG_P0_14_LOWDRV_Pos (14UL)               /*!< P0_14_LOWDRV (Bit 14)                                 */
