antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define GPIO_P1_22_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_22_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_23_MODE_REG  ===================================================== */
#define GPIO_P1_23_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_23_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_23_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_23_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_23_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_23_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_24_MODE_REG  ===================================================== */
#define GPIO_P1_24_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_24_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_24_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_24_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_24_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_24_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_25_MODE_REG  ===================================================== */
#define GPIO_P1_25_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_25_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_25_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_25_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_25_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_25_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_26_MODE_REG  ===================================================== */
#define GPIO_P1_26_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_26_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_26_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_26_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_26_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_26_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_27_MODE_REG  ===================================================== */
#define GPIO_P1_27_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_27_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_27_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_27_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_27_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_27_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_28_MODE_REG  ===================================================== */
#define GPIO_P1_28_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_28_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_28_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_28_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_28_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_28_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_29_MODE_REG  ===================================================== */
#define GPIO_P1_29_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_29_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_29_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_29_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_29_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_29_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_30_MODE_REG  ===================================================== */
#define GPIO_P1_30_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_30_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_30_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_30_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_30_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_30_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P1_31_MODE_REG  ===================================================== */
#define GPIO_P1_31_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P1_31_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P1_31_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P1_31_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P1_31_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P1_31_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ======================================================  P1_DATA_REG  ====================================================== */
#define GPIO_P1_DATA_REG_P1_DATA_Pos      (0UL)                     /*!< P1_DATA (Bit 0)                                       */
#define GPIO_P1_DATA_REG_P1_DATA_Msk      (0xffffffffUL)            /*!< P1_DATA (Bitfield-Mask: 0xffffffff)                   */
/* ==================================================  P1_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P1_PADPWR_CTRL_REG_P1_31_OUT_CTRL_Pos (31UL)           /*!< P1_31_OUT_CTRL (Bit 31)                               */
#define GPIO_P1_PADPWR_CTRL_REG_P1_31_OUT_CTRL_Msk (0x80000000UL)   /*!< P1_31_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_30_OUT_CTRL_Pos (30UL)           /*!< P1_30_OUT_CTRL (Bit 30)                               */
#define GPIO_P1_PADPWR_CTRL_REG_P1_30_OUT_CTRL_Msk (0x40000000UL)   /*!< P1_30_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_23_OUT_CTRL_Pos (23UL)           /*!< P1_23_OUT_CTRL (Bit 23)                               */
#define GPIO_P1_PADPWR_CTRL_REG_P1_23_OUT_CTRL_Msk (0x800000UL)     /*!< P1_23_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_22_OUT_CTRL_Pos (22UL)           /*!< P1_22_OUT_CTRL (Bit 22)                               */
#define GPIO_P1_PADPWR_CTRL_REG_P1_22_OUT_CTRL_Msk (0x400000UL)     /*!< P1_22_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_12_OUT_CTRL_Pos (12UL)           /*!< P1_12_OUT_CTRL (Bit 12)                               */
#define GPIO_P1_PADPWR_CTRL_REG_P1_12_OUT_CTRL_Msk (0x1000UL)       /*!< P1_12_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_11_OUT_CTRL_Pos (11UL)           /*!< P1_11_OUT_CTRL (Bit 11)                               */
#define GPIO_P1_PADPWR_CTRL_REG_P1_11_OUT_CTRL_Msk (0x800UL)        /*!< P1_11_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_07_OUT_CTRL_Pos (7UL)            /*!< P1_07_OUT_CTRL (Bit 7)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_07_OUT_CTRL_Msk (0x80UL)         /*!< P1_07_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_06_OUT_CTRL_Pos (6UL)            /*!< P1_06_OUT_CTRL (Bit 6)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_06_OUT_CTRL_Msk (0x40UL)         /*!< P1_06_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_05_OUT_CTRL_Pos (5UL)            /*!< P1_05_OUT_CTRL (Bit 5)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_05_OUT_CTRL_Msk (0x20UL)         /*!< P1_05_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_04_OUT_CTRL_Pos (4UL)            /*!< P1_04_OUT_CTRL (Bit 4)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_04_OUT_CTRL_Msk (0x10UL)         /*!< P1_04_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_03_OUT_CTRL_Pos (3UL)            /*!< P1_03_OUT_CTRL (Bit 3)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_03_OUT_CTRL_Msk (0x8UL)          /*!< P1_03_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_01_OUT_CTRL_Pos (1UL)            /*!< P1_01_OUT_CTRL (Bit 1)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_01_OUT_CTRL_Msk (0x2UL)          /*!< P1_01_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P1_PADPWR_CTRL_REG_P1_00_OUT_CTRL_Pos (0UL)            /*!< P1_00_OUT_CTRL (Bit 0)                                */
#define GPIO_P1_PADPWR_CTRL_REG_P1_00_OUT_CTRL_Msk (0x1UL)          /*!< P1_00_OUT_CTRL (Bitfield-Mask: 0x01)                  */
/* ===================================================  P1_RESET_DATA_REG  =================================================== */
#define GPIO_P1_RESET_DATA_REG_P1_RESET_Pos (0UL)                   /*!< P1_RESET (Bit 0)                                      */
#define GPIO_P1_RESET_DATA_REG_P1_RESET_Msk (0xffffffffUL)          /*!< P1_RESET (Bitfield-Mask: 0xffffffff)                  */
/* ====================================================  P1_SET_DATA_REG  ==================================================== */
#define GPIO_P1_SET_DATA_REG_P1_SET_Pos   (0UL)                     /*!< P1_SET (Bit 0)                                        */
#define GPIO_P1_SET_DATA_REG_P1_SET_Msk   (0xffffffffUL)            /*!< P1_SET (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  P1_WEAK_CTRL_REG  ==================================================== */
#define GPIO_P1_WEAK_CTRL_REG_P1_31_LOWDRV_Pos (31UL)               /*!< P1_31_LOWDRV (Bit 31)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_31_LOWDRV_Msk (0x80000000UL)       /*!< P1_31_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_30_LOWDRV_Pos (30UL)               /*!< P1_30_LOWDRV (Bit 30)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_30_LOWDRV_Msk (0x40000000UL)       /*!< P1_30_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_27_LOWDRV_Pos (27UL)               /*!< P1_27_LOWDRV (Bit 27)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_27_LOWDRV_Msk (0x8000000UL)        /*!< P1_27_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_26_LOWDRV_Pos (26UL)               /*!< P1_26_LOWDRV (Bit 26)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_26_LOWDRV_Msk (0x4000000UL)        /*!< P1_26_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_25_LOWDRV_Pos (25UL)               /*!< P1_25_LOWDRV (Bit 25)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_25_LOWDRV_Msk (0x2000000UL)        /*!< P1_25_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_24_LOWDRV_Pos (24UL)               /*!< P1_24_LOWDRV (Bit 24)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_24_LOWDRV_Msk (0x1000000UL)        /*!< P1_24_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_23_LOWDRV_Pos (23UL)               /*!< P1_23_LOWDRV (Bit 23)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_23_LOWDRV_Msk (0x800000UL)         /*!< P1_23_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_22_LOWDRV_Pos (22UL)               /*!< P1_22_LOWDRV (Bit 22)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_22_LOWDRV_Msk (0x400000UL)         /*!< P1_22_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_20_LOWDRV_Pos (20UL)               /*!< P1_20_LOWDRV (Bit 20)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_20_LOWDRV_Msk (0x100000UL)         /*!< P1_20_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_19_LOWDRV_Pos (19UL)               /*!< P1_19_LOWDRV (Bit 19)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_19_LOWDRV_Msk (0x80000UL)          /*!< P1_19_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_15_LOWDRV_Pos (15UL)               /*!< P1_15_LOWDRV (Bit 15)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_15_LOWDRV_Msk (0x8000UL)           /*!< P1_15_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_14_LOWDRV_Pos (14UL)               /*!< P1_14_LOWDRV (Bit 14)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_14_LOWDRV_Msk (0x4000UL)           /*!< P1_14_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_13_LOWDRV_Pos (13UL)               /*!< P1_13_LOWDRV (Bit 13)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_13_LOWDRV_Msk (0x2000UL)           /*!< P1_13_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_12_LOWDRV_Pos (12UL)               /*!< P1_12_LOWDRV (Bit 12)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_12_LOWDRV_Msk (0x1000UL)           /*!< P1_12_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_11_LOWDRV_Pos (11UL)               /*!< P1_11_LOWDRV (Bit 11)                                 */
#define GPIO_P1_WEAK_CTRL_REG_P1_11_LOWDRV_Msk (0x800UL)            /*!< P1_11_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_07_LOWDRV_Pos (7UL)                /*!< P1_07_LOWDRV (Bit 7)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_07_LOWDRV_Msk (0x80UL)             /*!< P1_07_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_06_LOWDRV_Pos (6UL)                /*!< P1_06_LOWDRV (Bit 6)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_06_LOWDRV_Msk (0x40UL)             /*!< P1_06_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_05_LOWDRV_Pos (5UL)                /*!< P1_05_LOWDRV (Bit 5)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_05_LOWDRV_Msk (0x20UL)             /*!< P1_05_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_04_LOWDRV_Pos (4UL)                /*!< P1_04_LOWDRV (Bit 4)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_04_LOWDRV_Msk (0x10UL)             /*!< P1_04_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_03_LOWDRV_Pos (3UL)                /*!< P1_03_LOWDRV (Bit 3)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_03_LOWDRV_Msk (0x8UL)              /*!< P1_03_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_01_LOWDRV_Pos (1UL)                /*!< P1_01_LOWDRV (Bit 1)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_01_LOWDRV_Msk (0x2UL)              /*!< P1_01_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P1_WEAK_CTRL_REG_P1_00_LOWDRV_Pos (0UL)                /*!< P1_00_LOWDRV (Bit 0)                                  */
#define GPIO_P1_WEAK_CTRL_REG_P1_00_LOWDRV_Msk (0x1UL)              /*!< P1_00_LOWDRV (Bitfield-Mask: 0x01)                    */
/* ====================================================  P2_00_MODE_REG  ===================================================== */
#define GPIO_P2_00_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_00_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_00_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_00_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_00_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_00_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_01_MODE_REG  ===================================================== */
#define GPIO_P2_01_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_01_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_01_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_01_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_01_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_01_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_02_MODE_REG  ===================================================== */
#define GPIO_P2_02_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_02_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_02_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_02_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_02_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_02_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_03_MODE_REG  ===================================================== */
#define GPIO_P2_03_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_03_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_03_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_03_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_03_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_03_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_04_MODE_REG  ===================================================== */
#define GPIO_P2_04_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_04_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_04_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_04_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_04_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_04_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_05_MODE_REG  ===================================================== */
#define GPIO_P2_05_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_05_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
