antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define GPIO_P2_05_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_05_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_05_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_05_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_06_MODE_REG  ===================================================== */
#define GPIO_P2_06_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_06_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_06_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_06_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_06_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_06_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_07_MODE_REG  ===================================================== */
#define GPIO_P2_07_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_07_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_07_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_07_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_07_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_07_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_08_MODE_REG  ===================================================== */
#define GPIO_P2_08_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_08_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_08_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_08_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_08_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_08_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_09_MODE_REG  ===================================================== */
#define GPIO_P2_09_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_09_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_09_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_09_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_09_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_09_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_10_MODE_REG  ===================================================== */
#define GPIO_P2_10_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_10_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_10_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_10_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_10_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_10_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_11_MODE_REG  ===================================================== */
#define GPIO_P2_11_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_11_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_11_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_11_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_11_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_11_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_12_MODE_REG  ===================================================== */
#define GPIO_P2_12_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_12_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_12_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_12_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_12_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_12_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_13_MODE_REG  ===================================================== */
#define GPIO_P2_13_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_13_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_13_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_13_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_13_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_13_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ====================================================  P2_14_MODE_REG  ===================================================== */
#define GPIO_P2_14_MODE_REG_PPOD_Pos      (10UL)                    /*!< PPOD (Bit 10)                                         */
#define GPIO_P2_14_MODE_REG_PPOD_Msk      (0x400UL)                 /*!< PPOD (Bitfield-Mask: 0x01)                            */
#define GPIO_P2_14_MODE_REG_PUPD_Pos      (8UL)                     /*!< PUPD (Bit 8)                                          */
#define GPIO_P2_14_MODE_REG_PUPD_Msk      (0x300UL)                 /*!< PUPD (Bitfield-Mask: 0x03)                            */
#define GPIO_P2_14_MODE_REG_PID_Pos       (0UL)                     /*!< PID (Bit 0)                                           */
#define GPIO_P2_14_MODE_REG_PID_Msk       (0x3fUL)                  /*!< PID (Bitfield-Mask: 0x3f)                             */
/* ======================================================  P2_DATA_REG  ====================================================== */
#define GPIO_P2_DATA_REG_P2_DATA_Pos      (0UL)                     /*!< P2_DATA (Bit 0)                                       */
#define GPIO_P2_DATA_REG_P2_DATA_Msk      (0x7fffUL)                /*!< P2_DATA (Bitfield-Mask: 0x7fff)                       */
/* ==================================================  P2_PADPWR_CTRL_REG  =================================================== */
#define GPIO_P2_PADPWR_CTRL_REG_P2_11_OUT_CTRL_Pos (11UL)           /*!< P2_11_OUT_CTRL (Bit 11)                               */
#define GPIO_P2_PADPWR_CTRL_REG_P2_11_OUT_CTRL_Msk (0x800UL)        /*!< P2_11_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P2_PADPWR_CTRL_REG_P2_10_OUT_CTRL_Pos (10UL)           /*!< P2_10_OUT_CTRL (Bit 10)                               */
#define GPIO_P2_PADPWR_CTRL_REG_P2_10_OUT_CTRL_Msk (0x400UL)        /*!< P2_10_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P2_PADPWR_CTRL_REG_P2_09_OUT_CTRL_Pos (9UL)            /*!< P2_09_OUT_CTRL (Bit 9)                                */
#define GPIO_P2_PADPWR_CTRL_REG_P2_09_OUT_CTRL_Msk (0x200UL)        /*!< P2_09_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P2_PADPWR_CTRL_REG_P2_08_OUT_CTRL_Pos (8UL)            /*!< P2_08_OUT_CTRL (Bit 8)                                */
#define GPIO_P2_PADPWR_CTRL_REG_P2_08_OUT_CTRL_Msk (0x100UL)        /*!< P2_08_OUT_CTRL (Bitfield-Mask: 0x01)                  */
#define GPIO_P2_PADPWR_CTRL_REG_P2_01_OUT_CTRL_Pos (1UL)            /*!< P2_01_OUT_CTRL (Bit 1)                                */
#define GPIO_P2_PADPWR_CTRL_REG_P2_01_OUT_CTRL_Msk (0x2UL)          /*!< P2_01_OUT_CTRL (Bitfield-Mask: 0x01)                  */
/* ===================================================  P2_RESET_DATA_REG  =================================================== */
#define GPIO_P2_RESET_DATA_REG_P2_RESET_Pos (0UL)                   /*!< P2_RESET (Bit 0)                                      */
#define GPIO_P2_RESET_DATA_REG_P2_RESET_Msk (0x7fffUL)              /*!< P2_RESET (Bitfield-Mask: 0x7fff)                      */
/* ====================================================  P2_SET_DATA_REG  ==================================================== */
#define GPIO_P2_SET_DATA_REG_P2_SET_Pos   (0UL)                     /*!< P2_SET (Bit 0)                                        */
#define GPIO_P2_SET_DATA_REG_P2_SET_Msk   (0x7fffUL)                /*!< P2_SET (Bitfield-Mask: 0x7fff)                        */
/* ===================================================  P2_WEAK_CTRL_REG  ==================================================== */
#define GPIO_P2_WEAK_CTRL_REG_P2_09_LOWDRV_Pos (9UL)                /*!< P2_09_LOWDRV (Bit 9)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_09_LOWDRV_Msk (0x200UL)            /*!< P2_09_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P2_WEAK_CTRL_REG_P2_08_LOWDRV_Pos (8UL)                /*!< P2_08_LOWDRV (Bit 8)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_08_LOWDRV_Msk (0x100UL)            /*!< P2_08_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P2_WEAK_CTRL_REG_P2_07_LOWDRV_Pos (7UL)                /*!< P2_07_LOWDRV (Bit 7)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_07_LOWDRV_Msk (0x80UL)             /*!< P2_07_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P2_WEAK_CTRL_REG_P2_06_LOWDRV_Pos (6UL)                /*!< P2_06_LOWDRV (Bit 6)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_06_LOWDRV_Msk (0x40UL)             /*!< P2_06_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P2_WEAK_CTRL_REG_P2_05_LOWDRV_Pos (5UL)                /*!< P2_05_LOWDRV (Bit 5)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_05_LOWDRV_Msk (0x20UL)             /*!< P2_05_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P2_WEAK_CTRL_REG_P2_04_LOWDRV_Pos (4UL)                /*!< P2_04_LOWDRV (Bit 4)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_04_LOWDRV_Msk (0x10UL)             /*!< P2_04_LOWDRV (Bitfield-Mask: 0x01)                    */
#define GPIO_P2_WEAK_CTRL_REG_P2_01_LOWDRV_Pos (1UL)                /*!< P2_01_LOWDRV (Bit 1)                                  */
#define GPIO_P2_WEAK_CTRL_REG_P2_01_LOWDRV_Msk (0x2UL)              /*!< P2_01_LOWDRV (Bitfield-Mask: 0x01)                    */
/* ==================================================  PAD_DRIVE_CTRL_REG  =================================================== */
#define GPIO_PAD_DRIVE_CTRL_REG_EMMC_DRIVE_Pos (10UL)               /*!< EMMC_DRIVE (Bit 10)                                   */
#define GPIO_PAD_DRIVE_CTRL_REG_EMMC_DRIVE_Msk (0xc00UL)            /*!< EMMC_DRIVE (Bitfield-Mask: 0x03)                      */
#define GPIO_PAD_DRIVE_CTRL_REG_EMMC_SLEW_Pos (8UL)                 /*!< EMMC_SLEW (Bit 8)                                     */
#define GPIO_PAD_DRIVE_CTRL_REG_EMMC_SLEW_Msk (0x300UL)             /*!< EMMC_SLEW (Bitfield-Mask: 0x03)                       */
#define GPIO_PAD_DRIVE_CTRL_REG_SPI3_DRIVE_Pos (2UL)                /*!< SPI3_DRIVE (Bit 2)                                    */
#define GPIO_PAD_DRIVE_CTRL_REG_SPI3_DRIVE_Msk (0xcUL)              /*!< SPI3_DRIVE (Bitfield-Mask: 0x03)                      */
#define GPIO_PAD_DRIVE_CTRL_REG_SPI3_SLEW_Pos (0UL)                 /*!< SPI3_SLEW (Bit 0)                                     */
#define GPIO_PAD_DRIVE_CTRL_REG_SPI3_SLEW_Msk (0x3UL)               /*!< SPI3_SLEW (Bitfield-Mask: 0x03)                       */


/* =========================================================================================================================== */
/* ================                                           GPREG                                           ================ */
/* =========================================================================================================================== */

