antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ======================================================  D2_CACHECTL  ====================================================== */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_FLUSH_TX_Pos (3UL)        /*!< D2C_CACHECTL_FLUSH_TX (Bit 3)                         */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_FLUSH_TX_Msk (0x8UL)      /*!< D2C_CACHECTL_FLUSH_TX (Bitfield-Mask: 0x01)           */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_ENABLE_TX_Pos (2UL)       /*!< D2C_CACHECTL_ENABLE_TX (Bit 2)                        */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_ENABLE_TX_Msk (0x4UL)     /*!< D2C_CACHECTL_ENABLE_TX (Bitfield-Mask: 0x01)          */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_FLUSH_FB_Pos (1UL)        /*!< D2C_CACHECTL_FLUSH_FB (Bit 1)                         */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_FLUSH_FB_Msk (0x2UL)      /*!< D2C_CACHECTL_FLUSH_FB (Bitfield-Mask: 0x01)           */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_ENABLE_FB_Pos (0UL)       /*!< D2C_CACHECTL_ENABLE_FB (Bit 0)                        */
#define GPU_CORE_D2_CACHECTL_D2C_CACHECTL_ENABLE_FB_Msk (0x1UL)     /*!< D2C_CACHECTL_ENABLE_FB (Bitfield-Mask: 0x01)          */
/* =======================================================  D2_COLKEY  ======================================================= */
#define GPU_CORE_D2_COLKEY_COLKEY_RGB_Pos (0UL)                     /*!< COLKEY_RGB (Bit 0)                                    */
#define GPU_CORE_D2_COLKEY_COLKEY_RGB_Msk (0xffffffUL)              /*!< COLKEY_RGB (Bitfield-Mask: 0xffffff)                  */
/* =======================================================  D2_COLOR1  ======================================================= */
#define GPU_CORE_D2_COLOR1_COLOR1_Pos     (0UL)                     /*!< COLOR1 (Bit 0)                                        */
#define GPU_CORE_D2_COLOR1_COLOR1_Msk     (0xffffffffUL)            /*!< COLOR1 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_COLOR2  ======================================================= */
#define GPU_CORE_D2_COLOR2_COLOR2_Pos     (0UL)                     /*!< COLOR2 (Bit 0)                                        */
#define GPU_CORE_D2_COLOR2_COLOR2_Msk     (0xffffffffUL)            /*!< COLOR2 (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_CONTROL  ======================================================= */
#define GPU_CORE_D2_CONTROL_D2C_LIMITERPRECISION_Pos (24UL)         /*!< D2C_LIMITERPRECISION (Bit 24)                         */
#define GPU_CORE_D2_CONTROL_D2C_LIMITERPRECISION_Msk (0x1000000UL)  /*!< D2C_LIMITERPRECISION (Bitfield-Mask: 0x01)            */
#define GPU_CORE_D2_CONTROL_D2C_SPANSTORE_Pos (23UL)                /*!< D2C_SPANSTORE (Bit 23)                                */
#define GPU_CORE_D2_CONTROL_D2C_SPANSTORE_Msk (0x800000UL)          /*!< D2C_SPANSTORE (Bitfield-Mask: 0x01)                   */
#define GPU_CORE_D2_CONTROL_D2C_SPANABORT_Pos (22UL)                /*!< D2C_SPANABORT (Bit 22)                                */
#define GPU_CORE_D2_CONTROL_D2C_SPANABORT_Msk (0x400000UL)          /*!< D2C_SPANABORT (Bitfield-Mask: 0x01)                   */
#define GPU_CORE_D2_CONTROL_D2C_UNIONCD_Pos (21UL)                  /*!< D2C_UNIONCD (Bit 21)                                  */
#define GPU_CORE_D2_CONTROL_D2C_UNIONCD_Msk (0x200000UL)            /*!< D2C_UNIONCD (Bitfield-Mask: 0x01)                     */
#define GPU_CORE_D2_CONTROL_D2C_UNIONAB_Pos (20UL)                  /*!< D2C_UNIONAB (Bit 20)                                  */
#define GPU_CORE_D2_CONTROL_D2C_UNIONAB_Msk (0x100000UL)            /*!< D2C_UNIONAB (Bitfield-Mask: 0x01)                     */
#define GPU_CORE_D2_CONTROL_D2C_UNION56_Pos (19UL)                  /*!< D2C_UNION56 (Bit 19)                                  */
#define GPU_CORE_D2_CONTROL_D2C_UNION56_Msk (0x80000UL)             /*!< D2C_UNION56 (Bitfield-Mask: 0x01)                     */
#define GPU_CORE_D2_CONTROL_D2C_UNION34_Pos (18UL)                  /*!< D2C_UNION34 (Bit 18)                                  */
#define GPU_CORE_D2_CONTROL_D2C_UNION34_Msk (0x40000UL)             /*!< D2C_UNION34 (Bitfield-Mask: 0x01)                     */
#define GPU_CORE_D2_CONTROL_D2C_UNION12_Pos (17UL)                  /*!< D2C_UNION12 (Bit 17)                                  */
#define GPU_CORE_D2_CONTROL_D2C_UNION12_Msk (0x20000UL)             /*!< D2C_UNION12 (Bitfield-Mask: 0x01)                     */
#define GPU_CORE_D2_CONTROL_D2C_BAND2ENABLE_Pos (16UL)              /*!< D2C_BAND2ENABLE (Bit 16)                              */
#define GPU_CORE_D2_CONTROL_D2C_BAND2ENABLE_Msk (0x10000UL)         /*!< D2C_BAND2ENABLE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL_D2C_BAND1ENABLE_Pos (15UL)              /*!< D2C_BAND1ENABLE (Bit 15)                              */
#define GPU_CORE_D2_CONTROL_D2C_BAND1ENABLE_Msk (0x8000UL)          /*!< D2C_BAND1ENABLE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL_D2C_LIM6THRESHOLD_Pos (14UL)            /*!< D2C_LIM6THRESHOLD (Bit 14)                            */
#define GPU_CORE_D2_CONTROL_D2C_LIM6THRESHOLD_Msk (0x4000UL)        /*!< D2C_LIM6THRESHOLD (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL_D2C_LIM5THRESHOLD_Pos (13UL)            /*!< D2C_LIM5THRESHOLD (Bit 13)                            */
#define GPU_CORE_D2_CONTROL_D2C_LIM5THRESHOLD_Msk (0x2000UL)        /*!< D2C_LIM5THRESHOLD (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL_D2C_LIM4THRESHOLD_Pos (12UL)            /*!< D2C_LIM4THRESHOLD (Bit 12)                            */
#define GPU_CORE_D2_CONTROL_D2C_LIM4THRESHOLD_Msk (0x1000UL)        /*!< D2C_LIM4THRESHOLD (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL_D2C_LIM3THRESHOLD_Pos (11UL)            /*!< D2C_LIM3THRESHOLD (Bit 11)                            */
#define GPU_CORE_D2_CONTROL_D2C_LIM3THRESHOLD_Msk (0x800UL)         /*!< D2C_LIM3THRESHOLD (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL_D2C_LIM2THRESHOLD_Pos (10UL)            /*!< D2C_LIM2THRESHOLD (Bit 10)                            */
#define GPU_CORE_D2_CONTROL_D2C_LIM2THRESHOLD_Msk (0x400UL)         /*!< D2C_LIM2THRESHOLD (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL_D2C_LIM1THRESHOLD_Pos (9UL)             /*!< D2C_LIM1THRESHOLD (Bit 9)                             */
#define GPU_CORE_D2_CONTROL_D2C_LIM1THRESHOLD_Msk (0x200UL)         /*!< D2C_LIM1THRESHOLD (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL_D2C_QUAD3ENABLE_Pos (8UL)               /*!< D2C_QUAD3ENABLE (Bit 8)                               */
#define GPU_CORE_D2_CONTROL_D2C_QUAD3ENABLE_Msk (0x100UL)           /*!< D2C_QUAD3ENABLE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL_D2C_QUAD2ENABLE_Pos (7UL)               /*!< D2C_QUAD2ENABLE (Bit 7)                               */
#define GPU_CORE_D2_CONTROL_D2C_QUAD2ENABLE_Msk (0x80UL)            /*!< D2C_QUAD2ENABLE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL_D2C_QUAD1ENABLE_Pos (6UL)               /*!< D2C_QUAD1ENABLE (Bit 6)                               */
#define GPU_CORE_D2_CONTROL_D2C_QUAD1ENABLE_Msk (0x40UL)            /*!< D2C_QUAD1ENABLE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL_D2C_LIM6ENABLE_Pos (5UL)                /*!< D2C_LIM6ENABLE (Bit 5)                                */
#define GPU_CORE_D2_CONTROL_D2C_LIM6ENABLE_Msk (0x20UL)             /*!< D2C_LIM6ENABLE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL_D2C_LIM5ENABLE_Pos (4UL)                /*!< D2C_LIM5ENABLE (Bit 4)                                */
#define GPU_CORE_D2_CONTROL_D2C_LIM5ENABLE_Msk (0x10UL)             /*!< D2C_LIM5ENABLE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL_D2C_LIM4ENABLE_Pos (3UL)                /*!< D2C_LIM4ENABLE (Bit 3)                                */
#define GPU_CORE_D2_CONTROL_D2C_LIM4ENABLE_Msk (0x8UL)              /*!< D2C_LIM4ENABLE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL_D2C_LIM3ENABLE_Pos (2UL)                /*!< D2C_LIM3ENABLE (Bit 2)                                */
#define GPU_CORE_D2_CONTROL_D2C_LIM3ENABLE_Msk (0x4UL)              /*!< D2C_LIM3ENABLE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL_D2C_LIM2ENABLE_Pos (1UL)                /*!< D2C_LIM2ENABLE (Bit 1)                                */
#define GPU_CORE_D2_CONTROL_D2C_LIM2ENABLE_Msk (0x2UL)              /*!< D2C_LIM2ENABLE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL_D2C_LIM1ENABLE_Pos (0UL)                /*!< D2C_LIM1ENABLE (Bit 0)                                */
#define GPU_CORE_D2_CONTROL_D2C_LIM1ENABLE_Msk (0x1UL)              /*!< D2C_LIM1ENABLE (Bitfield-Mask: 0x01)                  */
/* ======================================================  D2_CONTROL2  ====================================================== */
#define GPU_CORE_D2_CONTROL2_D2C_RLEFORMAT2_Pos (31UL)              /*!< D2C_RLEFORMAT2 (Bit 31)                               */
#define GPU_CORE_D2_CONTROL2_D2C_RLEFORMAT2_Msk (0x80000000UL)      /*!< D2C_RLEFORMAT2 (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL2_D2C_RLEFORMAT1_Pos (30UL)              /*!< D2C_RLEFORMAT1 (Bit 30)                               */
#define GPU_CORE_D2_CONTROL2_D2C_RLEFORMAT1_Msk (0x40000000UL)      /*!< D2C_RLEFORMAT1 (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL2_D2C_BDIA_Pos (29UL)                    /*!< D2C_BDIA (Bit 29)                                     */
#define GPU_CORE_D2_CONTROL2_D2C_BDIA_Msk (0x20000000UL)            /*!< D2C_BDIA (Bitfield-Mask: 0x01)                        */
#define GPU_CORE_D2_CONTROL2_D2C_BSIA_Pos (28UL)                    /*!< D2C_BSIA (Bit 28)                                     */
#define GPU_CORE_D2_CONTROL2_D2C_BSIA_Msk (0x10000000UL)            /*!< D2C_BSIA (Bitfield-Mask: 0x01)                        */
#define GPU_CORE_D2_CONTROL2_D2C_CLUTFORMAT1_Pos (27UL)             /*!< D2C_CLUTFORMAT1 (Bit 27)                              */
#define GPU_CORE_D2_CONTROL2_D2C_CLUTFORMAT1_Msk (0x8000000UL)      /*!< D2C_CLUTFORMAT1 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_COLKEY_ENABLE_Pos (26UL)           /*!< D2C_COLKEY_ENABLE (Bit 26)                            */
#define GPU_CORE_D2_CONTROL2_D2C_COLKEY_ENABLE_Msk (0x4000000UL)    /*!< D2C_COLKEY_ENABLE (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL2_D2C_CLUT_ENABLE_Pos (25UL)             /*!< D2C_CLUT_ENABLE (Bit 25)                              */
#define GPU_CORE_D2_CONTROL2_D2C_CLUT_ENABLE_Msk (0x2000000UL)      /*!< D2C_CLUT_ENABLE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_RLE_ENABLE_Pos (24UL)              /*!< D2C_RLE_ENABLE (Bit 24)                               */
#define GPU_CORE_D2_CONTROL2_D2C_RLE_ENABLE_Msk (0x1000000UL)       /*!< D2C_RLE_ENABLE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA2_Pos (23UL)             /*!< D2C_WRITEALPHA2 (Bit 23)                              */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA2_Msk (0x800000UL)       /*!< D2C_WRITEALPHA2 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA1_Pos (22UL)             /*!< D2C_WRITEALPHA1 (Bit 22)                              */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEALPHA1_Msk (0x400000UL)       /*!< D2C_WRITEALPHA1 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT2_Pos (21UL)            /*!< D2C_WRITEFORMAT2 (Bit 21)                             */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT2_Msk (0x200000UL)      /*!< D2C_WRITEFORMAT2 (Bitfield-Mask: 0x01)                */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT1_Pos (20UL)            /*!< D2C_WRITEFORMAT1 (Bit 20)                             */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT1_Msk (0x100000UL)      /*!< D2C_WRITEFORMAT1 (Bitfield-Mask: 0x01)                */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT2_Pos (19UL)             /*!< D2C_READFORMAT2 (Bit 19)                              */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT2_Msk (0x80000UL)        /*!< D2C_READFORMAT2 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT1_Pos (18UL)             /*!< D2C_READFORMAT1 (Bit 18)                              */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT1_Msk (0x40000UL)        /*!< D2C_READFORMAT1 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERY_Pos (17UL)          /*!< D2C_TEXTUREFILTERY (Bit 17)                           */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERY_Msk (0x20000UL)     /*!< D2C_TEXTUREFILTERY (Bitfield-Mask: 0x01)              */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERX_Pos (16UL)          /*!< D2C_TEXTUREFILTERX (Bit 16)                           */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREFILTERX_Msk (0x10000UL)     /*!< D2C_TEXTUREFILTERX (Bitfield-Mask: 0x01)              */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPY_Pos (15UL)           /*!< D2C_TEXTURECLAMPY (Bit 15)                            */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPY_Msk (0x8000UL)       /*!< D2C_TEXTURECLAMPY (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPX_Pos (14UL)           /*!< D2C_TEXTURECLAMPX (Bit 14)                            */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTURECLAMPX_Msk (0x4000UL)       /*!< D2C_TEXTURECLAMPX (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL2_D2C_BC2_Pos  (13UL)                    /*!< D2C_BC2 (Bit 13)                                      */
#define GPU_CORE_D2_CONTROL2_D2C_BC2_Msk  (0x2000UL)                /*!< D2C_BC2 (Bitfield-Mask: 0x01)                         */
#define GPU_CORE_D2_CONTROL2_D2C_BDI_Pos  (12UL)                    /*!< D2C_BDI (Bit 12)                                      */
#define GPU_CORE_D2_CONTROL2_D2C_BDI_Msk  (0x1000UL)                /*!< D2C_BDI (Bitfield-Mask: 0x01)                         */
#define GPU_CORE_D2_CONTROL2_D2C_BSI_Pos  (11UL)                    /*!< D2C_BSI (Bit 11)                                      */
#define GPU_CORE_D2_CONTROL2_D2C_BSI_Msk  (0x800UL)                 /*!< D2C_BSI (Bitfield-Mask: 0x01)                         */
#define GPU_CORE_D2_CONTROL2_D2C_BDF_Pos  (10UL)                    /*!< D2C_BDF (Bit 10)                                      */
#define GPU_CORE_D2_CONTROL2_D2C_BDF_Msk  (0x400UL)                 /*!< D2C_BDF (Bitfield-Mask: 0x01)                         */
#define GPU_CORE_D2_CONTROL2_D2C_BSF_Pos  (9UL)                     /*!< D2C_BSF (Bit 9)                                       */
#define GPU_CORE_D2_CONTROL2_D2C_BSF_Msk  (0x200UL)                 /*!< D2C_BSF (Bitfield-Mask: 0x01)                         */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT3_Pos (8UL)             /*!< D2C_WRITEFORMAT3 (Bit 8)                              */
#define GPU_CORE_D2_CONTROL2_D2C_WRITEFORMAT3_Msk (0x100UL)         /*!< D2C_WRITEFORMAT3 (Bitfield-Mask: 0x01)                */
#define GPU_CORE_D2_CONTROL2_D2C_BDFA_Pos (7UL)                     /*!< D2C_BDFA (Bit 7)                                      */
#define GPU_CORE_D2_CONTROL2_D2C_BDFA_Msk (0x80UL)                  /*!< D2C_BDFA (Bitfield-Mask: 0x01)                        */
#define GPU_CORE_D2_CONTROL2_D2C_BSFA_Pos (6UL)                     /*!< D2C_BSFA (Bit 6)                                      */
#define GPU_CORE_D2_CONTROL2_D2C_BSFA_Msk (0x40UL)                  /*!< D2C_BSFA (Bitfield-Mask: 0x01)                        */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT4_Pos (5UL)              /*!< D2C_READFORMAT4 (Bit 5)                               */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT4_Msk (0x20UL)           /*!< D2C_READFORMAT4 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT3_Pos (4UL)              /*!< D2C_READFORMAT3 (Bit 4)                               */
#define GPU_CORE_D2_CONTROL2_D2C_READFORMAT3_Msk (0x10UL)           /*!< D2C_READFORMAT3 (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_CONTROL2_USE_ACB_Pos  (3UL)                     /*!< USE_ACB (Bit 3)                                       */
#define GPU_CORE_D2_CONTROL2_USE_ACB_Msk  (0x8UL)                   /*!< USE_ACB (Bitfield-Mask: 0x01)                         */
#define GPU_CORE_D2_CONTROL2_D2C_PATTERNSOURCEL5_Pos (2UL)          /*!< D2C_PATTERNSOURCEL5 (Bit 2)                           */
#define GPU_CORE_D2_CONTROL2_D2C_PATTERNSOURCEL5_Msk (0x4UL)        /*!< D2C_PATTERNSOURCEL5 (Bitfield-Mask: 0x01)             */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREENABLE_Pos (1UL)            /*!< D2C_TEXTUREENABLE (Bit 1)                             */
#define GPU_CORE_D2_CONTROL2_D2C_TEXTUREENABLE_Msk (0x2UL)          /*!< D2C_TEXTUREENABLE (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_CONTROL2_D2C_PATTERNENABLE_Pos (0UL)            /*!< D2C_PATTERNENABLE (Bit 0)                             */
#define GPU_CORE_D2_CONTROL2_D2C_PATTERNENABLE_Msk (0x1UL)          /*!< D2C_PATTERNENABLE (Bitfield-Mask: 0x01)               */
/* ======================================================  D2_CONTROL3  ====================================================== */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MDL_Pos (24UL)             /*!< BURSTLENGTH_MDL (Bit 24)                              */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MDL_Msk (0x7000000UL)      /*!< BURSTLENGTH_MDL (Bitfield-Mask: 0x07)                 */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MTX_Pos (16UL)             /*!< BURSTLENGTH_MTX (Bit 16)                              */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MTX_Msk (0x70000UL)        /*!< BURSTLENGTH_MTX (Bitfield-Mask: 0x07)                 */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBW_Pos (8UL)             /*!< BURSTLENGTH_MFBW (Bit 8)                              */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBW_Msk (0x700UL)         /*!< BURSTLENGTH_MFBW (Bitfield-Mask: 0x07)                */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBR_Pos (0UL)             /*!< BURSTLENGTH_MFBR (Bit 0)                              */
#define GPU_CORE_D2_CONTROL3_BURSTLENGTH_MFBR_Msk (0x7UL)           /*!< BURSTLENGTH_MFBR (Bitfield-Mask: 0x07)                */
/* =====================================================  D2_DLISTSTART  ===================================================== */
#define GPU_CORE_D2_DLISTSTART_DLISTSTART_Pos (0UL)                 /*!< DLISTSTART (Bit 0)                                    */
#define GPU_CORE_D2_DLISTSTART_DLISTSTART_Msk (0xffffffffUL)        /*!< DLISTSTART (Bitfield-Mask: 0xffffffff)                */
/* =====================================================  D2_HWREVISION  ===================================================== */
#define GPU_CORE_D2_HWREVISION_FB_BURSTSPLITTING_Pos (28UL)         /*!< FB_BURSTSPLITTING (Bit 28)                            */
#define GPU_CORE_D2_HWREVISION_FB_BURSTSPLITTING_Msk (0x10000000UL) /*!< FB_BURSTSPLITTING (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_HWREVISION_FB_ALPHACHANNELBLENDING_Pos (27UL)   /*!< FB_ALPHACHANNELBLENDING (Bit 27)                      */
#define GPU_CORE_D2_HWREVISION_FB_ALPHACHANNELBLENDING_Msk (0x8000000UL) /*!< FB_ALPHACHANNELBLENDING (Bitfield-Mask: 0x01)    */
#define GPU_CORE_D2_HWREVISION_FB_HILIMITERPRECISION_Pos (26UL)     /*!< FB_HILIMITERPRECISION (Bit 26)                        */
#define GPU_CORE_D2_HWREVISION_FB_HILIMITERPRECISION_Msk (0x4000000UL) /*!< FB_HILIMITERPRECISION (Bitfield-Mask: 0x01)        */
#define GPU_CORE_D2_HWREVISION_FB_COLORKEY_Pos (25UL)               /*!< FB_COLORKEY (Bit 25)                                  */
#define GPU_CORE_D2_HWREVISION_FB_COLORKEY_Msk (0x2000000UL)        /*!< FB_COLORKEY (Bitfield-Mask: 0x01)                     */
#define GPU_CORE_D2_HWREVISION_FB_TEXCLUT256_Pos (24UL)             /*!< FB_TEXCLUT256 (Bit 24)                                */
#define GPU_CORE_D2_HWREVISION_FB_TEXCLUT256_Msk (0x1000000UL)      /*!< FB_TEXCLUT256 (Bitfield-Mask: 0x01)                   */
#define GPU_CORE_D2_HWREVISION_FB_RLEUNIT_Pos (23UL)                /*!< FB_RLEUNIT (Bit 23)                                   */
#define GPU_CORE_D2_HWREVISION_FB_RLEUNIT_Msk (0x800000UL)          /*!< FB_RLEUNIT (Bitfield-Mask: 0x01)                      */
#define GPU_CORE_D2_HWREVISION_FB_FBPREFETCH_Pos (22UL)             /*!< FB_FBPREFETCH (Bit 22)                                */
#define GPU_CORE_D2_HWREVISION_FB_FBPREFETCH_Msk (0x400000UL)       /*!< FB_FBPREFETCH (Bitfield-Mask: 0x01)                   */
#define GPU_CORE_D2_HWREVISION_FB_TEXCLUT_Pos (21UL)                /*!< FB_TEXCLUT (Bit 21)                                   */
#define GPU_CORE_D2_HWREVISION_FB_TEXCLUT_Msk (0x200000UL)          /*!< FB_TEXCLUT (Bitfield-Mask: 0x01)                      */
#define GPU_CORE_D2_HWREVISION_FB_PERFCOUNT_Pos (20UL)              /*!< FB_PERFCOUNT (Bit 20)                                 */
#define GPU_CORE_D2_HWREVISION_FB_PERFCOUNT_Msk (0x100000UL)        /*!< FB_PERFCOUNT (Bitfield-Mask: 0x01)                    */
#define GPU_CORE_D2_HWREVISION_FB_TXCACHE_Pos (19UL)                /*!< FB_TXCACHE (Bit 19)                                   */
#define GPU_CORE_D2_HWREVISION_FB_TXCACHE_Msk (0x80000UL)           /*!< FB_TXCACHE (Bitfield-Mask: 0x01)                      */
#define GPU_CORE_D2_HWREVISION_FB_FBCACHE_Pos (18UL)                /*!< FB_FBCACHE (Bit 18)                                   */
#define GPU_CORE_D2_HWREVISION_FB_FBCACHE_Msk (0x40000UL)           /*!< FB_FBCACHE (Bitfield-Mask: 0x01)                      */
#define GPU_CORE_D2_HWREVISION_FB_DLR_Pos (17UL)                    /*!< FB_DLR (Bit 17)                                       */
#define GPU_CORE_D2_HWREVISION_FB_DLR_Msk (0x20000UL)               /*!< FB_DLR (Bitfield-Mask: 0x01)                          */
#define GPU_CORE_D2_HWREVISION_FB_SWGPU_Pos (16UL)                  /*!< FB_SWGPU (Bit 16)                                     */
#define GPU_CORE_D2_HWREVISION_FB_SWGPU_Msk (0x10000UL)             /*!< FB_SWGPU (Bitfield-Mask: 0x01)                        */
#define GPU_CORE_D2_HWREVISION_HWTYPE_Pos (12UL)                    /*!< HWTYPE (Bit 12)                                       */
#define GPU_CORE_D2_HWREVISION_HWTYPE_Msk (0xf000UL)                /*!< HWTYPE (Bitfield-Mask: 0x0f)                          */
#define GPU_CORE_D2_HWREVISION_HWBRANCH_Pos (8UL)                   /*!< HWBRANCH (Bit 8)                                      */
#define GPU_CORE_D2_HWREVISION_HWBRANCH_Msk (0xf00UL)               /*!< HWBRANCH (Bitfield-Mask: 0x0f)                        */
#define GPU_CORE_D2_HWREVISION_HWREVISION_Pos (0UL)                 /*!< HWREVISION (Bit 0)                                    */
#define GPU_CORE_D2_HWREVISION_HWREVISION_Msk (0xffUL)              /*!< HWREVISION (Bitfield-Mask: 0xff)                      */
/* =======================================================  D2_IRQCTL  ======================================================= */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_BUS_ERROR_Pos (5UL)         /*!< D2IRQCTL_CLR_BUS_ERROR (Bit 5)                        */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_BUS_ERROR_Msk (0x20UL)      /*!< D2IRQCTL_CLR_BUS_ERROR (Bitfield-Mask: 0x01)          */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_BUS_ERROR_Pos (4UL)      /*!< D2IRQCTL_ENABLE_BUS_ERROR (Bit 4)                     */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_BUS_ERROR_Msk (0x10UL)   /*!< D2IRQCTL_ENABLE_BUS_ERROR (Bitfield-Mask: 0x01)       */
