antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_DLIST_Pos (3UL)      /*!< D2IRQCTL_CLR_FINISH_DLIST (Bit 3)                     */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_DLIST_Msk (0x8UL)    /*!< D2IRQCTL_CLR_FINISH_DLIST (Bitfield-Mask: 0x01)       */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_ENUM_Pos (2UL)       /*!< D2IRQCTL_CLR_FINISH_ENUM (Bit 2)                      */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_CLR_FINISH_ENUM_Msk (0x4UL)     /*!< D2IRQCTL_CLR_FINISH_ENUM (Bitfield-Mask: 0x01)        */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_DLIST_Pos (1UL)   /*!< D2IRQCTL_ENABLE_FINISH_DLIST (Bit 1)                  */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_DLIST_Msk (0x2UL) /*!< D2IRQCTL_ENABLE_FINISH_DLIST (Bitfield-Mask: 0x01)    */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_ENUM_Pos (0UL)    /*!< D2IRQCTL_ENABLE_FINISH_ENUM (Bit 0)                   */
#define GPU_CORE_D2_IRQCTL_D2IRQCTL_ENABLE_FINISH_ENUM_Msk (0x1UL)  /*!< D2IRQCTL_ENABLE_FINISH_ENUM (Bitfield-Mask: 0x01)     */
/* =======================================================  D2_L1BAND  ======================================================= */
#define GPU_CORE_D2_L1BAND_L1BAND_Pos     (0UL)                     /*!< L1BAND (Bit 0)                                        */
#define GPU_CORE_D2_L1BAND_L1BAND_Msk     (0xffffffffUL)            /*!< L1BAND (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_L1START  ======================================================= */
#define GPU_CORE_D2_L1START_L1START_Pos   (0UL)                     /*!< L1START (Bit 0)                                       */
#define GPU_CORE_D2_L1START_L1START_Msk   (0xffffffffUL)            /*!< L1START (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_L1XADD  ======================================================= */
#define GPU_CORE_D2_L1XADD_L1XADD_Pos     (0UL)                     /*!< L1XADD (Bit 0)                                        */
#define GPU_CORE_D2_L1XADD_L1XADD_Msk     (0xffffffffUL)            /*!< L1XADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L1YADD  ======================================================= */
#define GPU_CORE_D2_L1YADD_L1YADD_Pos     (0UL)                     /*!< L1YADD (Bit 0)                                        */
#define GPU_CORE_D2_L1YADD_L1YADD_Msk     (0xffffffffUL)            /*!< L1YADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L2BAND  ======================================================= */
#define GPU_CORE_D2_L2BAND_L2BAND_Pos     (0UL)                     /*!< L2BAND (Bit 0)                                        */
#define GPU_CORE_D2_L2BAND_L2BAND_Msk     (0xffffffffUL)            /*!< L2BAND (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_L2START  ======================================================= */
#define GPU_CORE_D2_L2START_L2START_Pos   (0UL)                     /*!< L2START (Bit 0)                                       */
#define GPU_CORE_D2_L2START_L2START_Msk   (0xffffffffUL)            /*!< L2START (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_L2XADD  ======================================================= */
#define GPU_CORE_D2_L2XADD_L2XADD_Pos     (0UL)                     /*!< L2XADD (Bit 0)                                        */
#define GPU_CORE_D2_L2XADD_L2XADD_Msk     (0xffffffffUL)            /*!< L2XADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L2YADD  ======================================================= */
#define GPU_CORE_D2_L2YADD_L2YADD_Pos     (0UL)                     /*!< L2YADD (Bit 0)                                        */
#define GPU_CORE_D2_L2YADD_L2YADD_Msk     (0xffffffffUL)            /*!< L2YADD (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_L3START  ======================================================= */
#define GPU_CORE_D2_L3START_L3START_Pos   (0UL)                     /*!< L3START (Bit 0)                                       */
#define GPU_CORE_D2_L3START_L3START_Msk   (0xffffffffUL)            /*!< L3START (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_L3XADD  ======================================================= */
#define GPU_CORE_D2_L3XADD_L3XADD_Pos     (0UL)                     /*!< L3XADD (Bit 0)                                        */
#define GPU_CORE_D2_L3XADD_L3XADD_Msk     (0xffffffffUL)            /*!< L3XADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L3YADD  ======================================================= */
#define GPU_CORE_D2_L3YADD_L3YADD_Pos     (0UL)                     /*!< L3YADD (Bit 0)                                        */
#define GPU_CORE_D2_L3YADD_L3YADD_Msk     (0xffffffffUL)            /*!< L3YADD (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_L4START  ======================================================= */
#define GPU_CORE_D2_L4START_L4START_Pos   (0UL)                     /*!< L4START (Bit 0)                                       */
#define GPU_CORE_D2_L4START_L4START_Msk   (0xffffffffUL)            /*!< L4START (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_L4XADD  ======================================================= */
#define GPU_CORE_D2_L4XADD_L4XADD_Pos     (0UL)                     /*!< L4XADD (Bit 0)                                        */
#define GPU_CORE_D2_L4XADD_L4XADD_Msk     (0xffffffffUL)            /*!< L4XADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L4YADD  ======================================================= */
#define GPU_CORE_D2_L4YADD_L4YADD_Pos     (0UL)                     /*!< L4YADD (Bit 0)                                        */
#define GPU_CORE_D2_L4YADD_L4YADD_Msk     (0xffffffffUL)            /*!< L4YADD (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_L5START  ======================================================= */
#define GPU_CORE_D2_L5START_L5START_Pos   (0UL)                     /*!< L5START (Bit 0)                                       */
#define GPU_CORE_D2_L5START_L5START_Msk   (0xffffffffUL)            /*!< L5START (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_L5XADD  ======================================================= */
#define GPU_CORE_D2_L5XADD_L5XADD_Pos     (0UL)                     /*!< L5XADD (Bit 0)                                        */
#define GPU_CORE_D2_L5XADD_L5XADD_Msk     (0xffffffffUL)            /*!< L5XADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L5YADD  ======================================================= */
#define GPU_CORE_D2_L5YADD_L5YADD_Pos     (0UL)                     /*!< L5YADD (Bit 0)                                        */
#define GPU_CORE_D2_L5YADD_L5YADD_Msk     (0xffffffffUL)            /*!< L5YADD (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_L6START  ======================================================= */
#define GPU_CORE_D2_L6START_L6START_Pos   (0UL)                     /*!< L6START (Bit 0)                                       */
#define GPU_CORE_D2_L6START_L6START_Msk   (0xffffffffUL)            /*!< L6START (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_L6XADD  ======================================================= */
#define GPU_CORE_D2_L6XADD_L6XADD_Pos     (0UL)                     /*!< L6XADD (Bit 0)                                        */
#define GPU_CORE_D2_L6XADD_L6XADD_Msk     (0xffffffffUL)            /*!< L6XADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_L6YADD  ======================================================= */
#define GPU_CORE_D2_L6YADD_L6YADD_Pos     (0UL)                     /*!< L6YADD (Bit 0)                                        */
#define GPU_CORE_D2_L6YADD_L6YADD_Msk     (0xffffffffUL)            /*!< L6YADD (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_LUSTART  ======================================================= */
#define GPU_CORE_D2_LUSTART_LUSTART_Pos   (0UL)                     /*!< LUSTART (Bit 0)                                       */
#define GPU_CORE_D2_LUSTART_LUSTART_Msk   (0xffffffffUL)            /*!< LUSTART (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  D2_LUXADD  ======================================================= */
#define GPU_CORE_D2_LUXADD_LUXADD_Pos     (0UL)                     /*!< LUXADD (Bit 0)                                        */
#define GPU_CORE_D2_LUXADD_LUXADD_Msk     (0xffffffffUL)            /*!< LUXADD (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  D2_LUYADD  ======================================================= */
#define GPU_CORE_D2_LUYADD_LUYADD_Pos     (0UL)                     /*!< LUYADD (Bit 0)                                        */
#define GPU_CORE_D2_LUYADD_LUYADD_Msk     (0xffffffffUL)            /*!< LUYADD (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_LVSTARTF  ====================================================== */
#define GPU_CORE_D2_LVSTARTF_LVSTARTF_Pos (0UL)                     /*!< LVSTARTF (Bit 0)                                      */
#define GPU_CORE_D2_LVSTARTF_LVSTARTF_Msk (0xffffUL)                /*!< LVSTARTF (Bitfield-Mask: 0xffff)                      */
/* ======================================================  D2_LVSTARTI  ====================================================== */
#define GPU_CORE_D2_LVSTARTI_LVSTARTI_Pos (0UL)                     /*!< LVSTARTI (Bit 0)                                      */
#define GPU_CORE_D2_LVSTARTI_LVSTARTI_Msk (0xffffffffUL)            /*!< LVSTARTI (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  D2_LVXADDI  ======================================================= */
#define GPU_CORE_D2_LVXADDI_LVXADDI_Pos   (0UL)                     /*!< LVXADDI (Bit 0)                                       */
#define GPU_CORE_D2_LVXADDI_LVXADDI_Msk   (0xffffffffUL)            /*!< LVXADDI (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  D2_LVYADDI  ======================================================= */
#define GPU_CORE_D2_LVYADDI_LVYADDI_Pos   (0UL)                     /*!< LVYADDI (Bit 0)                                       */
#define GPU_CORE_D2_LVYADDI_LVYADDI_Msk   (0xffffffffUL)            /*!< LVYADDI (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  D2_LVYXADDF  ====================================================== */
#define GPU_CORE_D2_LVYXADDF_D2_LVYADDI_FRAC_Pos (16UL)             /*!< D2_LVYADDI_FRAC (Bit 16)                              */
#define GPU_CORE_D2_LVYXADDF_D2_LVYADDI_FRAC_Msk (0xffff0000UL)     /*!< D2_LVYADDI_FRAC (Bitfield-Mask: 0xffff)               */
#define GPU_CORE_D2_LVYXADDF_D2_LVXADDI_FRAC_Pos (0UL)              /*!< D2_LVXADDI_FRAC (Bit 0)                               */
#define GPU_CORE_D2_LVYXADDF_D2_LVXADDI_FRAC_Msk (0xffffUL)         /*!< D2_LVXADDI_FRAC (Bitfield-Mask: 0xffff)               */
/* =======================================================  D2_ORIGIN  ======================================================= */
#define GPU_CORE_D2_ORIGIN_ORIGIN_Pos     (0UL)                     /*!< ORIGIN (Bit 0)                                        */
#define GPU_CORE_D2_ORIGIN_ORIGIN_Msk     (0xffffffffUL)            /*!< ORIGIN (Bitfield-Mask: 0xffffffff)                    */
/* ======================================================  D2_PATTERN  ======================================================= */
#define GPU_CORE_D2_PATTERN_PATTERN_Pos   (0UL)                     /*!< PATTERN (Bit 0)                                       */
#define GPU_CORE_D2_PATTERN_PATTERN_Msk   (0xffffffffUL)            /*!< PATTERN (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  D2_PERFCOUNT1  ===================================================== */
#define GPU_CORE_D2_PERFCOUNT1_PERFCOUNT1_Pos (0UL)                 /*!< PERFCOUNT1 (Bit 0)                                    */
#define GPU_CORE_D2_PERFCOUNT1_PERFCOUNT1_Msk (0xffffffffUL)        /*!< PERFCOUNT1 (Bitfield-Mask: 0xffffffff)                */
/* =====================================================  D2_PERFCOUNT2  ===================================================== */
#define GPU_CORE_D2_PERFCOUNT2_PERFCOUNT2_Pos (0UL)                 /*!< PERFCOUNT2 (Bit 0)                                    */
#define GPU_CORE_D2_PERFCOUNT2_PERFCOUNT2_Msk (0xffffffffUL)        /*!< PERFCOUNT2 (Bitfield-Mask: 0xffffffff)                */
/* ====================================================  D2_PERFTRIGGER  ===================================================== */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER2_Pos (16UL)             /*!< PERFTRIGGER2 (Bit 16)                                 */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER2_Msk (0xffff0000UL)     /*!< PERFTRIGGER2 (Bitfield-Mask: 0xffff)                  */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER1_Pos (0UL)              /*!< PERFTRIGGER1 (Bit 0)                                  */
#define GPU_CORE_D2_PERFTRIGGER_PERFTRIGGER1_Msk (0xffffUL)         /*!< PERFTRIGGER1 (Bitfield-Mask: 0xffff)                  */
/* =======================================================  D2_PITCH  ======================================================== */
#define GPU_CORE_D2_PITCH_SSD_Pos         (16UL)                    /*!< SSD (Bit 16)                                          */
#define GPU_CORE_D2_PITCH_SSD_Msk         (0xffff0000UL)            /*!< SSD (Bitfield-Mask: 0xffff)                           */
#define GPU_CORE_D2_PITCH_PITCH_Pos       (0UL)                     /*!< PITCH (Bit 0)                                         */
#define GPU_CORE_D2_PITCH_PITCH_Msk       (0xffffUL)                /*!< PITCH (Bitfield-Mask: 0xffff)                         */
/* ========================================================  D2_SIZE  ======================================================== */
#define GPU_CORE_D2_SIZE_SIZEY_Pos        (16UL)                    /*!< SIZEY (Bit 16)                                        */
#define GPU_CORE_D2_SIZE_SIZEY_Msk        (0xffff0000UL)            /*!< SIZEY (Bitfield-Mask: 0xffff)                         */
#define GPU_CORE_D2_SIZE_SIZEX_Pos        (0UL)                     /*!< SIZEX (Bit 0)                                         */
#define GPU_CORE_D2_SIZE_SIZEX_Msk        (0xffffUL)                /*!< SIZEX (Bitfield-Mask: 0xffff)                         */
/* =======================================================  D2_STATUS  ======================================================= */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR_SRC_Pos (8UL)          /*!< D2C_IRQ_BUS_ERROR_SRC (Bit 8)                         */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR_SRC_Msk (0x700UL)      /*!< D2C_IRQ_BUS_ERROR_SRC (Bitfield-Mask: 0x07)           */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR_Pos (6UL)              /*!< D2C_IRQ_BUS_ERROR (Bit 6)                             */
#define GPU_CORE_D2_STATUS_D2C_IRQ_BUS_ERROR_Msk (0x40UL)           /*!< D2C_IRQ_BUS_ERROR (Bitfield-Mask: 0x01)               */
#define GPU_CORE_D2_STATUS_D2C_IRQ_DLIST_Pos (5UL)                  /*!< D2C_IRQ_DLIST (Bit 5)                                 */
#define GPU_CORE_D2_STATUS_D2C_IRQ_DLIST_Msk (0x20UL)               /*!< D2C_IRQ_DLIST (Bitfield-Mask: 0x01)                   */
#define GPU_CORE_D2_STATUS_D2C_IRQ_ENUM_Pos (4UL)                   /*!< D2C_IRQ_ENUM (Bit 4)                                  */
#define GPU_CORE_D2_STATUS_D2C_IRQ_ENUM_Msk (0x10UL)                /*!< D2C_IRQ_ENUM (Bitfield-Mask: 0x01)                    */
#define GPU_CORE_D2_STATUS_D2C_DLISTACTIVE_Pos (3UL)                /*!< D2C_DLISTACTIVE (Bit 3)                               */
#define GPU_CORE_D2_STATUS_D2C_DLISTACTIVE_Msk (0x8UL)              /*!< D2C_DLISTACTIVE (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_STATUS_D2C_CACHE_DIRTY_Pos (2UL)                /*!< D2C_CACHE_DIRTY (Bit 2)                               */
#define GPU_CORE_D2_STATUS_D2C_CACHE_DIRTY_Msk (0x4UL)              /*!< D2C_CACHE_DIRTY (Bitfield-Mask: 0x01)                 */
#define GPU_CORE_D2_STATUS_D2C_BUSY_WRITE_Pos (1UL)                 /*!< D2C_BUSY_WRITE (Bit 1)                                */
#define GPU_CORE_D2_STATUS_D2C_BUSY_WRITE_Msk (0x2UL)               /*!< D2C_BUSY_WRITE (Bitfield-Mask: 0x01)                  */
#define GPU_CORE_D2_STATUS_D2C_BUSY_ENUM_Pos (0UL)                  /*!< D2C_BUSY_ENUM (Bit 0)                                 */
#define GPU_CORE_D2_STATUS_D2C_BUSY_ENUM_Msk (0x1UL)                /*!< D2C_BUSY_ENUM (Bitfield-Mask: 0x01)                   */
/* ======================================================  D2_TEXCLUT  ======================================================= */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_INDEX_Pos (24UL)                /*!< TEXCLUT_INDEX (Bit 24)                                */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_INDEX_Msk (0xff000000UL)        /*!< TEXCLUT_INDEX (Bitfield-Mask: 0xff)                   */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_RGB_Pos (0UL)                   /*!< TEXCLUT_RGB (Bit 0)                                   */
#define GPU_CORE_D2_TEXCLUT_TEXCLUT_RGB_Msk (0xffffffUL)            /*!< TEXCLUT_RGB (Bitfield-Mask: 0xffffff)                 */
/* ====================================================  D2_TEXCLUT_ADDR  ==================================================== */
#define GPU_CORE_D2_TEXCLUT_ADDR_TEXCLUT_ADDR_Pos (0UL)             /*!< TEXCLUT_ADDR (Bit 0)                                  */
#define GPU_CORE_D2_TEXCLUT_ADDR_TEXCLUT_ADDR_Msk (0xffUL)          /*!< TEXCLUT_ADDR (Bitfield-Mask: 0xff)                    */
/* ====================================================  D2_TEXCLUT_DATA  ==================================================== */
#define GPU_CORE_D2_TEXCLUT_DATA_TEXCLUT_ARGB_Pos (0UL)             /*!< TEXCLUT_ARGB (Bit 0)                                  */
#define GPU_CORE_D2_TEXCLUT_DATA_TEXCLUT_ARGB_Msk (0xffffffffUL)    /*!< TEXCLUT_ARGB (Bitfield-Mask: 0xffffffff)              */
/* ===================================================  D2_TEXCLUT_OFFSET  =================================================== */
#define GPU_CORE_D2_TEXCLUT_OFFSET_TEXCLUT_OFFSET_Pos (0UL)         /*!< TEXCLUT_OFFSET (Bit 0)                                */
#define GPU_CORE_D2_TEXCLUT_OFFSET_TEXCLUT_OFFSET_Msk (0xffUL)      /*!< TEXCLUT_OFFSET (Bitfield-Mask: 0xff)                  */
/* ======================================================  D2_TEXMASK  ======================================================= */
#define GPU_CORE_D2_TEXMASK_TEXVMASK_Pos  (11UL)                    /*!< TEXVMASK (Bit 11)                                     */
#define GPU_CORE_D2_TEXMASK_TEXVMASK_Msk  (0xfffff800UL)            /*!< TEXVMASK (Bitfield-Mask: 0x1fffff)                    */
#define GPU_CORE_D2_TEXMASK_TEXUMASK_Pos  (0UL)                     /*!< TEXUMASK (Bit 0)                                      */
#define GPU_CORE_D2_TEXMASK_TEXUMASK_Msk  (0x7ffUL)                 /*!< TEXUMASK (Bitfield-Mask: 0x7ff)                       */
/* =====================================================  D2_TEXORIGIN  ====================================================== */
#define GPU_CORE_D2_TEXORIGIN_TEXORIGIN_Pos (0UL)                   /*!< TEXORIGIN (Bit 0)                                     */
#define GPU_CORE_D2_TEXORIGIN_TEXORIGIN_Msk (0xffffffffUL)          /*!< TEXORIGIN (Bitfield-Mask: 0xffffffff)                 */
/* ======================================================  D2_TEXPITCH  ====================================================== */
#define GPU_CORE_D2_TEXPITCH_TEXPITCH_Pos (0UL)                     /*!< TEXPITCH (Bit 0)                                      */
#define GPU_CORE_D2_TEXPITCH_TEXPITCH_Msk (0xffffffffUL)            /*!< TEXPITCH (Bitfield-Mask: 0xffffffff)                  */


/* =========================================================================================================================== */
/* ================                                          GPU_REG                                          ================ */
/* =========================================================================================================================== */

/* =====================================================  GPU_CTRL_REG  ====================================================== */
#define GPU_REG_GPU_CTRL_REG_PWRS_B_Pos   (6UL)                     /*!< PWRS_B (Bit 6)                                        */
#define GPU_REG_GPU_CTRL_REG_PWRS_B_Msk   (0x40UL)                  /*!< PWRS_B (Bitfield-Mask: 0x01)                          */
#define GPU_REG_GPU_CTRL_REG_GPU_EN_Pos   (0UL)                     /*!< GPU_EN (Bit 0)                                        */
#define GPU_REG_GPU_CTRL_REG_GPU_EN_Msk   (0x1UL)                   /*!< GPU_EN (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

