antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* =============================================  I3C_BUS_FREE_AVAIL_TIMING_REG  ============================================= */
#define I3C_I3C_BUS_FREE_AVAIL_TIMING_REG_BUS_FREE_TIME_Pos (0UL)   /*!< BUS_FREE_TIME (Bit 0)                                 */
#define I3C_I3C_BUS_FREE_AVAIL_TIMING_REG_BUS_FREE_TIME_Msk (0xffffUL) /*!< BUS_FREE_TIME (Bitfield-Mask: 0xffff)              */
/* ==============================================  I3C_COMMAND_QUEUE_PORT_REG  =============================================== */
#define I3C_I3C_COMMAND_QUEUE_PORT_REG_COMMAND_Pos (0UL)            /*!< COMMAND (Bit 0)                                       */
#define I3C_I3C_COMMAND_QUEUE_PORT_REG_COMMAND_Msk (0xffffffffUL)   /*!< COMMAND (Bitfield-Mask: 0xffffffff)                   */
/* ============================================  I3C_DATA_BUFFER_STAT_LEVEL_REG  ============================================= */
#define I3C_I3C_DATA_BUFFER_STAT_LEVEL_REG_RX_BUF_BLR_Pos (16UL)    /*!< RX_BUF_BLR (Bit 16)                                   */
#define I3C_I3C_DATA_BUFFER_STAT_LEVEL_REG_RX_BUF_BLR_Msk (0xff0000UL) /*!< RX_BUF_BLR (Bitfield-Mask: 0xff)                   */
#define I3C_I3C_DATA_BUFFER_STAT_LEVEL_REG_TX_BUF_EMPTY_LOC_Pos (0UL) /*!< TX_BUF_EMPTY_LOC (Bit 0)                            */
#define I3C_I3C_DATA_BUFFER_STAT_LEVEL_REG_TX_BUF_EMPTY_LOC_Msk (0xffUL) /*!< TX_BUF_EMPTY_LOC (Bitfield-Mask: 0xff)           */
/* =============================================  I3C_DATA_BUFFER_THLD_CTRL_REG  ============================================= */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_RX_START_THLD_Pos (24UL)  /*!< RX_START_THLD (Bit 24)                                */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_RX_START_THLD_Msk (0x7000000UL) /*!< RX_START_THLD (Bitfield-Mask: 0x07)             */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_TX_START_THLD_Pos (16UL)  /*!< TX_START_THLD (Bit 16)                                */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_TX_START_THLD_Msk (0x70000UL) /*!< TX_START_THLD (Bitfield-Mask: 0x07)               */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_RX_BUF_THLD_Pos (8UL)     /*!< RX_BUF_THLD (Bit 8)                                   */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_RX_BUF_THLD_Msk (0x700UL) /*!< RX_BUF_THLD (Bitfield-Mask: 0x07)                     */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_TX_EMPTY_BUF_THLD_Pos (0UL) /*!< TX_EMPTY_BUF_THLD (Bit 0)                           */
#define I3C_I3C_DATA_BUFFER_THLD_CTRL_REG_TX_EMPTY_BUF_THLD_Msk (0x7UL) /*!< TX_EMPTY_BUF_THLD (Bitfield-Mask: 0x07)           */
/* ==================================================  I3C_DEVICE_ADDR_REG  ================================================== */
#define I3C_I3C_DEVICE_ADDR_REG_DYNAMIC_ADDR_VALID_Pos (31UL)       /*!< DYNAMIC_ADDR_VALID (Bit 31)                           */
#define I3C_I3C_DEVICE_ADDR_REG_DYNAMIC_ADDR_VALID_Msk (0x80000000UL) /*!< DYNAMIC_ADDR_VALID (Bitfield-Mask: 0x01)            */
#define I3C_I3C_DEVICE_ADDR_REG_DYNAMIC_ADDR_Pos (16UL)             /*!< DYNAMIC_ADDR (Bit 16)                                 */
#define I3C_I3C_DEVICE_ADDR_REG_DYNAMIC_ADDR_Msk (0x7f0000UL)       /*!< DYNAMIC_ADDR (Bitfield-Mask: 0x7f)                    */
/* =============================================  I3C_DEVICE_ADDR_TABLE_PTR_REG  ============================================= */
#define I3C_I3C_DEVICE_ADDR_TABLE_PTR_REG_DEV_ADDR_TABLE_DEPTH_Pos (16UL) /*!< DEV_ADDR_TABLE_DEPTH (Bit 16)                   */
#define I3C_I3C_DEVICE_ADDR_TABLE_PTR_REG_DEV_ADDR_TABLE_DEPTH_Msk (0xffff0000UL) /*!< DEV_ADDR_TABLE_DEPTH (Bitfield-Mask: 0xffff) */
#define I3C_I3C_DEVICE_ADDR_TABLE_PTR_REG_P_DEV_ADDR_TABLE_START_ADDR_Pos (0UL) /*!< P_DEV_ADDR_TABLE_START_ADDR (Bit 0)       */
#define I3C_I3C_DEVICE_ADDR_TABLE_PTR_REG_P_DEV_ADDR_TABLE_START_ADDR_Msk (0xffffUL) /*!< P_DEV_ADDR_TABLE_START_ADDR (Bitfield-Mask: 0xffff) */
/* =============================================  I3C_DEVICE_CTRL_EXTENDED_REG  ============================================== */
#define I3C_I3C_DEVICE_CTRL_EXTENDED_REG_DEV_OPERATION_MODE_Pos (0UL) /*!< DEV_OPERATION_MODE (Bit 0)                          */
#define I3C_I3C_DEVICE_CTRL_EXTENDED_REG_DEV_OPERATION_MODE_Msk (0x3UL) /*!< DEV_OPERATION_MODE (Bitfield-Mask: 0x03)          */
/* ==================================================  I3C_DEVICE_CTRL_REG  ================================================== */
#define I3C_I3C_DEVICE_CTRL_REG_ENABLE_Pos (31UL)                   /*!< ENABLE (Bit 31)                                       */
#define I3C_I3C_DEVICE_CTRL_REG_ENABLE_Msk (0x80000000UL)           /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define I3C_I3C_DEVICE_CTRL_REG_RESUME_Pos (30UL)                   /*!< RESUME (Bit 30)                                       */
#define I3C_I3C_DEVICE_CTRL_REG_RESUME_Msk (0x40000000UL)           /*!< RESUME (Bitfield-Mask: 0x01)                          */
#define I3C_I3C_DEVICE_CTRL_REG_ABORT_Pos (29UL)                    /*!< ABORT (Bit 29)                                        */
#define I3C_I3C_DEVICE_CTRL_REG_ABORT_Msk (0x20000000UL)            /*!< ABORT (Bitfield-Mask: 0x01)                           */
#define I3C_I3C_DEVICE_CTRL_REG_DMA_ENABLE_I3C_Pos (28UL)           /*!< DMA_ENABLE_I3C (Bit 28)                               */
#define I3C_I3C_DEVICE_CTRL_REG_DMA_ENABLE_I3C_Msk (0x10000000UL)   /*!< DMA_ENABLE_I3C (Bitfield-Mask: 0x01)                  */
#define I3C_I3C_DEVICE_CTRL_REG_HOT_JOIN_CTRL_Pos (8UL)             /*!< HOT_JOIN_CTRL (Bit 8)                                 */
#define I3C_I3C_DEVICE_CTRL_REG_HOT_JOIN_CTRL_Msk (0x100UL)         /*!< HOT_JOIN_CTRL (Bitfield-Mask: 0x01)                   */
#define I3C_I3C_DEVICE_CTRL_REG_I2C_SLAVE_PRESENT_Pos (7UL)         /*!< I2C_SLAVE_PRESENT (Bit 7)                             */
#define I3C_I3C_DEVICE_CTRL_REG_I2C_SLAVE_PRESENT_Msk (0x80UL)      /*!< I2C_SLAVE_PRESENT (Bitfield-Mask: 0x01)               */
#define I3C_I3C_DEVICE_CTRL_REG_IBA_INCLUDE_Pos (0UL)               /*!< IBA_INCLUDE (Bit 0)                                   */
#define I3C_I3C_DEVICE_CTRL_REG_IBA_INCLUDE_Msk (0x1UL)             /*!< IBA_INCLUDE (Bitfield-Mask: 0x01)                     */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC1_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC2_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC3_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC4_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC5_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC5_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC6_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC6_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC7_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC7_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* ==============================================  I3C_DEV_ADDR_TABLE_LOC8_REG  ============================================== */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_LEGACY_I2C_DEVICE_Pos (31UL) /*!< LEGACY_I2C_DEVICE (Bit 31)                           */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_LEGACY_I2C_DEVICE_Msk (0x80000000UL) /*!< LEGACY_I2C_DEVICE (Bitfield-Mask: 0x01)      */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_DEV_NACK_RETRY_CNT_Pos (29UL) /*!< DEV_NACK_RETRY_CNT (Bit 29)                         */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_DEV_NACK_RETRY_CNT_Msk (0x60000000UL) /*!< DEV_NACK_RETRY_CNT (Bitfield-Mask: 0x03)    */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_DEV_DYNAMIC_ADDR_Pos (16UL) /*!< DEV_DYNAMIC_ADDR (Bit 16)                             */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_DEV_DYNAMIC_ADDR_Msk (0xff0000UL) /*!< DEV_DYNAMIC_ADDR (Bitfield-Mask: 0xff)          */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_DEV_STATIC_ADDR_Pos (0UL)   /*!< DEV_STATIC_ADDR (Bit 0)                               */
#define I3C_I3C_DEV_ADDR_TABLE_LOC8_REG_DEV_STATIC_ADDR_Msk (0x7fUL) /*!< DEV_STATIC_ADDR (Bitfield-Mask: 0x7f)                */
/* =============================================  I3C_DEV_CHAR_TABLE1_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE1_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE1_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE1_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE1_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE2_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE2_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE2_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE2_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE2_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE3_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE3_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE3_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE3_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE3_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE4_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE4_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE4_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE4_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE4_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE5_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE5_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE5_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
