antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define I3C_I3C_DEV_CHAR_TABLE5_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE5_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE5_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE6_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE6_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE6_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE6_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE6_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE7_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE7_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE7_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE7_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE7_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* =============================================  I3C_DEV_CHAR_TABLE8_LOC1_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC1_REG_LSB_PROVISIONAL_ID_Pos (0UL) /*!< LSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC1_REG_LSB_PROVISIONAL_ID_Msk (0xffffffffUL) /*!< LSB_PROVISIONAL_ID (Bitfield-Mask: 0xffffffff) */
/* =============================================  I3C_DEV_CHAR_TABLE8_LOC2_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC2_REG_MSB_PROVISIONAL_ID_Pos (0UL) /*!< MSB_PROVISIONAL_ID (Bit 0)                          */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC2_REG_MSB_PROVISIONAL_ID_Msk (0xffffUL) /*!< MSB_PROVISIONAL_ID (Bitfield-Mask: 0xffff)     */
/* =============================================  I3C_DEV_CHAR_TABLE8_LOC3_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC3_REG_BCR_Pos (8UL)              /*!< BCR (Bit 8)                                           */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC3_REG_BCR_Msk (0xff00UL)         /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC3_REG_DCR_Pos (0UL)              /*!< DCR (Bit 0)                                           */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC3_REG_DCR_Msk (0xffUL)           /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =============================================  I3C_DEV_CHAR_TABLE8_LOC4_REG  ============================================== */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Pos (0UL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bit 0)                    */
#define I3C_I3C_DEV_CHAR_TABLE8_LOC4_REG_DEV_DYNAMIC_ADDR_LOC4_Msk (0xffUL) /*!< DEV_DYNAMIC_ADDR_LOC4 (Bitfield-Mask: 0xff)   */
/* ============================================  I3C_DEV_CHAR_TABLE_POINTER_REG  ============================================= */
#define I3C_I3C_DEV_CHAR_TABLE_POINTER_REG_PRESENT_DEV_CHAR_TABLE_INDX_Pos (19UL) /*!< PRESENT_DEV_CHAR_TABLE_INDX (Bit 19)    */
#define I3C_I3C_DEV_CHAR_TABLE_POINTER_REG_PRESENT_DEV_CHAR_TABLE_INDX_Msk (0x380000UL) /*!< PRESENT_DEV_CHAR_TABLE_INDX (Bitfield-Mask: 0x07) */
#define I3C_I3C_DEV_CHAR_TABLE_POINTER_REG_DEV_CHAR_TABLE_DEPTH_Pos (12UL) /*!< DEV_CHAR_TABLE_DEPTH (Bit 12)                  */
#define I3C_I3C_DEV_CHAR_TABLE_POINTER_REG_DEV_CHAR_TABLE_DEPTH_Msk (0x7f000UL) /*!< DEV_CHAR_TABLE_DEPTH (Bitfield-Mask: 0x7f) */
#define I3C_I3C_DEV_CHAR_TABLE_POINTER_REG_P_DEV_CHAR_TABLE_START_ADDR_Pos (0UL) /*!< P_DEV_CHAR_TABLE_START_ADDR (Bit 0)      */
#define I3C_I3C_DEV_CHAR_TABLE_POINTER_REG_P_DEV_CHAR_TABLE_START_ADDR_Msk (0xfffUL) /*!< P_DEV_CHAR_TABLE_START_ADDR (Bitfield-Mask: 0xfff) */
/* =================================================  I3C_HW_CAPABILITY_REG  ================================================= */
#define I3C_I3C_HW_CAPABILITY_REG_SLV_IBI_CAP_Pos (19UL)            /*!< SLV_IBI_CAP (Bit 19)                                  */
#define I3C_I3C_HW_CAPABILITY_REG_SLV_IBI_CAP_Msk (0x80000UL)       /*!< SLV_IBI_CAP (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_HW_CAPABILITY_REG_SLV_HJ_CAP_Pos (18UL)             /*!< SLV_HJ_CAP (Bit 18)                                   */
#define I3C_I3C_HW_CAPABILITY_REG_SLV_HJ_CAP_Msk (0x40000UL)        /*!< SLV_HJ_CAP (Bitfield-Mask: 0x01)                      */
#define I3C_I3C_HW_CAPABILITY_REG_DMA_EN_Pos (17UL)                 /*!< DMA_EN (Bit 17)                                       */
#define I3C_I3C_HW_CAPABILITY_REG_DMA_EN_Msk (0x20000UL)            /*!< DMA_EN (Bitfield-Mask: 0x01)                          */
#define I3C_I3C_HW_CAPABILITY_REG_HDR_TX_CLOCK_PERIOD_Pos (11UL)    /*!< HDR_TX_CLOCK_PERIOD (Bit 11)                          */
#define I3C_I3C_HW_CAPABILITY_REG_HDR_TX_CLOCK_PERIOD_Msk (0x1f800UL) /*!< HDR_TX_CLOCK_PERIOD (Bitfield-Mask: 0x3f)           */
#define I3C_I3C_HW_CAPABILITY_REG_CLOCK_PERIOD_Pos (5UL)            /*!< CLOCK_PERIOD (Bit 5)                                  */
#define I3C_I3C_HW_CAPABILITY_REG_CLOCK_PERIOD_Msk (0x7e0UL)        /*!< CLOCK_PERIOD (Bitfield-Mask: 0x3f)                    */
#define I3C_I3C_HW_CAPABILITY_REG_HDR_TS_EN_Pos (4UL)               /*!< HDR_TS_EN (Bit 4)                                     */
#define I3C_I3C_HW_CAPABILITY_REG_HDR_TS_EN_Msk (0x10UL)            /*!< HDR_TS_EN (Bitfield-Mask: 0x01)                       */
#define I3C_I3C_HW_CAPABILITY_REG_HDR_DDR_EN_Pos (3UL)              /*!< HDR_DDR_EN (Bit 3)                                    */
#define I3C_I3C_HW_CAPABILITY_REG_HDR_DDR_EN_Msk (0x8UL)            /*!< HDR_DDR_EN (Bitfield-Mask: 0x01)                      */
#define I3C_I3C_HW_CAPABILITY_REG_DEVICE_ROLE_CONFIG_Pos (0UL)      /*!< DEVICE_ROLE_CONFIG (Bit 0)                            */
#define I3C_I3C_HW_CAPABILITY_REG_DEVICE_ROLE_CONFIG_Msk (0x7UL)    /*!< DEVICE_ROLE_CONFIG (Bitfield-Mask: 0x07)              */
/* ================================================  I3C_IBI_QUEUE_CTRL_REG  ================================================= */
#define I3C_I3C_IBI_QUEUE_CTRL_REG_NOTIFY_SIR_REJECTED_Pos (3UL)    /*!< NOTIFY_SIR_REJECTED (Bit 3)                           */
#define I3C_I3C_IBI_QUEUE_CTRL_REG_NOTIFY_SIR_REJECTED_Msk (0x8UL)  /*!< NOTIFY_SIR_REJECTED (Bitfield-Mask: 0x01)             */
#define I3C_I3C_IBI_QUEUE_CTRL_REG_NOTIFY_HJ_REJECTED_Pos (0UL)     /*!< NOTIFY_HJ_REJECTED (Bit 0)                            */
#define I3C_I3C_IBI_QUEUE_CTRL_REG_NOTIFY_HJ_REJECTED_Msk (0x1UL)   /*!< NOTIFY_HJ_REJECTED (Bitfield-Mask: 0x01)              */
/* =============================================  I3C_IBI_QUEUE_STATUS_DATA_REG  ============================================= */
#define I3C_I3C_IBI_QUEUE_STATUS_DATA_REG_IBI_STS_Pos (28UL)        /*!< IBI_STS (Bit 28)                                      */
#define I3C_I3C_IBI_QUEUE_STATUS_DATA_REG_IBI_STS_Msk (0xf0000000UL) /*!< IBI_STS (Bitfield-Mask: 0x0f)                        */
#define I3C_I3C_IBI_QUEUE_STATUS_DATA_REG_IBI_ID_Pos (8UL)          /*!< IBI_ID (Bit 8)                                        */
#define I3C_I3C_IBI_QUEUE_STATUS_DATA_REG_IBI_ID_Msk (0xff00UL)     /*!< IBI_ID (Bitfield-Mask: 0xff)                          */
#define I3C_I3C_IBI_QUEUE_STATUS_DATA_REG_DATA_LENGTH_Pos (0UL)     /*!< DATA_LENGTH (Bit 0)                                   */
#define I3C_I3C_IBI_QUEUE_STATUS_DATA_REG_DATA_LENGTH_Msk (0xffUL)  /*!< DATA_LENGTH (Bitfield-Mask: 0xff)                     */
/* ==============================================  I3C_IBI_SIR_REQ_REJECT_REG  =============================================== */
#define I3C_I3C_IBI_SIR_REQ_REJECT_REG_SIR_REQ_REJECT_Pos (0UL)     /*!< SIR_REQ_REJECT (Bit 0)                                */
#define I3C_I3C_IBI_SIR_REQ_REJECT_REG_SIR_REQ_REJECT_Msk (0xffffffffUL) /*!< SIR_REQ_REJECT (Bitfield-Mask: 0xffffffff)       */
/* ==================================================  I3C_INTR_FORCE_REG  =================================================== */
#define I3C_I3C_INTR_FORCE_REG_TRANSFER_ERR_FORCE_EN_Pos (9UL)      /*!< TRANSFER_ERR_FORCE_EN (Bit 9)                         */
#define I3C_I3C_INTR_FORCE_REG_TRANSFER_ERR_FORCE_EN_Msk (0x200UL)  /*!< TRANSFER_ERR_FORCE_EN (Bitfield-Mask: 0x01)           */
#define I3C_I3C_INTR_FORCE_REG_TRANSFER_ABORT_FORCE_EN_Pos (5UL)    /*!< TRANSFER_ABORT_FORCE_EN (Bit 5)                       */
#define I3C_I3C_INTR_FORCE_REG_TRANSFER_ABORT_FORCE_EN_Msk (0x20UL) /*!< TRANSFER_ABORT_FORCE_EN (Bitfield-Mask: 0x01)         */
#define I3C_I3C_INTR_FORCE_REG_RESP_READY_FORCE_EN_Pos (4UL)        /*!< RESP_READY_FORCE_EN (Bit 4)                           */
#define I3C_I3C_INTR_FORCE_REG_RESP_READY_FORCE_EN_Msk (0x10UL)     /*!< RESP_READY_FORCE_EN (Bitfield-Mask: 0x01)             */
#define I3C_I3C_INTR_FORCE_REG_CMD_QUEUE_READY_FORCE_EN_Pos (3UL)   /*!< CMD_QUEUE_READY_FORCE_EN (Bit 3)                      */
#define I3C_I3C_INTR_FORCE_REG_CMD_QUEUE_READY_FORCE_EN_Msk (0x8UL) /*!< CMD_QUEUE_READY_FORCE_EN (Bitfield-Mask: 0x01)        */
#define I3C_I3C_INTR_FORCE_REG_IBI_THLD_FORCE_EN_Pos (2UL)          /*!< IBI_THLD_FORCE_EN (Bit 2)                             */
#define I3C_I3C_INTR_FORCE_REG_IBI_THLD_FORCE_EN_Msk (0x4UL)        /*!< IBI_THLD_FORCE_EN (Bitfield-Mask: 0x01)               */
#define I3C_I3C_INTR_FORCE_REG_RX_THLD_FORCE_EN_Pos (1UL)           /*!< RX_THLD_FORCE_EN (Bit 1)                              */
#define I3C_I3C_INTR_FORCE_REG_RX_THLD_FORCE_EN_Msk (0x2UL)         /*!< RX_THLD_FORCE_EN (Bitfield-Mask: 0x01)                */
#define I3C_I3C_INTR_FORCE_REG_TX_THLD_FORCE_EN_Pos (0UL)           /*!< TX_THLD_FORCE_EN (Bit 0)                              */
#define I3C_I3C_INTR_FORCE_REG_TX_THLD_FORCE_EN_Msk (0x1UL)         /*!< TX_THLD_FORCE_EN (Bitfield-Mask: 0x01)                */
/* ================================================  I3C_INTR_SIGNAL_EN_REG  ================================================= */
#define I3C_I3C_INTR_SIGNAL_EN_REG_TRANSFER_ERR_SIGNAL_EN_Pos (9UL) /*!< TRANSFER_ERR_SIGNAL_EN (Bit 9)                        */
#define I3C_I3C_INTR_SIGNAL_EN_REG_TRANSFER_ERR_SIGNAL_EN_Msk (0x200UL) /*!< TRANSFER_ERR_SIGNAL_EN (Bitfield-Mask: 0x01)      */
#define I3C_I3C_INTR_SIGNAL_EN_REG_TRANSFER_ABORT_SIGNAL_EN_Pos (5UL) /*!< TRANSFER_ABORT_SIGNAL_EN (Bit 5)                    */
#define I3C_I3C_INTR_SIGNAL_EN_REG_TRANSFER_ABORT_SIGNAL_EN_Msk (0x20UL) /*!< TRANSFER_ABORT_SIGNAL_EN (Bitfield-Mask: 0x01)   */
#define I3C_I3C_INTR_SIGNAL_EN_REG_RESP_READY_SIGNAL_EN_Pos (4UL)   /*!< RESP_READY_SIGNAL_EN (Bit 4)                          */
#define I3C_I3C_INTR_SIGNAL_EN_REG_RESP_READY_SIGNAL_EN_Msk (0x10UL) /*!< RESP_READY_SIGNAL_EN (Bitfield-Mask: 0x01)           */
#define I3C_I3C_INTR_SIGNAL_EN_REG_CMD_QUEUE_READY_SIGNAL_EN_Pos (3UL) /*!< CMD_QUEUE_READY_SIGNAL_EN (Bit 3)                  */
#define I3C_I3C_INTR_SIGNAL_EN_REG_CMD_QUEUE_READY_SIGNAL_EN_Msk (0x8UL) /*!< CMD_QUEUE_READY_SIGNAL_EN (Bitfield-Mask: 0x01)  */
#define I3C_I3C_INTR_SIGNAL_EN_REG_IBI_THLD_SIGNAL_EN_Pos (2UL)     /*!< IBI_THLD_SIGNAL_EN (Bit 2)                            */
#define I3C_I3C_INTR_SIGNAL_EN_REG_IBI_THLD_SIGNAL_EN_Msk (0x4UL)   /*!< IBI_THLD_SIGNAL_EN (Bitfield-Mask: 0x01)              */
#define I3C_I3C_INTR_SIGNAL_EN_REG_RX_THLD_SIGNAL_EN_Pos (1UL)      /*!< RX_THLD_SIGNAL_EN (Bit 1)                             */
#define I3C_I3C_INTR_SIGNAL_EN_REG_RX_THLD_SIGNAL_EN_Msk (0x2UL)    /*!< RX_THLD_SIGNAL_EN (Bitfield-Mask: 0x01)               */
#define I3C_I3C_INTR_SIGNAL_EN_REG_TX_THLD_SIGNAL_EN_Pos (0UL)      /*!< TX_THLD_SIGNAL_EN (Bit 0)                             */
#define I3C_I3C_INTR_SIGNAL_EN_REG_TX_THLD_SIGNAL_EN_Msk (0x1UL)    /*!< TX_THLD_SIGNAL_EN (Bitfield-Mask: 0x01)               */
/* ================================================  I3C_INTR_STATUS_EN_REG  ================================================= */
#define I3C_I3C_INTR_STATUS_EN_REG_TRANSFER_ERR_STS_EN_Pos (9UL)    /*!< TRANSFER_ERR_STS_EN (Bit 9)                           */
#define I3C_I3C_INTR_STATUS_EN_REG_TRANSFER_ERR_STS_EN_Msk (0x200UL) /*!< TRANSFER_ERR_STS_EN (Bitfield-Mask: 0x01)            */
#define I3C_I3C_INTR_STATUS_EN_REG_TRANSFER_ABORT_STS_EN_Pos (5UL)  /*!< TRANSFER_ABORT_STS_EN (Bit 5)                         */
#define I3C_I3C_INTR_STATUS_EN_REG_TRANSFER_ABORT_STS_EN_Msk (0x20UL) /*!< TRANSFER_ABORT_STS_EN (Bitfield-Mask: 0x01)         */
#define I3C_I3C_INTR_STATUS_EN_REG_RESP_READY_STS_EN_Pos (4UL)      /*!< RESP_READY_STS_EN (Bit 4)                             */
#define I3C_I3C_INTR_STATUS_EN_REG_RESP_READY_STS_EN_Msk (0x10UL)   /*!< RESP_READY_STS_EN (Bitfield-Mask: 0x01)               */
#define I3C_I3C_INTR_STATUS_EN_REG_CMD_QUEUE_READY_STS_EN_Pos (3UL) /*!< CMD_QUEUE_READY_STS_EN (Bit 3)                        */
#define I3C_I3C_INTR_STATUS_EN_REG_CMD_QUEUE_READY_STS_EN_Msk (0x8UL) /*!< CMD_QUEUE_READY_STS_EN (Bitfield-Mask: 0x01)        */
#define I3C_I3C_INTR_STATUS_EN_REG_IBI_THLD_STS_EN_Pos (2UL)        /*!< IBI_THLD_STS_EN (Bit 2)                               */
#define I3C_I3C_INTR_STATUS_EN_REG_IBI_THLD_STS_EN_Msk (0x4UL)      /*!< IBI_THLD_STS_EN (Bitfield-Mask: 0x01)                 */
#define I3C_I3C_INTR_STATUS_EN_REG_RX_THLD_STS_EN_Pos (1UL)         /*!< RX_THLD_STS_EN (Bit 1)                                */
#define I3C_I3C_INTR_STATUS_EN_REG_RX_THLD_STS_EN_Msk (0x2UL)       /*!< RX_THLD_STS_EN (Bitfield-Mask: 0x01)                  */
#define I3C_I3C_INTR_STATUS_EN_REG_TX_THLD_STS_EN_Pos (0UL)         /*!< TX_THLD_STS_EN (Bit 0)                                */
#define I3C_I3C_INTR_STATUS_EN_REG_TX_THLD_STS_EN_Msk (0x1UL)       /*!< TX_THLD_STS_EN (Bitfield-Mask: 0x01)                  */
/* ==================================================  I3C_INTR_STATUS_REG  ================================================== */
#define I3C_I3C_INTR_STATUS_REG_TRANSFER_ERR_STS_Pos (9UL)          /*!< TRANSFER_ERR_STS (Bit 9)                              */
#define I3C_I3C_INTR_STATUS_REG_TRANSFER_ERR_STS_Msk (0x200UL)      /*!< TRANSFER_ERR_STS (Bitfield-Mask: 0x01)                */
#define I3C_I3C_INTR_STATUS_REG_TRANSFER_ABORT_STS_Pos (5UL)        /*!< TRANSFER_ABORT_STS (Bit 5)                            */
#define I3C_I3C_INTR_STATUS_REG_TRANSFER_ABORT_STS_Msk (0x20UL)     /*!< TRANSFER_ABORT_STS (Bitfield-Mask: 0x01)              */
#define I3C_I3C_INTR_STATUS_REG_RESP_READY_STS_Pos (4UL)            /*!< RESP_READY_STS (Bit 4)                                */
#define I3C_I3C_INTR_STATUS_REG_RESP_READY_STS_Msk (0x10UL)         /*!< RESP_READY_STS (Bitfield-Mask: 0x01)                  */
#define I3C_I3C_INTR_STATUS_REG_CMD_QUEUE_READY_STS_Pos (3UL)       /*!< CMD_QUEUE_READY_STS (Bit 3)                           */
#define I3C_I3C_INTR_STATUS_REG_CMD_QUEUE_READY_STS_Msk (0x8UL)     /*!< CMD_QUEUE_READY_STS (Bitfield-Mask: 0x01)             */
#define I3C_I3C_INTR_STATUS_REG_IBI_THLD_STS_Pos (2UL)              /*!< IBI_THLD_STS (Bit 2)                                  */
#define I3C_I3C_INTR_STATUS_REG_IBI_THLD_STS_Msk (0x4UL)            /*!< IBI_THLD_STS (Bitfield-Mask: 0x01)                    */
#define I3C_I3C_INTR_STATUS_REG_RX_THLD_STS_Pos (1UL)               /*!< RX_THLD_STS (Bit 1)                                   */
#define I3C_I3C_INTR_STATUS_REG_RX_THLD_STS_Msk (0x2UL)             /*!< RX_THLD_STS (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_INTR_STATUS_REG_TX_THLD_STS_Pos (0UL)               /*!< TX_THLD_STS (Bit 0)                                   */
#define I3C_I3C_INTR_STATUS_REG_TX_THLD_STS_Msk (0x1UL)             /*!< TX_THLD_STS (Bitfield-Mask: 0x01)                     */
/* =================================================  I3C_PRESENT_STATE_REG  ================================================= */
#define I3C_I3C_PRESENT_STATE_REG_MASTER_IDLE_Pos (28UL)            /*!< MASTER_IDLE (Bit 28)                                  */
#define I3C_I3C_PRESENT_STATE_REG_MASTER_IDLE_Msk (0x10000000UL)    /*!< MASTER_IDLE (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_PRESENT_STATE_REG_CMD_TID_Pos (24UL)                /*!< CMD_TID (Bit 24)                                      */
#define I3C_I3C_PRESENT_STATE_REG_CMD_TID_Msk (0xf000000UL)         /*!< CMD_TID (Bitfield-Mask: 0x0f)                         */
#define I3C_I3C_PRESENT_STATE_REG_CM_TFR_ST_STS_Pos (16UL)          /*!< CM_TFR_ST_STS (Bit 16)                                */
#define I3C_I3C_PRESENT_STATE_REG_CM_TFR_ST_STS_Msk (0x3f0000UL)    /*!< CM_TFR_ST_STS (Bitfield-Mask: 0x3f)                   */
#define I3C_I3C_PRESENT_STATE_REG_CM_TFR_STS_Pos (8UL)              /*!< CM_TFR_STS (Bit 8)                                    */
#define I3C_I3C_PRESENT_STATE_REG_CM_TFR_STS_Msk (0x3f00UL)         /*!< CM_TFR_STS (Bitfield-Mask: 0x3f)                      */
#define I3C_I3C_PRESENT_STATE_REG_CURRENT_MASTER_Pos (2UL)          /*!< CURRENT_MASTER (Bit 2)                                */
#define I3C_I3C_PRESENT_STATE_REG_CURRENT_MASTER_Msk (0x4UL)        /*!< CURRENT_MASTER (Bitfield-Mask: 0x01)                  */
#define I3C_I3C_PRESENT_STATE_REG_SDA_LINE_SIGNAL_LEVEL_Pos (1UL)   /*!< SDA_LINE_SIGNAL_LEVEL (Bit 1)                         */
#define I3C_I3C_PRESENT_STATE_REG_SDA_LINE_SIGNAL_LEVEL_Msk (0x2UL) /*!< SDA_LINE_SIGNAL_LEVEL (Bitfield-Mask: 0x01)           */
#define I3C_I3C_PRESENT_STATE_REG_SCL_LINE_SIGNAL_LEVEL_Pos (0UL)   /*!< SCL_LINE_SIGNAL_LEVEL (Bit 0)                         */
#define I3C_I3C_PRESENT_STATE_REG_SCL_LINE_SIGNAL_LEVEL_Msk (0x1UL) /*!< SCL_LINE_SIGNAL_LEVEL (Bitfield-Mask: 0x01)           */
/* =============================================  I3C_QUEUE_SIZE_CAPABILITY_REG  ============================================= */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_IBI_BUF_SIZE_Pos (16UL)   /*!< IBI_BUF_SIZE (Bit 16)                                 */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_IBI_BUF_SIZE_Msk (0xf0000UL) /*!< IBI_BUF_SIZE (Bitfield-Mask: 0x0f)                 */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_RESP_BUF_SIZE_Pos (12UL)  /*!< RESP_BUF_SIZE (Bit 12)                                */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_RESP_BUF_SIZE_Msk (0xf000UL) /*!< RESP_BUF_SIZE (Bitfield-Mask: 0x0f)                */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_CMD_BUF_SIZE_Pos (8UL)    /*!< CMD_BUF_SIZE (Bit 8)                                  */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_CMD_BUF_SIZE_Msk (0xf00UL) /*!< CMD_BUF_SIZE (Bitfield-Mask: 0x0f)                   */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_RX_BUF_SIZE_Pos (4UL)     /*!< RX_BUF_SIZE (Bit 4)                                   */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_RX_BUF_SIZE_Msk (0xf0UL)  /*!< RX_BUF_SIZE (Bitfield-Mask: 0x0f)                     */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_TX_BUF_SIZE_Pos (0UL)     /*!< TX_BUF_SIZE (Bit 0)                                   */
#define I3C_I3C_QUEUE_SIZE_CAPABILITY_REG_TX_BUF_SIZE_Msk (0xfUL)   /*!< TX_BUF_SIZE (Bitfield-Mask: 0x0f)                     */
/* ==============================================  I3C_QUEUE_STATUS_LEVEL_REG  =============================================== */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_IBI_STS_CNT_Pos (24UL)       /*!< IBI_STS_CNT (Bit 24)                                  */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_IBI_STS_CNT_Msk (0x1f000000UL) /*!< IBI_STS_CNT (Bitfield-Mask: 0x1f)                   */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_IBI_BUF_BLR_Pos (16UL)       /*!< IBI_BUF_BLR (Bit 16)                                  */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_IBI_BUF_BLR_Msk (0xff0000UL) /*!< IBI_BUF_BLR (Bitfield-Mask: 0xff)                     */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_RESP_BUF_BLR_Pos (8UL)       /*!< RESP_BUF_BLR (Bit 8)                                  */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_RESP_BUF_BLR_Msk (0xff00UL)  /*!< RESP_BUF_BLR (Bitfield-Mask: 0xff)                    */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_CMD_QUEUE_EMPTY_LOC_Pos (0UL) /*!< CMD_QUEUE_EMPTY_LOC (Bit 0)                          */
#define I3C_I3C_QUEUE_STATUS_LEVEL_REG_CMD_QUEUE_EMPTY_LOC_Msk (0xffUL) /*!< CMD_QUEUE_EMPTY_LOC (Bitfield-Mask: 0xff)         */
/* ================================================  I3C_QUEUE_THLD_CTRL_REG  ================================================ */
#define I3C_I3C_QUEUE_THLD_CTRL_REG_IBI_STATUS_THLD_Pos (24UL)      /*!< IBI_STATUS_THLD (Bit 24)                              */
