antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define I3C_I3C_QUEUE_THLD_CTRL_REG_IBI_STATUS_THLD_Msk (0xff000000UL) /*!< IBI_STATUS_THLD (Bitfield-Mask: 0xff)              */
#define I3C_I3C_QUEUE_THLD_CTRL_REG_RESP_BUF_THLD_Pos (8UL)         /*!< RESP_BUF_THLD (Bit 8)                                 */
#define I3C_I3C_QUEUE_THLD_CTRL_REG_RESP_BUF_THLD_Msk (0xff00UL)    /*!< RESP_BUF_THLD (Bitfield-Mask: 0xff)                   */
#define I3C_I3C_QUEUE_THLD_CTRL_REG_CMD_EMPTY_BUF_THLD_Pos (0UL)    /*!< CMD_EMPTY_BUF_THLD (Bit 0)                            */
#define I3C_I3C_QUEUE_THLD_CTRL_REG_CMD_EMPTY_BUF_THLD_Msk (0xffUL) /*!< CMD_EMPTY_BUF_THLD (Bitfield-Mask: 0xff)              */
/* ==================================================  I3C_RESET_CTRL_REG  =================================================== */
#define I3C_I3C_RESET_CTRL_REG_IBI_QUEUE_RST_Pos (5UL)              /*!< IBI_QUEUE_RST (Bit 5)                                 */
#define I3C_I3C_RESET_CTRL_REG_IBI_QUEUE_RST_Msk (0x20UL)           /*!< IBI_QUEUE_RST (Bitfield-Mask: 0x01)                   */
#define I3C_I3C_RESET_CTRL_REG_RX_FIFO_RST_Pos (4UL)                /*!< RX_FIFO_RST (Bit 4)                                   */
#define I3C_I3C_RESET_CTRL_REG_RX_FIFO_RST_Msk (0x10UL)             /*!< RX_FIFO_RST (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_RESET_CTRL_REG_TX_FIFO_RST_Pos (3UL)                /*!< TX_FIFO_RST (Bit 3)                                   */
#define I3C_I3C_RESET_CTRL_REG_TX_FIFO_RST_Msk (0x8UL)              /*!< TX_FIFO_RST (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_RESET_CTRL_REG_RESP_QUEUE_RST_Pos (2UL)             /*!< RESP_QUEUE_RST (Bit 2)                                */
#define I3C_I3C_RESET_CTRL_REG_RESP_QUEUE_RST_Msk (0x4UL)           /*!< RESP_QUEUE_RST (Bitfield-Mask: 0x01)                  */
#define I3C_I3C_RESET_CTRL_REG_CMD_QUEUE_RST_Pos (1UL)              /*!< CMD_QUEUE_RST (Bit 1)                                 */
#define I3C_I3C_RESET_CTRL_REG_CMD_QUEUE_RST_Msk (0x2UL)            /*!< CMD_QUEUE_RST (Bitfield-Mask: 0x01)                   */
#define I3C_I3C_RESET_CTRL_REG_SOFT_RST_Pos (0UL)                   /*!< SOFT_RST (Bit 0)                                      */
#define I3C_I3C_RESET_CTRL_REG_SOFT_RST_Msk (0x1UL)                 /*!< SOFT_RST (Bitfield-Mask: 0x01)                        */
/* ==============================================  I3C_RESPONSE_QUEUE_PORT_REG  ============================================== */
#define I3C_I3C_RESPONSE_QUEUE_PORT_REG_RESPONSE_Pos (0UL)          /*!< RESPONSE (Bit 0)                                      */
#define I3C_I3C_RESPONSE_QUEUE_PORT_REG_RESPONSE_Msk (0xffffffffUL) /*!< RESPONSE (Bitfield-Mask: 0xffffffff)                  */
/* ================================================  I3C_RX_TX_DATA_PORT_REG  ================================================ */
#define I3C_I3C_RX_TX_DATA_PORT_REG_RX_TX_DATA_PORT_Pos (0UL)       /*!< RX_TX_DATA_PORT (Bit 0)                               */
#define I3C_I3C_RX_TX_DATA_PORT_REG_RX_TX_DATA_PORT_Msk (0xffffffffUL) /*!< RX_TX_DATA_PORT (Bitfield-Mask: 0xffffffff)        */
/* ==============================================  I3C_SCL_EXT_LCNT_TIMING_REG  ============================================== */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_4_Pos (24UL)   /*!< I3C_EXT_LCNT_4 (Bit 24)                               */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_4_Msk (0xff000000UL) /*!< I3C_EXT_LCNT_4 (Bitfield-Mask: 0xff)            */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_3_Pos (16UL)   /*!< I3C_EXT_LCNT_3 (Bit 16)                               */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_3_Msk (0xff0000UL) /*!< I3C_EXT_LCNT_3 (Bitfield-Mask: 0xff)              */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_2_Pos (8UL)    /*!< I3C_EXT_LCNT_2 (Bit 8)                                */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_2_Msk (0xff00UL) /*!< I3C_EXT_LCNT_2 (Bitfield-Mask: 0xff)                */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_1_Pos (0UL)    /*!< I3C_EXT_LCNT_1 (Bit 0)                                */
#define I3C_I3C_SCL_EXT_LCNT_TIMING_REG_I3C_EXT_LCNT_1_Msk (0xffUL) /*!< I3C_EXT_LCNT_1 (Bitfield-Mask: 0xff)                  */
/* ============================================  I3C_SCL_EXT_TERMN_LCNT_TIME_REG  ============================================ */
#define I3C_I3C_SCL_EXT_TERMN_LCNT_TIME_REG_I3C_EXT_TERMN_LCNT_Pos (0UL) /*!< I3C_EXT_TERMN_LCNT (Bit 0)                       */
#define I3C_I3C_SCL_EXT_TERMN_LCNT_TIME_REG_I3C_EXT_TERMN_LCNT_Msk (0xfUL) /*!< I3C_EXT_TERMN_LCNT (Bitfield-Mask: 0x0f)       */
/* ==============================================  I3C_SCL_I2C_FMP_TIMING_REG  =============================================== */
#define I3C_I3C_SCL_I2C_FMP_TIMING_REG_I2C_FMP_HCNT_Pos (16UL)      /*!< I2C_FMP_HCNT (Bit 16)                                 */
#define I3C_I3C_SCL_I2C_FMP_TIMING_REG_I2C_FMP_HCNT_Msk (0xff0000UL) /*!< I2C_FMP_HCNT (Bitfield-Mask: 0xff)                   */
#define I3C_I3C_SCL_I2C_FMP_TIMING_REG_I2C_FMP_LCNT_Pos (0UL)       /*!< I2C_FMP_LCNT (Bit 0)                                  */
#define I3C_I3C_SCL_I2C_FMP_TIMING_REG_I2C_FMP_LCNT_Msk (0xffffUL)  /*!< I2C_FMP_LCNT (Bitfield-Mask: 0xffff)                  */
/* ===============================================  I3C_SCL_I2C_FM_TIMING_REG  =============================================== */
#define I3C_I3C_SCL_I2C_FM_TIMING_REG_I2C_FM_HCNT_Pos (16UL)        /*!< I2C_FM_HCNT (Bit 16)                                  */
#define I3C_I3C_SCL_I2C_FM_TIMING_REG_I2C_FM_HCNT_Msk (0xffff0000UL) /*!< I2C_FM_HCNT (Bitfield-Mask: 0xffff)                  */
#define I3C_I3C_SCL_I2C_FM_TIMING_REG_I2C_FM_LCNT_Pos (0UL)         /*!< I2C_FM_LCNT (Bit 0)                                   */
#define I3C_I3C_SCL_I2C_FM_TIMING_REG_I2C_FM_LCNT_Msk (0xffffUL)    /*!< I2C_FM_LCNT (Bitfield-Mask: 0xffff)                   */
/* ===============================================  I3C_SCL_I3C_OD_TIMING_REG  =============================================== */
#define I3C_I3C_SCL_I3C_OD_TIMING_REG_I3C_OD_HCNT_Pos (16UL)        /*!< I3C_OD_HCNT (Bit 16)                                  */
#define I3C_I3C_SCL_I3C_OD_TIMING_REG_I3C_OD_HCNT_Msk (0xff0000UL)  /*!< I3C_OD_HCNT (Bitfield-Mask: 0xff)                     */
#define I3C_I3C_SCL_I3C_OD_TIMING_REG_I3C_OD_LCNT_Pos (0UL)         /*!< I3C_OD_LCNT (Bit 0)                                   */
#define I3C_I3C_SCL_I3C_OD_TIMING_REG_I3C_OD_LCNT_Msk (0xffUL)      /*!< I3C_OD_LCNT (Bitfield-Mask: 0xff)                     */
/* ===============================================  I3C_SCL_I3C_PP_TIMING_REG  =============================================== */
#define I3C_I3C_SCL_I3C_PP_TIMING_REG_I3C_PP_HCNT_Pos (16UL)        /*!< I3C_PP_HCNT (Bit 16)                                  */
#define I3C_I3C_SCL_I3C_PP_TIMING_REG_I3C_PP_HCNT_Msk (0xff0000UL)  /*!< I3C_PP_HCNT (Bitfield-Mask: 0xff)                     */
#define I3C_I3C_SCL_I3C_PP_TIMING_REG_I3C_PP_LCNT_Pos (0UL)         /*!< I3C_PP_LCNT (Bit 0)                                   */
#define I3C_I3C_SCL_I3C_PP_TIMING_REG_I3C_PP_LCNT_Msk (0xffUL)      /*!< I3C_PP_LCNT (Bitfield-Mask: 0xff)                     */
/* ==============================================  I3C_SDA_HOLD_DLY_TIMING_REG  ============================================== */
#define I3C_I3C_SDA_HOLD_DLY_TIMING_REG_SDA_TX_HOLD_Pos (16UL)      /*!< SDA_TX_HOLD (Bit 16)                                  */
#define I3C_I3C_SDA_HOLD_DLY_TIMING_REG_SDA_TX_HOLD_Msk (0x70000UL) /*!< SDA_TX_HOLD (Bitfield-Mask: 0x07)                     */
/* ===============================================  I3C_SLV_EVENT_STATUS_REG  ================================================ */
#define I3C_I3C_SLV_EVENT_STATUS_REG_MWL_UPDATED_Pos (7UL)          /*!< MWL_UPDATED (Bit 7)                                   */
#define I3C_I3C_SLV_EVENT_STATUS_REG_MWL_UPDATED_Msk (0x80UL)       /*!< MWL_UPDATED (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_SLV_EVENT_STATUS_REG_MRL_UPDATED_Pos (6UL)          /*!< MRL_UPDATED (Bit 6)                                   */
#define I3C_I3C_SLV_EVENT_STATUS_REG_MRL_UPDATED_Msk (0x40UL)       /*!< MRL_UPDATED (Bitfield-Mask: 0x01)                     */
#define I3C_I3C_SLV_EVENT_STATUS_REG_ACTIVITY_STATE_Pos (4UL)       /*!< ACTIVITY_STATE (Bit 4)                                */
#define I3C_I3C_SLV_EVENT_STATUS_REG_ACTIVITY_STATE_Msk (0x30UL)    /*!< ACTIVITY_STATE (Bitfield-Mask: 0x03)                  */
/* ============================================  I3C_VENDOR_SPECIFIC_REG_PTR_REG  ============================================ */
#define I3C_I3C_VENDOR_SPECIFIC_REG_PTR_REG_P_VENDOR_REG_START_ADDR_Pos (0UL) /*!< P_VENDOR_REG_START_ADDR (Bit 0)             */
#define I3C_I3C_VENDOR_SPECIFIC_REG_PTR_REG_P_VENDOR_REG_START_ADDR_Msk (0xffffUL) /*!< P_VENDOR_REG_START_ADDR (Bitfield-Mask: 0xffff) */
/* ====================================================  I3C_VER_ID_REG  ===================================================== */
#define I3C_I3C_VER_ID_REG_I3C_VER_ID_Pos (0UL)                     /*!< I3C_VER_ID (Bit 0)                                    */
#define I3C_I3C_VER_ID_REG_I3C_VER_ID_Msk (0xffffffffUL)            /*!< I3C_VER_ID (Bitfield-Mask: 0xffffffff)                */
/* ===================================================  I3C_VER_TYPE_REG  ==================================================== */
#define I3C_I3C_VER_TYPE_REG_I3C_VER_TYPE_Pos (0UL)                 /*!< I3C_VER_TYPE (Bit 0)                                  */
#define I3C_I3C_VER_TYPE_REG_I3C_VER_TYPE_Msk (0xffffffffUL)        /*!< I3C_VER_TYPE (Bitfield-Mask: 0xffffffff)              */


/* =========================================================================================================================== */
/* ================                                           LCDC                                            ================ */
/* =========================================================================================================================== */

