antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* =================================================  LCDC_BACKPORCHXY_REG  ================================================== */
#define LCDC_LCDC_BACKPORCHXY_REG_BPORCH_X_Pos (16UL)               /*!< BPORCH_X (Bit 16)                                     */
#define LCDC_LCDC_BACKPORCHXY_REG_BPORCH_X_Msk (0xffff0000UL)       /*!< BPORCH_X (Bitfield-Mask: 0xffff)                      */
#define LCDC_LCDC_BACKPORCHXY_REG_BPORCH_Y_Pos (0UL)                /*!< BPORCH_Y (Bit 0)                                      */
#define LCDC_LCDC_BACKPORCHXY_REG_BPORCH_Y_Msk (0xffffUL)           /*!< BPORCH_Y (Bitfield-Mask: 0xffff)                      */
/* ===================================================  LCDC_BGCOLOR_REG  ==================================================== */
#define LCDC_LCDC_BGCOLOR_REG_BG_RED_Pos  (24UL)                    /*!< BG_RED (Bit 24)                                       */
#define LCDC_LCDC_BGCOLOR_REG_BG_RED_Msk  (0xff000000UL)            /*!< BG_RED (Bitfield-Mask: 0xff)                          */
#define LCDC_LCDC_BGCOLOR_REG_BG_GREEN_Pos (16UL)                   /*!< BG_GREEN (Bit 16)                                     */
#define LCDC_LCDC_BGCOLOR_REG_BG_GREEN_Msk (0xff0000UL)             /*!< BG_GREEN (Bitfield-Mask: 0xff)                        */
#define LCDC_LCDC_BGCOLOR_REG_BG_BLUE_Pos (8UL)                     /*!< BG_BLUE (Bit 8)                                       */
#define LCDC_LCDC_BGCOLOR_REG_BG_BLUE_Msk (0xff00UL)                /*!< BG_BLUE (Bitfield-Mask: 0xff)                         */
#define LCDC_LCDC_BGCOLOR_REG_BG_ALPHA_Pos (0UL)                    /*!< BG_ALPHA (Bit 0)                                      */
#define LCDC_LCDC_BGCOLOR_REG_BG_ALPHA_Msk (0xffUL)                 /*!< BG_ALPHA (Bitfield-Mask: 0xff)                        */
/* ==================================================  LCDC_BLANKINGXY_REG  ================================================== */
#define LCDC_LCDC_BLANKINGXY_REG_BLANKING_X_Pos (16UL)              /*!< BLANKING_X (Bit 16)                                   */
#define LCDC_LCDC_BLANKINGXY_REG_BLANKING_X_Msk (0xffff0000UL)      /*!< BLANKING_X (Bitfield-Mask: 0xffff)                    */
#define LCDC_LCDC_BLANKINGXY_REG_BLANKING_Y_Pos (0UL)               /*!< BLANKING_Y (Bit 0)                                    */
#define LCDC_LCDC_BLANKINGXY_REG_BLANKING_Y_Msk (0xffffUL)          /*!< BLANKING_Y (Bitfield-Mask: 0xffff)                    */
/* ==================================================  LCDC_CLKCTRL_CG_REG  ================================================== */
#define LCDC_LCDC_CLKCTRL_CG_REG_LCDC_SWAP_PIX_FORMAT_CLK_Pos (2UL) /*!< LCDC_SWAP_PIX_FORMAT_CLK (Bit 2)                      */
#define LCDC_LCDC_CLKCTRL_CG_REG_LCDC_SWAP_PIX_FORMAT_CLK_Msk (0x4UL) /*!< LCDC_SWAP_PIX_FORMAT_CLK (Bitfield-Mask: 0x01)      */
#define LCDC_LCDC_CLKCTRL_CG_REG_LCDC_INV_CLK_POLARITY_Pos (1UL)    /*!< LCDC_INV_CLK_POLARITY (Bit 1)                         */
#define LCDC_LCDC_CLKCTRL_CG_REG_LCDC_INV_CLK_POLARITY_Msk (0x2UL)  /*!< LCDC_INV_CLK_POLARITY (Bitfield-Mask: 0x01)           */
/* ===================================================  LCDC_CLKCTRL_REG  ==================================================== */
#define LCDC_LCDC_CLKCTRL_REG_SEC_CLK_DIV_Pos (27UL)                /*!< SEC_CLK_DIV (Bit 27)                                  */
#define LCDC_LCDC_CLKCTRL_REG_SEC_CLK_DIV_Msk (0xf8000000UL)        /*!< SEC_CLK_DIV (Bitfield-Mask: 0x1f)                     */
#define LCDC_LCDC_CLKCTRL_REG_DMA_HOLD_Pos (8UL)                    /*!< DMA_HOLD (Bit 8)                                      */
#define LCDC_LCDC_CLKCTRL_REG_DMA_HOLD_Msk (0x3f00UL)               /*!< DMA_HOLD (Bitfield-Mask: 0x3f)                        */
#define LCDC_LCDC_CLKCTRL_REG_CLK_DIV_Pos (0UL)                     /*!< CLK_DIV (Bit 0)                                       */
#define LCDC_LCDC_CLKCTRL_REG_CLK_DIV_Msk (0x3fUL)                  /*!< CLK_DIV (Bitfield-Mask: 0x3f)                         */
/* ====================================================  LCDC_COLMOD_REG  ==================================================== */
#define LCDC_LCDC_COLMOD_REG_COLMODES_Pos (0UL)                     /*!< COLMODES (Bit 0)                                      */
#define LCDC_LCDC_COLMOD_REG_COLMODES_Msk (0x1ffffUL)               /*!< COLMODES (Bitfield-Mask: 0x1ffff)                     */
/* =====================================================  LCDC_CONF_REG  ===================================================== */
#define LCDC_LCDC_CONF_REG_CONF_Pos       (0UL)                     /*!< CONF (Bit 0)                                          */
#define LCDC_LCDC_CONF_REG_CONF_Msk       (0xffffffffUL)            /*!< CONF (Bitfield-Mask: 0xffffffff)                      */
/* =====================================================  LCDC_CRC_REG  ====================================================== */
#define LCDC_LCDC_CRC_REG_CRC_Pos         (0UL)                     /*!< CRC (Bit 0)                                           */
#define LCDC_LCDC_CRC_REG_CRC_Msk         (0xffffffffUL)            /*!< CRC (Bitfield-Mask: 0xffffffff)                       */
/* ===================================================  LCDC_DBIB_CFG_REG  =================================================== */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_INTERFACE_EN_Pos (31UL)         /*!< DBIB_INTERFACE_EN (Bit 31)                            */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_INTERFACE_EN_Msk (0x80000000UL) /*!< DBIB_INTERFACE_EN (Bitfield-Mask: 0x01)               */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_CSX_CFG_EN_Pos (30UL)           /*!< DBIB_CSX_CFG_EN (Bit 30)                              */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_CSX_CFG_EN_Msk (0x40000000UL)   /*!< DBIB_CSX_CFG_EN (Bitfield-Mask: 0x01)                 */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_CSX_CFG_Pos (29UL)              /*!< DBIB_CSX_CFG (Bit 29)                                 */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_CSX_CFG_Msk (0x20000000UL)      /*!< DBIB_CSX_CFG (Bitfield-Mask: 0x01)                    */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_TE_DISABLE_Pos (28UL)           /*!< DBIB_TE_DISABLE (Bit 28)                              */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_TE_DISABLE_Msk (0x10000000UL)   /*!< DBIB_TE_DISABLE (Bitfield-Mask: 0x01)                 */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_DC_AS_SPI_SD1_Pos (27UL)         /*!< SPI_DC_AS_SPI_SD1 (Bit 27)                            */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_DC_AS_SPI_SD1_Msk (0x8000000UL)  /*!< SPI_DC_AS_SPI_SD1 (Bitfield-Mask: 0x01)               */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_FORCE_IDLE_Pos (26UL)           /*!< DBIB_FORCE_IDLE (Bit 26)                              */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_FORCE_IDLE_Msk (0x4000000UL)    /*!< DBIB_FORCE_IDLE (Bitfield-Mask: 0x01)                 */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_RESX_OUT_EN_Pos (25UL)          /*!< DBIB_RESX_OUT_EN (Bit 25)                             */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_RESX_OUT_EN_Msk (0x2000000UL)   /*!< DBIB_RESX_OUT_EN (Bitfield-Mask: 0x01)                */
#define LCDC_LCDC_DBIB_CFG_REG_SUB_PIXEL_REVERSE_Pos (24UL)         /*!< SUB_PIXEL_REVERSE (Bit 24)                            */
#define LCDC_LCDC_DBIB_CFG_REG_SUB_PIXEL_REVERSE_Msk (0x1000000UL)  /*!< SUB_PIXEL_REVERSE (Bitfield-Mask: 0x01)               */
#define LCDC_LCDC_DBIB_CFG_REG_SPI3_EN_Pos (23UL)                   /*!< SPI3_EN (Bit 23)                                      */
#define LCDC_LCDC_DBIB_CFG_REG_SPI3_EN_Msk (0x800000UL)             /*!< SPI3_EN (Bitfield-Mask: 0x01)                         */
#define LCDC_LCDC_DBIB_CFG_REG_SPI4_EN_Pos (22UL)                   /*!< SPI4_EN (Bit 22)                                      */
#define LCDC_LCDC_DBIB_CFG_REG_SPI4_EN_Msk (0x400000UL)             /*!< SPI4_EN (Bitfield-Mask: 0x01)                         */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_BACK_PRESSURE_EN_Pos (21UL)     /*!< DBIB_BACK_PRESSURE_EN (Bit 21)                        */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_BACK_PRESSURE_EN_Msk (0x200000UL) /*!< DBIB_BACK_PRESSURE_EN (Bitfield-Mask: 0x01)         */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_CLK_PHASE_Pos (20UL)             /*!< SPI_CLK_PHASE (Bit 20)                                */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_CLK_PHASE_Msk (0x100000UL)       /*!< SPI_CLK_PHASE (Bitfield-Mask: 0x01)                   */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_CLK_POLARITY_Pos (19UL)          /*!< SPI_CLK_POLARITY (Bit 19)                             */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_CLK_POLARITY_Msk (0x80000UL)     /*!< SPI_CLK_POLARITY (Bitfield-Mask: 0x01)                */
#define LCDC_LCDC_DBIB_CFG_REG_SPID_JDI_Pos (18UL)                  /*!< SPID_JDI (Bit 18)                                     */
#define LCDC_LCDC_DBIB_CFG_REG_SPID_JDI_Msk (0x40000UL)             /*!< SPID_JDI (Bitfield-Mask: 0x01)                        */
#define LCDC_LCDC_DBIB_CFG_REG_CMD_DATA_AS_HEADER_Pos (17UL)        /*!< CMD_DATA_AS_HEADER (Bit 17)                           */
#define LCDC_LCDC_DBIB_CFG_REG_CMD_DATA_AS_HEADER_Msk (0x20000UL)   /*!< CMD_DATA_AS_HEADER (Bitfield-Mask: 0x01)              */
#define LCDC_LCDC_DBIB_CFG_REG_BIT_ORDER_ADDR_INVERT_Pos (16UL)     /*!< BIT_ORDER_ADDR_INVERT (Bit 16)                        */
#define LCDC_LCDC_DBIB_CFG_REG_BIT_ORDER_ADDR_INVERT_Msk (0x10000UL) /*!< BIT_ORDER_ADDR_INVERT (Bitfield-Mask: 0x01)          */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_2BYTE_ADDR_Pos (15UL)            /*!< SPI_2BYTE_ADDR (Bit 15)                               */
#define LCDC_LCDC_DBIB_CFG_REG_SPI_2BYTE_ADDR_Msk (0x8000UL)        /*!< SPI_2BYTE_ADDR (Bitfield-Mask: 0x01)                  */
#define LCDC_LCDC_DBIB_CFG_REG_PIX_CLK_AT_DBIB_CLK_Pos (14UL)       /*!< PIX_CLK_AT_DBIB_CLK (Bit 14)                          */
#define LCDC_LCDC_DBIB_CFG_REG_PIX_CLK_AT_DBIB_CLK_Msk (0x4000UL)   /*!< PIX_CLK_AT_DBIB_CLK (Bitfield-Mask: 0x01)             */
#define LCDC_LCDC_DBIB_CFG_REG_EXT_CTRL_EN_Pos (13UL)               /*!< EXT_CTRL_EN (Bit 13)                                  */
#define LCDC_LCDC_DBIB_CFG_REG_EXT_CTRL_EN_Msk (0x2000UL)           /*!< EXT_CTRL_EN (Bitfield-Mask: 0x01)                     */
#define LCDC_LCDC_DBIB_CFG_REG_HORIZONTAL_BLANK_EN_Pos (12UL)       /*!< HORIZONTAL_BLANK_EN (Bit 12)                          */
#define LCDC_LCDC_DBIB_CFG_REG_HORIZONTAL_BLANK_EN_Msk (0x1000UL)   /*!< HORIZONTAL_BLANK_EN (Bitfield-Mask: 0x01)             */
#define LCDC_LCDC_DBIB_CFG_REG_DUAL_SPI_SUBPIXEL_EXTRACT_EN_Pos (11UL) /*!< DUAL_SPI_SUBPIXEL_EXTRACT_EN (Bit 11)              */
#define LCDC_LCDC_DBIB_CFG_REG_DUAL_SPI_SUBPIXEL_EXTRACT_EN_Msk (0x800UL) /*!< DUAL_SPI_SUBPIXEL_EXTRACT_EN (Bitfield-Mask: 0x01) */
#define LCDC_LCDC_DBIB_CFG_REG_QUAD_SPI_EN_Pos (10UL)               /*!< QUAD_SPI_EN (Bit 10)                                  */
#define LCDC_LCDC_DBIB_CFG_REG_QUAD_SPI_EN_Msk (0x400UL)            /*!< QUAD_SPI_EN (Bitfield-Mask: 0x01)                     */
#define LCDC_LCDC_DBIB_CFG_REG_DUAL_SPI_EN_Pos (9UL)                /*!< DUAL_SPI_EN (Bit 9)                                   */
#define LCDC_LCDC_DBIB_CFG_REG_DUAL_SPI_EN_Msk (0x200UL)            /*!< DUAL_SPI_EN (Bitfield-Mask: 0x01)                     */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_INTERFACE_WIDTH_Pos (6UL)       /*!< DBIB_INTERFACE_WIDTH (Bit 6)                          */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_INTERFACE_WIDTH_Msk (0x1c0UL)   /*!< DBIB_INTERFACE_WIDTH (Bitfield-Mask: 0x07)            */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_DATA_ORDER_Pos (3UL)            /*!< DBIB_DATA_ORDER (Bit 3)                               */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_DATA_ORDER_Msk (0x38UL)         /*!< DBIB_DATA_ORDER (Bitfield-Mask: 0x07)                 */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_COLOR_FMT_Pos (0UL)             /*!< DBIB_COLOR_FMT (Bit 0)                                */
#define LCDC_LCDC_DBIB_CFG_REG_DBIB_COLOR_FMT_Msk (0x7UL)           /*!< DBIB_COLOR_FMT (Bitfield-Mask: 0x07)                  */
/* ===================================================  LCDC_DBIB_CMD_REG  =================================================== */
#define LCDC_LCDC_DBIB_CMD_REG_PART_UPDATE_Pos (31UL)               /*!< PART_UPDATE (Bit 31)                                  */
#define LCDC_LCDC_DBIB_CMD_REG_PART_UPDATE_Msk (0x80000000UL)       /*!< PART_UPDATE (Bitfield-Mask: 0x01)                     */
#define LCDC_LCDC_DBIB_CMD_REG_DBIB_CMD_SEND_Pos (30UL)             /*!< DBIB_CMD_SEND (Bit 30)                                */
#define LCDC_LCDC_DBIB_CMD_REG_DBIB_CMD_SEND_Msk (0x40000000UL)     /*!< DBIB_CMD_SEND (Bitfield-Mask: 0x01)                   */
#define LCDC_LCDC_DBIB_CMD_REG_CMD_WIDTH_Pos (28UL)                 /*!< CMD_WIDTH (Bit 28)                                    */
#define LCDC_LCDC_DBIB_CMD_REG_CMD_WIDTH_Msk (0x30000000UL)         /*!< CMD_WIDTH (Bitfield-Mask: 0x03)                       */
#define LCDC_LCDC_DBIB_CMD_REG_QSPI_SERIAL_CMD_TRANS_Pos (27UL)     /*!< QSPI_SERIAL_CMD_TRANS (Bit 27)                        */
#define LCDC_LCDC_DBIB_CMD_REG_QSPI_SERIAL_CMD_TRANS_Msk (0x8000000UL) /*!< QSPI_SERIAL_CMD_TRANS (Bitfield-Mask: 0x01)        */
#define LCDC_LCDC_DBIB_CMD_REG_RD_MODE_EN_Pos (26UL)                /*!< RD_MODE_EN (Bit 26)                                   */
#define LCDC_LCDC_DBIB_CMD_REG_RD_MODE_EN_Msk (0x4000000UL)         /*!< RD_MODE_EN (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_DBIB_CMD_REG_FMTCTRL_EXPOSE_SETTING_Pos (25UL)    /*!< FMTCTRL_EXPOSE_SETTING (Bit 25)                       */
#define LCDC_LCDC_DBIB_CMD_REG_FMTCTRL_EXPOSE_SETTING_Msk (0x2000000UL) /*!< FMTCTRL_EXPOSE_SETTING (Bitfield-Mask: 0x01)      */
#define LCDC_LCDC_DBIB_CMD_REG_ST_INT_CMD_TYPE_Pos (24UL)           /*!< ST_INT_CMD_TYPE (Bit 24)                              */
#define LCDC_LCDC_DBIB_CMD_REG_ST_INT_CMD_TYPE_Msk (0x1000000UL)    /*!< ST_INT_CMD_TYPE (Bitfield-Mask: 0x01)                 */
#define LCDC_LCDC_DBIB_CMD_REG_DBIB_CMD_VAL_Pos (0UL)               /*!< DBIB_CMD_VAL (Bit 0)                                  */
#define LCDC_LCDC_DBIB_CMD_REG_DBIB_CMD_VAL_Msk (0xffffUL)          /*!< DBIB_CMD_VAL (Bitfield-Mask: 0xffff)                  */
/* ==================================================  LCDC_DBIB_RDAT_REG  =================================================== */
#define LCDC_LCDC_DBIB_RDAT_REG_DBIB_RDAT_Pos (0UL)                 /*!< DBIB_RDAT (Bit 0)                                     */
#define LCDC_LCDC_DBIB_RDAT_REG_DBIB_RDAT_Msk (0xffffffffUL)        /*!< DBIB_RDAT (Bitfield-Mask: 0xffffffff)                 */
/* ==================================================  LCDC_FMTCTRL_2_REG  =================================================== */
#define LCDC_LCDC_FMTCTRL_2_REG_FMTCTRL_2_Pos (0UL)                 /*!< FMTCTRL_2 (Bit 0)                                     */
#define LCDC_LCDC_FMTCTRL_2_REG_FMTCTRL_2_Msk (0xffffffffUL)        /*!< FMTCTRL_2 (Bitfield-Mask: 0xffffffff)                 */
/* ==================================================  LCDC_FMTCTRL_3_REG  =================================================== */
#define LCDC_LCDC_FMTCTRL_3_REG_XRST_HIGH_STATE_Pos (0UL)           /*!< XRST_HIGH_STATE (Bit 0)                               */
#define LCDC_LCDC_FMTCTRL_3_REG_XRST_HIGH_STATE_Msk (0x3ffUL)       /*!< XRST_HIGH_STATE (Bitfield-Mask: 0x3ff)                */
/* ===================================================  LCDC_FMTCTRL_REG  ==================================================== */
#define LCDC_LCDC_FMTCTRL_REG_FMTCTRL_Pos (0UL)                     /*!< FMTCTRL (Bit 0)                                       */
#define LCDC_LCDC_FMTCTRL_REG_FMTCTRL_Msk (0xffffffffUL)            /*!< FMTCTRL (Bitfield-Mask: 0xffffffff)                   */
/* =================================================  LCDC_FRONTPORCHXY_REG  ================================================= */
#define LCDC_LCDC_FRONTPORCHXY_REG_FPORCH_X_Pos (16UL)              /*!< FPORCH_X (Bit 16)                                     */
#define LCDC_LCDC_FRONTPORCHXY_REG_FPORCH_X_Msk (0xffff0000UL)      /*!< FPORCH_X (Bitfield-Mask: 0xffff)                      */
#define LCDC_LCDC_FRONTPORCHXY_REG_FPORCH_Y_Pos (0UL)               /*!< FPORCH_Y (Bit 0)                                      */
#define LCDC_LCDC_FRONTPORCHXY_REG_FPORCH_Y_Msk (0xffffUL)          /*!< FPORCH_Y (Bitfield-Mask: 0xffff)                      */
/* =====================================================  LCDC_GPIO_REG  ===================================================== */
#define LCDC_LCDC_GPIO_REG_DPI_CM_ASSERT_Pos (16UL)                 /*!< DPI_CM_ASSERT (Bit 16)                                */
#define LCDC_LCDC_GPIO_REG_DPI_CM_ASSERT_Msk (0x10000UL)            /*!< DPI_CM_ASSERT (Bitfield-Mask: 0x01)                   */
#define LCDC_LCDC_GPIO_REG_DPI_SD_ASSERT_Pos (15UL)                 /*!< DPI_SD_ASSERT (Bit 15)                                */
#define LCDC_LCDC_GPIO_REG_DPI_SD_ASSERT_Msk (0x8000UL)             /*!< DPI_SD_ASSERT (Bitfield-Mask: 0x01)                   */
#define LCDC_LCDC_GPIO_REG_GPIO_SPI_SI_ON_SD_PAD_Pos (5UL)          /*!< GPIO_SPI_SI_ON_SD_PAD (Bit 5)                         */
#define LCDC_LCDC_GPIO_REG_GPIO_SPI_SI_ON_SD_PAD_Msk (0x20UL)       /*!< GPIO_SPI_SI_ON_SD_PAD (Bitfield-Mask: 0x01)           */
#define LCDC_LCDC_GPIO_REG_GPIO_OUTPUT_MODE_Pos (3UL)               /*!< GPIO_OUTPUT_MODE (Bit 3)                              */
#define LCDC_LCDC_GPIO_REG_GPIO_OUTPUT_MODE_Msk (0x18UL)            /*!< GPIO_OUTPUT_MODE (Bitfield-Mask: 0x03)                */
#define LCDC_LCDC_GPIO_REG_GPIO_OUTPUT_EN_Pos (2UL)                 /*!< GPIO_OUTPUT_EN (Bit 2)                                */
#define LCDC_LCDC_GPIO_REG_GPIO_OUTPUT_EN_Msk (0x4UL)               /*!< GPIO_OUTPUT_EN (Bitfield-Mask: 0x01)                  */
#define LCDC_LCDC_GPIO_REG_TE_INV_Pos     (1UL)                     /*!< TE_INV (Bit 1)                                        */
#define LCDC_LCDC_GPIO_REG_TE_INV_Msk     (0x2UL)                   /*!< TE_INV (Bitfield-Mask: 0x01)                          */
/* ====================================================  LCDC_IDREG_REG  ===================================================== */
#define LCDC_LCDC_IDREG_REG_LCDC_ID_Pos   (0UL)                     /*!< LCDC_ID (Bit 0)                                       */
#define LCDC_LCDC_IDREG_REG_LCDC_ID_Msk   (0xffffffffUL)            /*!< LCDC_ID (Bitfield-Mask: 0xffffffff)                   */
/* ==================================================  LCDC_INTERRUPT_REG  =================================================== */
#define LCDC_LCDC_INTERRUPT_REG_IRQ_TRIGGER_SEL_Pos (31UL)          /*!< IRQ_TRIGGER_SEL (Bit 31)                              */
#define LCDC_LCDC_INTERRUPT_REG_IRQ_TRIGGER_SEL_Msk (0x80000000UL)  /*!< IRQ_TRIGGER_SEL (Bitfield-Mask: 0x01)                 */
#define LCDC_LCDC_INTERRUPT_REG_FE_IRQ_EN_Pos (4UL)                 /*!< FE_IRQ_EN (Bit 4)                                     */
#define LCDC_LCDC_INTERRUPT_REG_FE_IRQ_EN_Msk (0x10UL)              /*!< FE_IRQ_EN (Bitfield-Mask: 0x01)                       */
#define LCDC_LCDC_INTERRUPT_REG_TE_IRQ_EN_Pos (3UL)                 /*!< TE_IRQ_EN (Bit 3)                                     */
#define LCDC_LCDC_INTERRUPT_REG_TE_IRQ_EN_Msk (0x8UL)               /*!< TE_IRQ_EN (Bitfield-Mask: 0x01)                       */
#define LCDC_LCDC_INTERRUPT_REG_HSYNC_IRQ_EN_Pos (1UL)              /*!< HSYNC_IRQ_EN (Bit 1)                                  */
#define LCDC_LCDC_INTERRUPT_REG_HSYNC_IRQ_EN_Msk (0x2UL)            /*!< HSYNC_IRQ_EN (Bitfield-Mask: 0x01)                    */
#define LCDC_LCDC_INTERRUPT_REG_VSYNC_IRQ_EN_Pos (0UL)              /*!< VSYNC_IRQ_EN (Bit 0)                                  */
#define LCDC_LCDC_INTERRUPT_REG_VSYNC_IRQ_EN_Msk (0x1UL)            /*!< VSYNC_IRQ_EN (Bitfield-Mask: 0x01)                    */
/* ===============================================  LCDC_LAYER0_BASEADDR_REG  ================================================ */
#define LCDC_LCDC_LAYER0_BASEADDR_REG_L0_BASE_ADDR_Pos (0UL)        /*!< L0_BASE_ADDR (Bit 0)                                  */
#define LCDC_LCDC_LAYER0_BASEADDR_REG_L0_BASE_ADDR_Msk (0xffffffffUL) /*!< L0_BASE_ADDR (Bitfield-Mask: 0xffffffff)            */
/* =================================================  LCDC_LAYER0_MODE_REG  ================================================== */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_EN_Pos (31UL)                  /*!< L0_EN (Bit 31)                                        */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_EN_Msk (0x80000000UL)          /*!< L0_EN (Bitfield-Mask: 0x01)                           */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_FORCE_ALPHA_Pos (30UL)         /*!< L0_FORCE_ALPHA (Bit 30)                               */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_FORCE_ALPHA_Msk (0x40000000UL) /*!< L0_FORCE_ALPHA (Bitfield-Mask: 0x01)                  */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_PREMUL_IMG_ALPHA_Pos (28UL)    /*!< L0_PREMUL_IMG_ALPHA (Bit 28)                          */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_PREMUL_IMG_ALPHA_Msk (0x10000000UL) /*!< L0_PREMUL_IMG_ALPHA (Bitfield-Mask: 0x01)        */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_ASSERT_HLOCK_DMA_Pos (27UL)    /*!< L0_ASSERT_HLOCK_DMA (Bit 27)                          */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_ASSERT_HLOCK_DMA_Msk (0x8000000UL) /*!< L0_ASSERT_HLOCK_DMA (Bitfield-Mask: 0x01)         */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_ALPHA_Pos (16UL)               /*!< L0_ALPHA (Bit 16)                                     */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_ALPHA_Msk (0xff0000UL)         /*!< L0_ALPHA (Bitfield-Mask: 0xff)                        */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_DST_BLEND_Pos (12UL)           /*!< L0_DST_BLEND (Bit 12)                                 */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_DST_BLEND_Msk (0xf000UL)       /*!< L0_DST_BLEND (Bitfield-Mask: 0x0f)                    */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_SRC_BLEND_Pos (8UL)            /*!< L0_SRC_BLEND (Bit 8)                                  */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_SRC_BLEND_Msk (0xf00UL)        /*!< L0_SRC_BLEND (Bitfield-Mask: 0x0f)                    */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_COLOR_MODE_Pos (0UL)           /*!< L0_COLOR_MODE (Bit 0)                                 */
#define LCDC_LCDC_LAYER0_MODE_REG_L0_COLOR_MODE_Msk (0x1fUL)        /*!< L0_COLOR_MODE (Bitfield-Mask: 0x1f)                   */
/* =================================================  LCDC_LAYER0_RESXY_REG  ================================================= */
#define LCDC_LCDC_LAYER0_RESXY_REG_L0_RES_X_Pos (16UL)              /*!< L0_RES_X (Bit 16)                                     */
#define LCDC_LCDC_LAYER0_RESXY_REG_L0_RES_X_Msk (0xffff0000UL)      /*!< L0_RES_X (Bitfield-Mask: 0xffff)                      */
#define LCDC_LCDC_LAYER0_RESXY_REG_L0_RES_Y_Pos (0UL)               /*!< L0_RES_Y (Bit 0)                                      */
#define LCDC_LCDC_LAYER0_RESXY_REG_L0_RES_Y_Msk (0xffffUL)          /*!< L0_RES_Y (Bitfield-Mask: 0xffff)                      */
/* ================================================  LCDC_LAYER0_SIZEXY_REG  ================================================= */
#define LCDC_LCDC_LAYER0_SIZEXY_REG_L0_SIZE_X_Pos (16UL)            /*!< L0_SIZE_X (Bit 16)                                    */
#define LCDC_LCDC_LAYER0_SIZEXY_REG_L0_SIZE_X_Msk (0xffff0000UL)    /*!< L0_SIZE_X (Bitfield-Mask: 0xffff)                     */
#define LCDC_LCDC_LAYER0_SIZEXY_REG_L0_SIZE_Y_Pos (0UL)             /*!< L0_SIZE_Y (Bit 0)                                     */
#define LCDC_LCDC_LAYER0_SIZEXY_REG_L0_SIZE_Y_Msk (0xffffUL)        /*!< L0_SIZE_Y (Bitfield-Mask: 0xffff)                     */
