antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ================================================  LCDC_LAYER0_STARTXY_REG  ================================================ */
#define LCDC_LCDC_LAYER0_STARTXY_REG_L0_START_X_Pos (16UL)          /*!< L0_START_X (Bit 16)                                   */
#define LCDC_LCDC_LAYER0_STARTXY_REG_L0_START_X_Msk (0xffff0000UL)  /*!< L0_START_X (Bitfield-Mask: 0xffff)                    */
#define LCDC_LCDC_LAYER0_STARTXY_REG_L0_START_Y_Pos (0UL)           /*!< L0_START_Y (Bit 0)                                    */
#define LCDC_LCDC_LAYER0_STARTXY_REG_L0_START_Y_Msk (0xffffUL)      /*!< L0_START_Y (Bitfield-Mask: 0xffff)                    */
/* ================================================  LCDC_LAYER0_STRIDE_REG  ================================================= */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_DMA_PREFETCH_Pos (25UL)      /*!< L0_DMA_PREFETCH (Bit 25)                              */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_DMA_PREFETCH_Msk (0xe000000UL) /*!< L0_DMA_PREFETCH (Bitfield-Mask: 0x07)               */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_FIFO_THR_Pos (19UL)          /*!< L0_FIFO_THR (Bit 19)                                  */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_FIFO_THR_Msk (0x180000UL)    /*!< L0_FIFO_THR (Bitfield-Mask: 0x03)                     */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_NO_16BEAT_BURST_Pos (16UL)   /*!< L0_NO_16BEAT_BURST (Bit 16)                           */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_NO_16BEAT_BURST_Msk (0x10000UL) /*!< L0_NO_16BEAT_BURST (Bitfield-Mask: 0x01)           */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_STRIDE_Pos (0UL)             /*!< L0_STRIDE (Bit 0)                                     */
#define LCDC_LCDC_LAYER0_STRIDE_REG_L0_STRIDE_Msk (0xffffUL)        /*!< L0_STRIDE (Bitfield-Mask: 0xffff)                     */
/* ===============================================  LCDC_LAYER1_BASEADDR_REG  ================================================ */
#define LCDC_LCDC_LAYER1_BASEADDR_REG_L1_BASE_ADDR_Pos (0UL)        /*!< L1_BASE_ADDR (Bit 0)                                  */
#define LCDC_LCDC_LAYER1_BASEADDR_REG_L1_BASE_ADDR_Msk (0xffffffffUL) /*!< L1_BASE_ADDR (Bitfield-Mask: 0xffffffff)            */
/* =================================================  LCDC_LAYER1_MODE_REG  ================================================== */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_EN_Pos (31UL)                  /*!< L1_EN (Bit 31)                                        */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_EN_Msk (0x80000000UL)          /*!< L1_EN (Bitfield-Mask: 0x01)                           */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_FORCE_ALPHA_Pos (30UL)         /*!< L1_FORCE_ALPHA (Bit 30)                               */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_FORCE_ALPHA_Msk (0x40000000UL) /*!< L1_FORCE_ALPHA (Bitfield-Mask: 0x01)                  */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_PREMUL_IMG_ALPHA_Pos (28UL)    /*!< L1_PREMUL_IMG_ALPHA (Bit 28)                          */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_PREMUL_IMG_ALPHA_Msk (0x10000000UL) /*!< L1_PREMUL_IMG_ALPHA (Bitfield-Mask: 0x01)        */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_ASSERT_HLOCK_DMA_Pos (27UL)    /*!< L1_ASSERT_HLOCK_DMA (Bit 27)                          */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_ASSERT_HLOCK_DMA_Msk (0x8000000UL) /*!< L1_ASSERT_HLOCK_DMA (Bitfield-Mask: 0x01)         */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_ALPHA_Pos (16UL)               /*!< L1_ALPHA (Bit 16)                                     */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_ALPHA_Msk (0xff0000UL)         /*!< L1_ALPHA (Bitfield-Mask: 0xff)                        */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_DST_BLEND_Pos (12UL)           /*!< L1_DST_BLEND (Bit 12)                                 */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_DST_BLEND_Msk (0xf000UL)       /*!< L1_DST_BLEND (Bitfield-Mask: 0x0f)                    */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_SRC_BLEND_Pos (8UL)            /*!< L1_SRC_BLEND (Bit 8)                                  */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_SRC_BLEND_Msk (0xf00UL)        /*!< L1_SRC_BLEND (Bitfield-Mask: 0x0f)                    */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_COLOR_MODE_Pos (0UL)           /*!< L1_COLOR_MODE (Bit 0)                                 */
#define LCDC_LCDC_LAYER1_MODE_REG_L1_COLOR_MODE_Msk (0x1fUL)        /*!< L1_COLOR_MODE (Bitfield-Mask: 0x1f)                   */
/* =================================================  LCDC_LAYER1_RESXY_REG  ================================================= */
#define LCDC_LCDC_LAYER1_RESXY_REG_L1_RES_X_Pos (16UL)              /*!< L1_RES_X (Bit 16)                                     */
#define LCDC_LCDC_LAYER1_RESXY_REG_L1_RES_X_Msk (0xffff0000UL)      /*!< L1_RES_X (Bitfield-Mask: 0xffff)                      */
#define LCDC_LCDC_LAYER1_RESXY_REG_L1_RES_Y_Pos (0UL)               /*!< L1_RES_Y (Bit 0)                                      */
#define LCDC_LCDC_LAYER1_RESXY_REG_L1_RES_Y_Msk (0xffffUL)          /*!< L1_RES_Y (Bitfield-Mask: 0xffff)                      */
/* ================================================  LCDC_LAYER1_SIZEXY_REG  ================================================= */
#define LCDC_LCDC_LAYER1_SIZEXY_REG_L1_SIZE_X_Pos (16UL)            /*!< L1_SIZE_X (Bit 16)                                    */
#define LCDC_LCDC_LAYER1_SIZEXY_REG_L1_SIZE_X_Msk (0xffff0000UL)    /*!< L1_SIZE_X (Bitfield-Mask: 0xffff)                     */
#define LCDC_LCDC_LAYER1_SIZEXY_REG_L1_SIZE_Y_Pos (0UL)             /*!< L1_SIZE_Y (Bit 0)                                     */
#define LCDC_LCDC_LAYER1_SIZEXY_REG_L1_SIZE_Y_Msk (0xffffUL)        /*!< L1_SIZE_Y (Bitfield-Mask: 0xffff)                     */
/* ================================================  LCDC_LAYER1_STARTXY_REG  ================================================ */
#define LCDC_LCDC_LAYER1_STARTXY_REG_L1_START_X_Pos (16UL)          /*!< L1_START_X (Bit 16)                                   */
#define LCDC_LCDC_LAYER1_STARTXY_REG_L1_START_X_Msk (0xffff0000UL)  /*!< L1_START_X (Bitfield-Mask: 0xffff)                    */
#define LCDC_LCDC_LAYER1_STARTXY_REG_L1_START_Y_Pos (0UL)           /*!< L1_START_Y (Bit 0)                                    */
#define LCDC_LCDC_LAYER1_STARTXY_REG_L1_START_Y_Msk (0xffffUL)      /*!< L1_START_Y (Bitfield-Mask: 0xffff)                    */
/* ================================================  LCDC_LAYER1_STRIDE_REG  ================================================= */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_DMA_PREFETCH_Pos (25UL)      /*!< L1_DMA_PREFETCH (Bit 25)                              */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_DMA_PREFETCH_Msk (0xe000000UL) /*!< L1_DMA_PREFETCH (Bitfield-Mask: 0x07)               */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_FIFO_THR_Pos (19UL)          /*!< L1_FIFO_THR (Bit 19)                                  */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_FIFO_THR_Msk (0x180000UL)    /*!< L1_FIFO_THR (Bitfield-Mask: 0x03)                     */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_NO_16BEAT_BURST_Pos (16UL)   /*!< L1_NO_16BEAT_BURST (Bit 16)                           */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_NO_16BEAT_BURST_Msk (0x10000UL) /*!< L1_NO_16BEAT_BURST (Bitfield-Mask: 0x01)           */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_STRIDE_Pos (0UL)             /*!< L1_STRIDE (Bit 0)                                     */
#define LCDC_LCDC_LAYER1_STRIDE_REG_L1_STRIDE_Msk (0xffffUL)        /*!< L1_STRIDE (Bitfield-Mask: 0xffff)                     */
/* =====================================================  LCDC_MODE_REG  ===================================================== */
#define LCDC_LCDC_MODE_REG_MODE_EN_Pos    (31UL)                    /*!< MODE_EN (Bit 31)                                      */
#define LCDC_LCDC_MODE_REG_MODE_EN_Msk    (0x80000000UL)            /*!< MODE_EN (Bitfield-Mask: 0x01)                         */
#define LCDC_LCDC_MODE_REG_VSYNC_POL_Pos  (28UL)                    /*!< VSYNC_POL (Bit 28)                                    */
#define LCDC_LCDC_MODE_REG_VSYNC_POL_Msk  (0x10000000UL)            /*!< VSYNC_POL (Bitfield-Mask: 0x01)                       */
#define LCDC_LCDC_MODE_REG_HSYNC_POL_Pos  (27UL)                    /*!< HSYNC_POL (Bit 27)                                    */
#define LCDC_LCDC_MODE_REG_HSYNC_POL_Msk  (0x8000000UL)             /*!< HSYNC_POL (Bitfield-Mask: 0x01)                       */
#define LCDC_LCDC_MODE_REG_DE_POL_Pos     (26UL)                    /*!< DE_POL (Bit 26)                                       */
#define LCDC_LCDC_MODE_REG_DE_POL_Msk     (0x4000000UL)             /*!< DE_POL (Bitfield-Mask: 0x01)                          */
#define LCDC_LCDC_MODE_REG_DITH_MODE_Pos  (24UL)                    /*!< DITH_MODE (Bit 24)                                    */
#define LCDC_LCDC_MODE_REG_DITH_MODE_Msk  (0x3000000UL)             /*!< DITH_MODE (Bitfield-Mask: 0x03)                       */
#define LCDC_LCDC_MODE_REG_VSYNC_SCPL_Pos (23UL)                    /*!< VSYNC_SCPL (Bit 23)                                   */
#define LCDC_LCDC_MODE_REG_VSYNC_SCPL_Msk (0x800000UL)              /*!< VSYNC_SCPL (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_MODE_REG_PIXCLKOUT_POL_Pos (22UL)                 /*!< PIXCLKOUT_POL (Bit 22)                                */
#define LCDC_LCDC_MODE_REG_PIXCLKOUT_POL_Msk (0x400000UL)           /*!< PIXCLKOUT_POL (Bitfield-Mask: 0x01)                   */
#define LCDC_LCDC_MODE_REG_GLOBAL_GAMMA_EN_Pos (20UL)               /*!< GLOBAL_GAMMA_EN (Bit 20)                              */
#define LCDC_LCDC_MODE_REG_GLOBAL_GAMMA_EN_Msk (0x100000UL)         /*!< GLOBAL_GAMMA_EN (Bitfield-Mask: 0x01)                 */
#define LCDC_LCDC_MODE_REG_FORCE_BLANK_Pos (19UL)                   /*!< FORCE_BLANK (Bit 19)                                  */
#define LCDC_LCDC_MODE_REG_FORCE_BLANK_Msk (0x80000UL)              /*!< FORCE_BLANK (Bitfield-Mask: 0x01)                     */
#define LCDC_LCDC_MODE_REG_UNDERRUN_PREVENTION_EN_Pos (18UL)        /*!< UNDERRUN_PREVENTION_EN (Bit 18)                       */
#define LCDC_LCDC_MODE_REG_UNDERRUN_PREVENTION_EN_Msk (0x40000UL)   /*!< UNDERRUN_PREVENTION_EN (Bitfield-Mask: 0x01)          */
#define LCDC_LCDC_MODE_REG_SFRAME_UPD_Pos (17UL)                    /*!< SFRAME_UPD (Bit 17)                                   */
#define LCDC_LCDC_MODE_REG_SFRAME_UPD_Msk (0x20000UL)               /*!< SFRAME_UPD (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_MODE_REG_DPI2_CONFIG_Pos (12UL)                   /*!< DPI2_CONFIG (Bit 12)                                  */
#define LCDC_LCDC_MODE_REG_DPI2_CONFIG_Msk (0x7000UL)               /*!< DPI2_CONFIG (Bitfield-Mask: 0x07)                     */
#define LCDC_LCDC_MODE_REG_PIXCLKOUT_SEL_Pos (11UL)                 /*!< PIXCLKOUT_SEL (Bit 11)                                */
#define LCDC_LCDC_MODE_REG_PIXCLKOUT_SEL_Msk (0x800UL)              /*!< PIXCLKOUT_SEL (Bitfield-Mask: 0x01)                   */
#define LCDC_LCDC_MODE_REG_OUT_MODE_Pos   (5UL)                     /*!< OUT_MODE (Bit 5)                                      */
#define LCDC_LCDC_MODE_REG_OUT_MODE_Msk   (0x1e0UL)                 /*!< OUT_MODE (Bitfield-Mask: 0x0f)                        */
#define LCDC_LCDC_MODE_REG_DBIB_OFF_Pos   (4UL)                     /*!< DBIB_OFF (Bit 4)                                      */
#define LCDC_LCDC_MODE_REG_DBIB_OFF_Msk   (0x10UL)                  /*!< DBIB_OFF (Bitfield-Mask: 0x01)                        */
#define LCDC_LCDC_MODE_REG_FORM_OFF_Pos   (3UL)                     /*!< FORM_OFF (Bit 3)                                      */
#define LCDC_LCDC_MODE_REG_FORM_OFF_Msk   (0x8UL)                   /*!< FORM_OFF (Bitfield-Mask: 0x01)                        */
#define LCDC_LCDC_MODE_REG_DSCAN_Pos      (1UL)                     /*!< DSCAN (Bit 1)                                         */
#define LCDC_LCDC_MODE_REG_DSCAN_Msk      (0x2UL)                   /*!< DSCAN (Bitfield-Mask: 0x01)                           */
#define LCDC_LCDC_MODE_REG_TMODE_Pos      (0UL)                     /*!< TMODE (Bit 0)                                         */
#define LCDC_LCDC_MODE_REG_TMODE_Msk      (0x1UL)                   /*!< TMODE (Bitfield-Mask: 0x01)                           */
/* ===================================================  LCDC_PALETTE_255  ==================================================== */
#define LCDC_LCDC_PALETTE_255_PALLETE_R_Pos (16UL)                  /*!< PALLETE_R (Bit 16)                                    */
#define LCDC_LCDC_PALETTE_255_PALLETE_R_Msk (0xff0000UL)            /*!< PALLETE_R (Bitfield-Mask: 0xff)                       */
#define LCDC_LCDC_PALETTE_255_PALLETE_G_Pos (8UL)                   /*!< PALLETE_G (Bit 8)                                     */
#define LCDC_LCDC_PALETTE_255_PALLETE_G_Msk (0xff00UL)              /*!< PALLETE_G (Bitfield-Mask: 0xff)                       */
#define LCDC_LCDC_PALETTE_255_PALLETE_B_Pos (0UL)                   /*!< PALLETE_B (Bit 0)                                     */
#define LCDC_LCDC_PALETTE_255_PALLETE_B_Msk (0xffUL)                /*!< PALLETE_B (Bitfield-Mask: 0xff)                       */
/* ===================================================  LCDC_PALETTE_BASE  =================================================== */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_R_Pos (16UL)                 /*!< PALLETE_R (Bit 16)                                    */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_R_Msk (0xff0000UL)           /*!< PALLETE_R (Bitfield-Mask: 0xff)                       */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_G_Pos (8UL)                  /*!< PALLETE_G (Bit 8)                                     */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_G_Msk (0xff00UL)             /*!< PALLETE_G (Bitfield-Mask: 0xff)                       */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_B_Pos (0UL)                  /*!< PALLETE_B (Bit 0)                                     */
#define LCDC_LCDC_PALETTE_BASE_PALLETE_B_Msk (0xffUL)               /*!< PALLETE_B (Bitfield-Mask: 0xff)                       */
/* ====================================================  LCDC_RESXY_REG  ===================================================== */
#define LCDC_LCDC_RESXY_REG_RES_X_Pos     (16UL)                    /*!< RES_X (Bit 16)                                        */
#define LCDC_LCDC_RESXY_REG_RES_X_Msk     (0xffff0000UL)            /*!< RES_X (Bitfield-Mask: 0xffff)                         */
#define LCDC_LCDC_RESXY_REG_RES_Y_Pos     (0UL)                     /*!< RES_Y (Bit 0)                                         */
#define LCDC_LCDC_RESXY_REG_RES_Y_Msk     (0xffffUL)                /*!< RES_Y (Bitfield-Mask: 0xffff)                         */
/* ===================================================  LCDC_STARTXY_REG  ==================================================== */
#define LCDC_LCDC_STARTXY_REG_START_X_Pos (16UL)                    /*!< START_X (Bit 16)                                      */
#define LCDC_LCDC_STARTXY_REG_START_X_Msk (0xffff0000UL)            /*!< START_X (Bitfield-Mask: 0xffff)                       */
#define LCDC_LCDC_STARTXY_REG_START_Y_Pos (0UL)                     /*!< START_Y (Bit 0)                                       */
#define LCDC_LCDC_STARTXY_REG_START_Y_Msk (0xffffUL)                /*!< START_Y (Bitfield-Mask: 0xffff)                       */
/* ====================================================  LCDC_STATUS_REG  ==================================================== */
#define LCDC_LCDC_STATUS_REG_SPI_RD_WR_OP_Pos (16UL)                /*!< SPI_RD_WR_OP (Bit 16)                                 */
#define LCDC_LCDC_STATUS_REG_SPI_RD_WR_OP_Msk (0x10000UL)           /*!< SPI_RD_WR_OP (Bitfield-Mask: 0x01)                    */
#define LCDC_LCDC_STATUS_REG_DBIB_CMD_FIFO_FULL_Pos (15UL)          /*!< DBIB_CMD_FIFO_FULL (Bit 15)                           */
#define LCDC_LCDC_STATUS_REG_DBIB_CMD_FIFO_FULL_Msk (0x8000UL)      /*!< DBIB_CMD_FIFO_FULL (Bitfield-Mask: 0x01)              */
#define LCDC_LCDC_STATUS_REG_DBI_SPI_CS_Pos (14UL)                  /*!< DBI_SPI_CS (Bit 14)                                   */
#define LCDC_LCDC_STATUS_REG_DBI_SPI_CS_Msk (0x4000UL)              /*!< DBI_SPI_CS (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_STATUS_REG_FRAME_END_Pos (13UL)                   /*!< FRAME_END (Bit 13)                                    */
#define LCDC_LCDC_STATUS_REG_FRAME_END_Msk (0x2000UL)               /*!< FRAME_END (Bitfield-Mask: 0x01)                       */
#define LCDC_LCDC_STATUS_REG_DBIB_OUT_TRANS_PENDING_Pos (12UL)      /*!< DBIB_OUT_TRANS_PENDING (Bit 12)                       */
#define LCDC_LCDC_STATUS_REG_DBIB_OUT_TRANS_PENDING_Msk (0x1000UL)  /*!< DBIB_OUT_TRANS_PENDING (Bitfield-Mask: 0x01)          */
#define LCDC_LCDC_STATUS_REG_DBIB_CMD_PENDING_Pos (11UL)            /*!< DBIB_CMD_PENDING (Bit 11)                             */
#define LCDC_LCDC_STATUS_REG_DBIB_CMD_PENDING_Msk (0x800UL)         /*!< DBIB_CMD_PENDING (Bitfield-Mask: 0x01)                */
#define LCDC_LCDC_STATUS_REG_DBIB_DATA_PENDING_Pos (10UL)           /*!< DBIB_DATA_PENDING (Bit 10)                            */
#define LCDC_LCDC_STATUS_REG_DBIB_DATA_PENDING_Msk (0x400UL)        /*!< DBIB_DATA_PENDING (Bitfield-Mask: 0x01)               */
#define LCDC_LCDC_STATUS_REG_DBIB_TE_Pos  (8UL)                     /*!< DBIB_TE (Bit 8)                                       */
#define LCDC_LCDC_STATUS_REG_DBIB_TE_Msk  (0x100UL)                 /*!< DBIB_TE (Bitfield-Mask: 0x01)                         */
#define LCDC_LCDC_STATUS_REG_STICKY_UNDERFLOW_Pos (7UL)             /*!< STICKY_UNDERFLOW (Bit 7)                              */
#define LCDC_LCDC_STATUS_REG_STICKY_UNDERFLOW_Msk (0x80UL)          /*!< STICKY_UNDERFLOW (Bitfield-Mask: 0x01)                */
#define LCDC_LCDC_STATUS_REG_UNDERFLOW_Pos (6UL)                    /*!< UNDERFLOW (Bit 6)                                     */
#define LCDC_LCDC_STATUS_REG_UNDERFLOW_Msk (0x40UL)                 /*!< UNDERFLOW (Bitfield-Mask: 0x01)                       */
#define LCDC_LCDC_STATUS_REG_LAST_ROW_Pos (5UL)                     /*!< LAST_ROW (Bit 5)                                      */
#define LCDC_LCDC_STATUS_REG_LAST_ROW_Msk (0x20UL)                  /*!< LAST_ROW (Bitfield-Mask: 0x01)                        */
#define LCDC_LCDC_STATUS_REG_STAT_CSYNC_Pos (4UL)                   /*!< STAT_CSYNC (Bit 4)                                    */
#define LCDC_LCDC_STATUS_REG_STAT_CSYNC_Msk (0x10UL)                /*!< STAT_CSYNC (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_STATUS_REG_STAT_VSYNC_Pos (3UL)                   /*!< STAT_VSYNC (Bit 3)                                    */
#define LCDC_LCDC_STATUS_REG_STAT_VSYNC_Msk (0x8UL)                 /*!< STAT_VSYNC (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_STATUS_REG_STAT_HSYNC_Pos (2UL)                   /*!< STAT_HSYNC (Bit 2)                                    */
#define LCDC_LCDC_STATUS_REG_STAT_HSYNC_Msk (0x4UL)                 /*!< STAT_HSYNC (Bitfield-Mask: 0x01)                      */
#define LCDC_LCDC_STATUS_REG_STAT_DE_Pos  (1UL)                     /*!< STAT_DE (Bit 1)                                       */
#define LCDC_LCDC_STATUS_REG_STAT_DE_Msk  (0x2UL)                   /*!< STAT_DE (Bitfield-Mask: 0x01)                         */
#define LCDC_LCDC_STATUS_REG_STAT_ACTIVE_Pos (0UL)                  /*!< STAT_ACTIVE (Bit 0)                                   */
#define LCDC_LCDC_STATUS_REG_STAT_ACTIVE_Msk (0x1UL)                /*!< STAT_ACTIVE (Bitfield-Mask: 0x01)                     */


/* =========================================================================================================================== */
/* ================                                          MEMCTRL                                          ================ */
/* =========================================================================================================================== */

