antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ====================================================  BUSY_RESET_REG  ===================================================== */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SDADC_Pos (30UL)                /*!< BUSY_SDADC (Bit 30)                                   */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SDADC_Msk (0xc0000000UL)        /*!< BUSY_SDADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_GPADC_Pos (28UL)                /*!< BUSY_GPADC (Bit 28)                                   */
#define MEMCTRL_BUSY_RESET_REG_BUSY_GPADC_Msk (0x30000000UL)        /*!< BUSY_GPADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC2_Pos (26UL)                 /*!< BUSY_SRC2 (Bit 26)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC2_Msk (0xc000000UL)          /*!< BUSY_SRC2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC_Pos (24UL)                  /*!< BUSY_SRC (Bit 24)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SRC_Msk (0x3000000UL)           /*!< BUSY_SRC (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PDM_Pos (22UL)                  /*!< BUSY_PDM (Bit 22)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PDM_Msk (0xc00000UL)            /*!< BUSY_PDM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PCM_Pos (20UL)                  /*!< BUSY_PCM (Bit 20)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_PCM_Msk (0x300000UL)            /*!< BUSY_PCM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I3C_Pos (18UL)                  /*!< BUSY_I3C (Bit 18)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I3C_Msk (0xc0000UL)             /*!< BUSY_I3C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C3_Pos (16UL)                 /*!< BUSY_I2C3 (Bit 16)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C3_Msk (0x30000UL)            /*!< BUSY_I2C3 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C2_Pos (14UL)                 /*!< BUSY_I2C2 (Bit 14)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C2_Msk (0xc000UL)             /*!< BUSY_I2C2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C_Pos (12UL)                  /*!< BUSY_I2C (Bit 12)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_I2C_Msk (0x3000UL)              /*!< BUSY_I2C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI3_Pos (10UL)                 /*!< BUSY_SPI3 (Bit 10)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI3_Msk (0xc00UL)              /*!< BUSY_SPI3 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI2_Pos (8UL)                  /*!< BUSY_SPI2 (Bit 8)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI2_Msk (0x300UL)              /*!< BUSY_SPI2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI_Pos (6UL)                   /*!< BUSY_SPI (Bit 6)                                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_SPI_Msk (0xc0UL)                /*!< BUSY_SPI (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART3_Pos (4UL)                 /*!< BUSY_UART3 (Bit 4)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART3_Msk (0x30UL)              /*!< BUSY_UART3 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART2_Pos (2UL)                 /*!< BUSY_UART2 (Bit 2)                                    */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART2_Msk (0xcUL)               /*!< BUSY_UART2 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART_Pos (0UL)                  /*!< BUSY_UART (Bit 0)                                     */
#define MEMCTRL_BUSY_RESET_REG_BUSY_UART_Msk (0x3UL)                /*!< BUSY_UART (Bitfield-Mask: 0x03)                       */
/* ====================================================  BUSY_RESET_REG2  ==================================================== */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER6_Pos (10UL)              /*!< BUSY_TIMER6 (Bit 10)                                  */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER6_Msk (0xc00UL)           /*!< BUSY_TIMER6 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER5_Pos (8UL)               /*!< BUSY_TIMER5 (Bit 8)                                   */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER5_Msk (0x300UL)           /*!< BUSY_TIMER5 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER4_Pos (6UL)               /*!< BUSY_TIMER4 (Bit 6)                                   */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER4_Msk (0xc0UL)            /*!< BUSY_TIMER4 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER3_Pos (4UL)               /*!< BUSY_TIMER3 (Bit 4)                                   */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER3_Msk (0x30UL)            /*!< BUSY_TIMER3 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER2_Pos (2UL)               /*!< BUSY_TIMER2 (Bit 2)                                   */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER2_Msk (0xcUL)             /*!< BUSY_TIMER2 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER_Pos (0UL)                /*!< BUSY_TIMER (Bit 0)                                    */
#define MEMCTRL_BUSY_RESET_REG2_BUSY_TIMER_Msk (0x3UL)              /*!< BUSY_TIMER (Bitfield-Mask: 0x03)                      */
/* =====================================================  BUSY_SET_REG  ====================================================== */
#define MEMCTRL_BUSY_SET_REG_BUSY_SDADC_Pos (30UL)                  /*!< BUSY_SDADC (Bit 30)                                   */
#define MEMCTRL_BUSY_SET_REG_BUSY_SDADC_Msk (0xc0000000UL)          /*!< BUSY_SDADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_GPADC_Pos (28UL)                  /*!< BUSY_GPADC (Bit 28)                                   */
#define MEMCTRL_BUSY_SET_REG_BUSY_GPADC_Msk (0x30000000UL)          /*!< BUSY_GPADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC2_Pos (26UL)                   /*!< BUSY_SRC2 (Bit 26)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC2_Msk (0xc000000UL)            /*!< BUSY_SRC2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC_Pos (24UL)                    /*!< BUSY_SRC (Bit 24)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_SRC_Msk (0x3000000UL)             /*!< BUSY_SRC (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_PDM_Pos (22UL)                    /*!< BUSY_PDM (Bit 22)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_PDM_Msk (0xc00000UL)              /*!< BUSY_PDM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_PCM_Pos (20UL)                    /*!< BUSY_PCM (Bit 20)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_PCM_Msk (0x300000UL)              /*!< BUSY_PCM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_I3C_Pos (18UL)                    /*!< BUSY_I3C (Bit 18)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_I3C_Msk (0xc0000UL)               /*!< BUSY_I3C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C3_Pos (16UL)                   /*!< BUSY_I2C3 (Bit 16)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C3_Msk (0x30000UL)              /*!< BUSY_I2C3 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C2_Pos (14UL)                   /*!< BUSY_I2C2 (Bit 14)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C2_Msk (0xc000UL)               /*!< BUSY_I2C2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C_Pos (12UL)                    /*!< BUSY_I2C (Bit 12)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_I2C_Msk (0x3000UL)                /*!< BUSY_I2C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI3_Pos (10UL)                   /*!< BUSY_SPI3 (Bit 10)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI3_Msk (0xc00UL)                /*!< BUSY_SPI3 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI2_Pos (8UL)                    /*!< BUSY_SPI2 (Bit 8)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI2_Msk (0x300UL)                /*!< BUSY_SPI2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI_Pos (6UL)                     /*!< BUSY_SPI (Bit 6)                                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_SPI_Msk (0xc0UL)                  /*!< BUSY_SPI (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART3_Pos (4UL)                   /*!< BUSY_UART3 (Bit 4)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART3_Msk (0x30UL)                /*!< BUSY_UART3 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART2_Pos (2UL)                   /*!< BUSY_UART2 (Bit 2)                                    */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART2_Msk (0xcUL)                 /*!< BUSY_UART2 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART_Pos (0UL)                    /*!< BUSY_UART (Bit 0)                                     */
#define MEMCTRL_BUSY_SET_REG_BUSY_UART_Msk (0x3UL)                  /*!< BUSY_UART (Bitfield-Mask: 0x03)                       */
/* =====================================================  BUSY_SET_REG2  ===================================================== */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER6_Pos (10UL)                /*!< BUSY_TIMER6 (Bit 10)                                  */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER6_Msk (0xc00UL)             /*!< BUSY_TIMER6 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER5_Pos (8UL)                 /*!< BUSY_TIMER5 (Bit 8)                                   */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER5_Msk (0x300UL)             /*!< BUSY_TIMER5 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER4_Pos (6UL)                 /*!< BUSY_TIMER4 (Bit 6)                                   */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER4_Msk (0xc0UL)              /*!< BUSY_TIMER4 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER3_Pos (4UL)                 /*!< BUSY_TIMER3 (Bit 4)                                   */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER3_Msk (0x30UL)              /*!< BUSY_TIMER3 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER2_Pos (2UL)                 /*!< BUSY_TIMER2 (Bit 2)                                   */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER2_Msk (0xcUL)               /*!< BUSY_TIMER2 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER_Pos (0UL)                  /*!< BUSY_TIMER (Bit 0)                                    */
#define MEMCTRL_BUSY_SET_REG2_BUSY_TIMER_Msk (0x3UL)                /*!< BUSY_TIMER (Bitfield-Mask: 0x03)                      */
/* =====================================================  BUSY_STAT_REG  ===================================================== */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SDADC_Pos (30UL)                 /*!< BUSY_SDADC (Bit 30)                                   */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SDADC_Msk (0xc0000000UL)         /*!< BUSY_SDADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_GPADC_Pos (28UL)                 /*!< BUSY_GPADC (Bit 28)                                   */
#define MEMCTRL_BUSY_STAT_REG_BUSY_GPADC_Msk (0x30000000UL)         /*!< BUSY_GPADC (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC2_Pos (26UL)                  /*!< BUSY_SRC2 (Bit 26)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC2_Msk (0xc000000UL)           /*!< BUSY_SRC2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC_Pos (24UL)                   /*!< BUSY_SRC (Bit 24)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SRC_Msk (0x3000000UL)            /*!< BUSY_SRC (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PDM_Pos (22UL)                   /*!< BUSY_PDM (Bit 22)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PDM_Msk (0xc00000UL)             /*!< BUSY_PDM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PCM_Pos (20UL)                   /*!< BUSY_PCM (Bit 20)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_PCM_Msk (0x300000UL)             /*!< BUSY_PCM (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I3C_Pos (18UL)                   /*!< BUSY_I3C (Bit 18)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I3C_Msk (0xc0000UL)              /*!< BUSY_I3C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C3_Pos (16UL)                  /*!< BUSY_I2C3 (Bit 16)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C3_Msk (0x30000UL)             /*!< BUSY_I2C3 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C2_Pos (14UL)                  /*!< BUSY_I2C2 (Bit 14)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C2_Msk (0xc000UL)              /*!< BUSY_I2C2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C_Pos (12UL)                   /*!< BUSY_I2C (Bit 12)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_I2C_Msk (0x3000UL)               /*!< BUSY_I2C (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI3_Pos (10UL)                  /*!< BUSY_SPI3 (Bit 10)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI3_Msk (0xc00UL)               /*!< BUSY_SPI3 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI2_Pos (8UL)                   /*!< BUSY_SPI2 (Bit 8)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI2_Msk (0x300UL)               /*!< BUSY_SPI2 (Bitfield-Mask: 0x03)                       */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI_Pos (6UL)                    /*!< BUSY_SPI (Bit 6)                                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_SPI_Msk (0xc0UL)                 /*!< BUSY_SPI (Bitfield-Mask: 0x03)                        */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART3_Pos (4UL)                  /*!< BUSY_UART3 (Bit 4)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART3_Msk (0x30UL)               /*!< BUSY_UART3 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART2_Pos (2UL)                  /*!< BUSY_UART2 (Bit 2)                                    */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART2_Msk (0xcUL)                /*!< BUSY_UART2 (Bitfield-Mask: 0x03)                      */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART_Pos (0UL)                   /*!< BUSY_UART (Bit 0)                                     */
#define MEMCTRL_BUSY_STAT_REG_BUSY_UART_Msk (0x3UL)                 /*!< BUSY_UART (Bitfield-Mask: 0x03)                       */
/* ====================================================  BUSY_STAT_REG2  ===================================================== */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER6_Pos (10UL)               /*!< BUSY_TIMER6 (Bit 10)                                  */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER6_Msk (0xc00UL)            /*!< BUSY_TIMER6 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER5_Pos (8UL)                /*!< BUSY_TIMER5 (Bit 8)                                   */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER5_Msk (0x300UL)            /*!< BUSY_TIMER5 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER4_Pos (6UL)                /*!< BUSY_TIMER4 (Bit 6)                                   */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER4_Msk (0xc0UL)             /*!< BUSY_TIMER4 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER3_Pos (4UL)                /*!< BUSY_TIMER3 (Bit 4)                                   */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER3_Msk (0x30UL)             /*!< BUSY_TIMER3 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER2_Pos (2UL)                /*!< BUSY_TIMER2 (Bit 2)                                   */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER2_Msk (0xcUL)              /*!< BUSY_TIMER2 (Bitfield-Mask: 0x03)                     */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER_Pos (0UL)                 /*!< BUSY_TIMER (Bit 0)                                    */
#define MEMCTRL_BUSY_STAT_REG2_BUSY_TIMER_Msk (0x3UL)               /*!< BUSY_TIMER (Bitfield-Mask: 0x03)                      */
/* ====================================================  CMAC_STATUS_REG  ==================================================== */
#define MEMCTRL_CMAC_STATUS_REG_CMI_CLEAR_READY_Pos (13UL)          /*!< CMI_CLEAR_READY (Bit 13)                              */
#define MEMCTRL_CMAC_STATUS_REG_CMI_CLEAR_READY_Msk (0x2000UL)      /*!< CMI_CLEAR_READY (Bitfield-Mask: 0x01)                 */
#define MEMCTRL_CMAC_STATUS_REG_CMI_NOT_READY_Pos (12UL)            /*!< CMI_NOT_READY (Bit 12)                                */
#define MEMCTRL_CMAC_STATUS_REG_CMI_NOT_READY_Msk (0x1000UL)        /*!< CMI_NOT_READY (Bitfield-Mask: 0x01)                   */
#define MEMCTRL_CMAC_STATUS_REG_AHB_RFMON_WR_BUFF_CNT_Pos (8UL)     /*!< AHB_RFMON_WR_BUFF_CNT (Bit 8)                         */
#define MEMCTRL_CMAC_STATUS_REG_AHB_RFMON_WR_BUFF_CNT_Msk (0xf00UL) /*!< AHB_RFMON_WR_BUFF_CNT (Bitfield-Mask: 0x0f)           */
#define MEMCTRL_CMAC_STATUS_REG_AHB_SYS2CMAC_WR_BUFF_CNT_Pos (4UL)  /*!< AHB_SYS2CMAC_WR_BUFF_CNT (Bit 4)                      */
#define MEMCTRL_CMAC_STATUS_REG_AHB_SYS2CMAC_WR_BUFF_CNT_Msk (0xf0UL) /*!< AHB_SYS2CMAC_WR_BUFF_CNT (Bitfield-Mask: 0x0f)      */
#define MEMCTRL_CMAC_STATUS_REG_AHB_RFMON_CLR_WR_BUFF_Pos (3UL)     /*!< AHB_RFMON_CLR_WR_BUFF (Bit 3)                         */
#define MEMCTRL_CMAC_STATUS_REG_AHB_RFMON_CLR_WR_BUFF_Msk (0x8UL)   /*!< AHB_RFMON_CLR_WR_BUFF (Bitfield-Mask: 0x01)           */
#define MEMCTRL_CMAC_STATUS_REG_AHB_SYS2CMAC_CLR_WR_BUFF_Pos (2UL)  /*!< AHB_SYS2CMAC_CLR_WR_BUFF (Bit 2)                      */
#define MEMCTRL_CMAC_STATUS_REG_AHB_SYS2CMAC_CLR_WR_BUFF_Msk (0x4UL) /*!< AHB_SYS2CMAC_CLR_WR_BUFF (Bitfield-Mask: 0x01)       */
#define MEMCTRL_CMAC_STATUS_REG_AHB_RFMON_WRITE_BUFF_Pos (1UL)      /*!< AHB_RFMON_WRITE_BUFF (Bit 1)                          */
#define MEMCTRL_CMAC_STATUS_REG_AHB_RFMON_WRITE_BUFF_Msk (0x2UL)    /*!< AHB_RFMON_WRITE_BUFF (Bitfield-Mask: 0x01)            */
#define MEMCTRL_CMAC_STATUS_REG_AHB_SYS2CMAC_WRITE_BUFF_Pos (0UL)   /*!< AHB_SYS2CMAC_WRITE_BUFF (Bit 0)                       */
#define MEMCTRL_CMAC_STATUS_REG_AHB_SYS2CMAC_WRITE_BUFF_Msk (0x1UL) /*!< AHB_SYS2CMAC_WRITE_BUFF (Bitfield-Mask: 0x01)         */
/* ===================================================  CMI_CODE_BASE_REG  =================================================== */
#define MEMCTRL_CMI_CODE_BASE_REG_CMI_CODE_BASE_ADDR_Pos (0UL)      /*!< CMI_CODE_BASE_ADDR (Bit 0)                            */
#define MEMCTRL_CMI_CODE_BASE_REG_CMI_CODE_BASE_ADDR_Msk (0xfffffUL) /*!< CMI_CODE_BASE_ADDR (Bitfield-Mask: 0xfffff)          */
/* ===================================================  CMI_DATA_BASE_REG  =================================================== */
#define MEMCTRL_CMI_DATA_BASE_REG_CMI_DATA_BASE_ADDR_Pos (2UL)      /*!< CMI_DATA_BASE_ADDR (Bit 2)                            */
#define MEMCTRL_CMI_DATA_BASE_REG_CMI_DATA_BASE_ADDR_Msk (0xffffcUL) /*!< CMI_DATA_BASE_ADDR (Bitfield-Mask: 0x3ffff)          */
/* ======================================================  CMI_END_REG  ====================================================== */
#define MEMCTRL_CMI_END_REG_CMI_END_ADDR_Pos (10UL)                 /*!< CMI_END_ADDR (Bit 10)                                 */
#define MEMCTRL_CMI_END_REG_CMI_END_ADDR_Msk (0xffc00UL)            /*!< CMI_END_ADDR (Bitfield-Mask: 0x3ff)                   */
/* ==================================================  CMI_SHARED_BASE_REG  ================================================== */
#define MEMCTRL_CMI_SHARED_BASE_REG_CMI_SHARED_BASE_ADDR_Pos (10UL) /*!< CMI_SHARED_BASE_ADDR (Bit 10)                         */
#define MEMCTRL_CMI_SHARED_BASE_REG_CMI_SHARED_BASE_ADDR_Msk (0xffc00UL) /*!< CMI_SHARED_BASE_ADDR (Bitfield-Mask: 0x3ff)      */
/* ==================================================  MEM_PRIO_ARB1_4_REG  ================================================== */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB4_AHB_DMA_PRIO_Pos (28UL)    /*!< ARB4_AHB_DMA_PRIO (Bit 28)                            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB4_AHB_DMA_PRIO_Msk (0x30000000UL) /*!< ARB4_AHB_DMA_PRIO (Bitfield-Mask: 0x03)          */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB4_AHB_CPUS_PRIO_Pos (26UL)   /*!< ARB4_AHB_CPUS_PRIO (Bit 26)                           */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB4_AHB_CPUS_PRIO_Msk (0xc000000UL) /*!< ARB4_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)         */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB3_AHB_DMA_PRIO_Pos (20UL)    /*!< ARB3_AHB_DMA_PRIO (Bit 20)                            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB3_AHB_DMA_PRIO_Msk (0x300000UL) /*!< ARB3_AHB_DMA_PRIO (Bitfield-Mask: 0x03)            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB3_AHB_CPUS_PRIO_Pos (18UL)   /*!< ARB3_AHB_CPUS_PRIO (Bit 18)                           */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB3_AHB_CPUS_PRIO_Msk (0xc0000UL) /*!< ARB3_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)           */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB3_AHB_CPUC_PRIO_Pos (16UL)   /*!< ARB3_AHB_CPUC_PRIO (Bit 16)                           */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB3_AHB_CPUC_PRIO_Msk (0x30000UL) /*!< ARB3_AHB_CPUC_PRIO (Bitfield-Mask: 0x03)           */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_SNC_PRIO_Pos (14UL)        /*!< ARB2_SNC_PRIO (Bit 14)                                */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_SNC_PRIO_Msk (0xc000UL)    /*!< ARB2_SNC_PRIO (Bitfield-Mask: 0x03)                   */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_AHB_DMA_PRIO_Pos (12UL)    /*!< ARB2_AHB_DMA_PRIO (Bit 12)                            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_AHB_DMA_PRIO_Msk (0x3000UL) /*!< ARB2_AHB_DMA_PRIO (Bitfield-Mask: 0x03)              */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_AHB_CPUS_PRIO_Pos (10UL)   /*!< ARB2_AHB_CPUS_PRIO (Bit 10)                           */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_AHB_CPUS_PRIO_Msk (0xc00UL) /*!< ARB2_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)             */
