antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_AHB_CPUC_PRIO_Pos (8UL)    /*!< ARB2_AHB_CPUC_PRIO (Bit 8)                            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB2_AHB_CPUC_PRIO_Msk (0x300UL) /*!< ARB2_AHB_CPUC_PRIO (Bitfield-Mask: 0x03)             */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_SNC_PRIO_Pos (6UL)         /*!< ARB1_SNC_PRIO (Bit 6)                                 */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_SNC_PRIO_Msk (0xc0UL)      /*!< ARB1_SNC_PRIO (Bitfield-Mask: 0x03)                   */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_AHB_DMA_PRIO_Pos (4UL)     /*!< ARB1_AHB_DMA_PRIO (Bit 4)                             */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_AHB_DMA_PRIO_Msk (0x30UL)  /*!< ARB1_AHB_DMA_PRIO (Bitfield-Mask: 0x03)               */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_AHB_CPUS_PRIO_Pos (2UL)    /*!< ARB1_AHB_CPUS_PRIO (Bit 2)                            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_AHB_CPUS_PRIO_Msk (0xcUL)  /*!< ARB1_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)              */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_AHB_CPUC_PRIO_Pos (0UL)    /*!< ARB1_AHB_CPUC_PRIO (Bit 0)                            */
#define MEMCTRL_MEM_PRIO_ARB1_4_REG_ARB1_AHB_CPUC_PRIO_Msk (0x3UL)  /*!< ARB1_AHB_CPUC_PRIO (Bitfield-Mask: 0x03)              */
/* ==================================================  MEM_PRIO_ARB5_8_REG  ================================================== */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB8_SNC_PRIO_Pos (30UL)        /*!< ARB8_SNC_PRIO (Bit 30)                                */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB8_SNC_PRIO_Msk (0xc0000000UL) /*!< ARB8_SNC_PRIO (Bitfield-Mask: 0x03)                  */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB8_AHB_DMA_PRIO_Pos (28UL)    /*!< ARB8_AHB_DMA_PRIO (Bit 28)                            */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB8_AHB_DMA_PRIO_Msk (0x30000000UL) /*!< ARB8_AHB_DMA_PRIO (Bitfield-Mask: 0x03)          */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB8_AHB_CPUS_PRIO_Pos (26UL)   /*!< ARB8_AHB_CPUS_PRIO (Bit 26)                           */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB8_AHB_CPUS_PRIO_Msk (0xc000000UL) /*!< ARB8_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)         */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB7_AHB_DMA_PRIO_Pos (20UL)    /*!< ARB7_AHB_DMA_PRIO (Bit 20)                            */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB7_AHB_DMA_PRIO_Msk (0x300000UL) /*!< ARB7_AHB_DMA_PRIO (Bitfield-Mask: 0x03)            */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB7_AHB_CPUS_PRIO_Pos (18UL)   /*!< ARB7_AHB_CPUS_PRIO (Bit 18)                           */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB7_AHB_CPUS_PRIO_Msk (0xc0000UL) /*!< ARB7_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)           */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB6_AHB_DMA_PRIO_Pos (12UL)    /*!< ARB6_AHB_DMA_PRIO (Bit 12)                            */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB6_AHB_DMA_PRIO_Msk (0x3000UL) /*!< ARB6_AHB_DMA_PRIO (Bitfield-Mask: 0x03)              */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB6_AHB_CPUS_PRIO_Pos (10UL)   /*!< ARB6_AHB_CPUS_PRIO (Bit 10)                           */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB6_AHB_CPUS_PRIO_Msk (0xc00UL) /*!< ARB6_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)             */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB5_AHB_DMA_PRIO_Pos (4UL)     /*!< ARB5_AHB_DMA_PRIO (Bit 4)                             */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB5_AHB_DMA_PRIO_Msk (0x30UL)  /*!< ARB5_AHB_DMA_PRIO (Bitfield-Mask: 0x03)               */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB5_AHB_CPUS_PRIO_Pos (2UL)    /*!< ARB5_AHB_CPUS_PRIO (Bit 2)                            */
#define MEMCTRL_MEM_PRIO_ARB5_8_REG_ARB5_AHB_CPUS_PRIO_Msk (0xcUL)  /*!< ARB5_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)              */
/* =====================================================  MEM_STALL_REG  ===================================================== */
#define MEMCTRL_MEM_STALL_REG_SNC_MAX_STALL_Pos (12UL)              /*!< SNC_MAX_STALL (Bit 12)                                */
#define MEMCTRL_MEM_STALL_REG_SNC_MAX_STALL_Msk (0xf000UL)          /*!< SNC_MAX_STALL (Bitfield-Mask: 0x0f)                   */
#define MEMCTRL_MEM_STALL_REG_AHB_DMA_MAX_STALL_Pos (8UL)           /*!< AHB_DMA_MAX_STALL (Bit 8)                             */
#define MEMCTRL_MEM_STALL_REG_AHB_DMA_MAX_STALL_Msk (0xf00UL)       /*!< AHB_DMA_MAX_STALL (Bitfield-Mask: 0x0f)               */
#define MEMCTRL_MEM_STALL_REG_AHB_CPUS_MAX_STALL_Pos (4UL)          /*!< AHB_CPUS_MAX_STALL (Bit 4)                            */
#define MEMCTRL_MEM_STALL_REG_AHB_CPUS_MAX_STALL_Msk (0xf0UL)       /*!< AHB_CPUS_MAX_STALL (Bitfield-Mask: 0x0f)              */
#define MEMCTRL_MEM_STALL_REG_AHB_CPUC_MAX_STALL_Pos (0UL)          /*!< AHB_CPUC_MAX_STALL (Bit 0)                            */
#define MEMCTRL_MEM_STALL_REG_AHB_CPUC_MAX_STALL_Msk (0xfUL)        /*!< AHB_CPUC_MAX_STALL (Bitfield-Mask: 0x0f)              */
/* ====================================================  MEM_STATUS2_REG  ==================================================== */
#define MEMCTRL_MEM_STATUS2_REG_RAM13_OFF_BUT_ACCESS_Pos (13UL)     /*!< RAM13_OFF_BUT_ACCESS (Bit 13)                         */
#define MEMCTRL_MEM_STATUS2_REG_RAM13_OFF_BUT_ACCESS_Msk (0x2000UL) /*!< RAM13_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)            */
#define MEMCTRL_MEM_STATUS2_REG_RAM12_OFF_BUT_ACCESS_Pos (12UL)     /*!< RAM12_OFF_BUT_ACCESS (Bit 12)                         */
#define MEMCTRL_MEM_STATUS2_REG_RAM12_OFF_BUT_ACCESS_Msk (0x1000UL) /*!< RAM12_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)            */
#define MEMCTRL_MEM_STATUS2_REG_RAM11_OFF_BUT_ACCESS_Pos (11UL)     /*!< RAM11_OFF_BUT_ACCESS (Bit 11)                         */
#define MEMCTRL_MEM_STATUS2_REG_RAM11_OFF_BUT_ACCESS_Msk (0x800UL)  /*!< RAM11_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)            */
#define MEMCTRL_MEM_STATUS2_REG_RAM10_OFF_BUT_ACCESS_Pos (10UL)     /*!< RAM10_OFF_BUT_ACCESS (Bit 10)                         */
#define MEMCTRL_MEM_STATUS2_REG_RAM10_OFF_BUT_ACCESS_Msk (0x400UL)  /*!< RAM10_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)            */
#define MEMCTRL_MEM_STATUS2_REG_RAM9_OFF_BUT_ACCESS_Pos (9UL)       /*!< RAM9_OFF_BUT_ACCESS (Bit 9)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM9_OFF_BUT_ACCESS_Msk (0x200UL)   /*!< RAM9_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM8_OFF_BUT_ACCESS_Pos (8UL)       /*!< RAM8_OFF_BUT_ACCESS (Bit 8)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM8_OFF_BUT_ACCESS_Msk (0x100UL)   /*!< RAM8_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM7_OFF_BUT_ACCESS_Pos (7UL)       /*!< RAM7_OFF_BUT_ACCESS (Bit 7)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM7_OFF_BUT_ACCESS_Msk (0x80UL)    /*!< RAM7_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM6_OFF_BUT_ACCESS_Pos (6UL)       /*!< RAM6_OFF_BUT_ACCESS (Bit 6)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM6_OFF_BUT_ACCESS_Msk (0x40UL)    /*!< RAM6_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM5_OFF_BUT_ACCESS_Pos (5UL)       /*!< RAM5_OFF_BUT_ACCESS (Bit 5)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM5_OFF_BUT_ACCESS_Msk (0x20UL)    /*!< RAM5_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM4_OFF_BUT_ACCESS_Pos (4UL)       /*!< RAM4_OFF_BUT_ACCESS (Bit 4)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM4_OFF_BUT_ACCESS_Msk (0x10UL)    /*!< RAM4_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM3_OFF_BUT_ACCESS_Pos (3UL)       /*!< RAM3_OFF_BUT_ACCESS (Bit 3)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM3_OFF_BUT_ACCESS_Msk (0x8UL)     /*!< RAM3_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM2_OFF_BUT_ACCESS_Pos (2UL)       /*!< RAM2_OFF_BUT_ACCESS (Bit 2)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM2_OFF_BUT_ACCESS_Msk (0x4UL)     /*!< RAM2_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM1_OFF_BUT_ACCESS_Pos (1UL)       /*!< RAM1_OFF_BUT_ACCESS (Bit 1)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM1_OFF_BUT_ACCESS_Msk (0x2UL)     /*!< RAM1_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS2_REG_RAM0_OFF_BUT_ACCESS_Pos (0UL)       /*!< RAM0_OFF_BUT_ACCESS (Bit 0)                           */
#define MEMCTRL_MEM_STATUS2_REG_RAM0_OFF_BUT_ACCESS_Msk (0x1UL)     /*!< RAM0_OFF_BUT_ACCESS (Bitfield-Mask: 0x01)             */
/* ====================================================  MEM_STATUS_REG  ===================================================== */
#define MEMCTRL_MEM_STATUS_REG_AHB_SNC_WR_BUFF_CNT_Pos (20UL)       /*!< AHB_SNC_WR_BUFF_CNT (Bit 20)                          */
#define MEMCTRL_MEM_STATUS_REG_AHB_SNC_WR_BUFF_CNT_Msk (0xf00000UL) /*!< AHB_SNC_WR_BUFF_CNT (Bitfield-Mask: 0x0f)             */
#define MEMCTRL_MEM_STATUS_REG_AHB_DMA_WR_BUFF_CNT_Pos (16UL)       /*!< AHB_DMA_WR_BUFF_CNT (Bit 16)                          */
#define MEMCTRL_MEM_STATUS_REG_AHB_DMA_WR_BUFF_CNT_Msk (0xf0000UL)  /*!< AHB_DMA_WR_BUFF_CNT (Bitfield-Mask: 0x0f)             */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUC_WR_BUFF_CNT_Pos (12UL)      /*!< AHB_CPUC_WR_BUFF_CNT (Bit 12)                         */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUC_WR_BUFF_CNT_Msk (0xf000UL)  /*!< AHB_CPUC_WR_BUFF_CNT (Bitfield-Mask: 0x0f)            */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUS_WR_BUFF_CNT_Pos (8UL)       /*!< AHB_CPUS_WR_BUFF_CNT (Bit 8)                          */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUS_WR_BUFF_CNT_Msk (0xf00UL)   /*!< AHB_CPUS_WR_BUFF_CNT (Bitfield-Mask: 0x0f)            */
#define MEMCTRL_MEM_STATUS_REG_AHB_SNC_CLR_WR_BUFF_Pos (7UL)        /*!< AHB_SNC_CLR_WR_BUFF (Bit 7)                           */
#define MEMCTRL_MEM_STATUS_REG_AHB_SNC_CLR_WR_BUFF_Msk (0x80UL)     /*!< AHB_SNC_CLR_WR_BUFF (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS_REG_AHB_DMA_CLR_WR_BUFF_Pos (6UL)        /*!< AHB_DMA_CLR_WR_BUFF (Bit 6)                           */
#define MEMCTRL_MEM_STATUS_REG_AHB_DMA_CLR_WR_BUFF_Msk (0x40UL)     /*!< AHB_DMA_CLR_WR_BUFF (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUC_CLR_WR_BUFF_Pos (5UL)       /*!< AHB_CPUC_CLR_WR_BUFF (Bit 5)                          */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUC_CLR_WR_BUFF_Msk (0x20UL)    /*!< AHB_CPUC_CLR_WR_BUFF (Bitfield-Mask: 0x01)            */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUS_CLR_WR_BUFF_Pos (4UL)       /*!< AHB_CPUS_CLR_WR_BUFF (Bit 4)                          */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUS_CLR_WR_BUFF_Msk (0x10UL)    /*!< AHB_CPUS_CLR_WR_BUFF (Bitfield-Mask: 0x01)            */
#define MEMCTRL_MEM_STATUS_REG_AHB_SNC_WRITE_BUFF_Pos (3UL)         /*!< AHB_SNC_WRITE_BUFF (Bit 3)                            */
#define MEMCTRL_MEM_STATUS_REG_AHB_SNC_WRITE_BUFF_Msk (0x8UL)       /*!< AHB_SNC_WRITE_BUFF (Bitfield-Mask: 0x01)              */
#define MEMCTRL_MEM_STATUS_REG_AHB_DMA_WRITE_BUFF_Pos (2UL)         /*!< AHB_DMA_WRITE_BUFF (Bit 2)                            */
#define MEMCTRL_MEM_STATUS_REG_AHB_DMA_WRITE_BUFF_Msk (0x4UL)       /*!< AHB_DMA_WRITE_BUFF (Bitfield-Mask: 0x01)              */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUC_WRITE_BUFF_Pos (1UL)        /*!< AHB_CPUC_WRITE_BUFF (Bit 1)                           */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUC_WRITE_BUFF_Msk (0x2UL)      /*!< AHB_CPUC_WRITE_BUFF (Bitfield-Mask: 0x01)             */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUS_WRITE_BUFF_Pos (0UL)        /*!< AHB_CPUS_WRITE_BUFF (Bit 0)                           */
#define MEMCTRL_MEM_STATUS_REG_AHB_CPUS_WRITE_BUFF_Msk (0x1UL)      /*!< AHB_CPUS_WRITE_BUFF (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                          OQSPIF                                           ================ */
/* =========================================================================================================================== */

