antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ==================================================  OQSPIF_BURSTBRK_REG  ================================================== */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_EN_Pos (23UL)          /*!< OSPIC_BRK_EN (Bit 23)                                 */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_EN_Msk (0x800000UL)    /*!< OSPIC_BRK_EN (Bitfield-Mask: 0x01)                    */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_SEC_HF_DS_Pos (22UL)       /*!< OSPIC_SEC_HF_DS (Bit 22)                              */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_SEC_HF_DS_Msk (0x400000UL) /*!< OSPIC_SEC_HF_DS (Bitfield-Mask: 0x01)                 */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_TX_MD_Pos (20UL)       /*!< OSPIC_BRK_TX_MD (Bit 20)                              */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_TX_MD_Msk (0x300000UL) /*!< OSPIC_BRK_TX_MD (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_SZ_Pos (16UL)          /*!< OSPIC_BRK_SZ (Bit 16)                                 */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_SZ_Msk (0xf0000UL)     /*!< OSPIC_BRK_SZ (Bitfield-Mask: 0x0f)                    */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_WRD_Pos (0UL)          /*!< OSPIC_BRK_WRD (Bit 0)                                 */
#define OQSPIF_OQSPIF_BURSTBRK_REG_OSPIC_BRK_WRD_Msk (0xffffUL)     /*!< OSPIC_BRK_WRD (Bitfield-Mask: 0xffff)                 */
/* =================================================  OQSPIF_BURSTCMDA_REG  ================================================== */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_DMY_TX_MD_Pos (30UL)      /*!< OSPIC_DMY_TX_MD (Bit 30)                              */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_DMY_TX_MD_Msk (0xc0000000UL) /*!< OSPIC_DMY_TX_MD (Bitfield-Mask: 0x03)              */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_EXT_TX_MD_Pos (28UL)      /*!< OSPIC_EXT_TX_MD (Bit 28)                              */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_EXT_TX_MD_Msk (0x30000000UL) /*!< OSPIC_EXT_TX_MD (Bitfield-Mask: 0x03)              */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_ADR_TX_MD_Pos (26UL)      /*!< OSPIC_ADR_TX_MD (Bit 26)                              */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_ADR_TX_MD_Msk (0xc000000UL) /*!< OSPIC_ADR_TX_MD (Bitfield-Mask: 0x03)               */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_INST_TX_MD_Pos (24UL)     /*!< OSPIC_INST_TX_MD (Bit 24)                             */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_INST_TX_MD_Msk (0x3000000UL) /*!< OSPIC_INST_TX_MD (Bitfield-Mask: 0x03)             */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_EXT_BYTE_Pos (16UL)       /*!< OSPIC_EXT_BYTE (Bit 16)                               */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_EXT_BYTE_Msk (0xff0000UL) /*!< OSPIC_EXT_BYTE (Bitfield-Mask: 0xff)                  */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_INST_WB_Pos (8UL)         /*!< OSPIC_INST_WB (Bit 8)                                 */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_INST_WB_Msk (0xff00UL)    /*!< OSPIC_INST_WB (Bitfield-Mask: 0xff)                   */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_INST_Pos (0UL)            /*!< OSPIC_INST (Bit 0)                                    */
#define OQSPIF_OQSPIF_BURSTCMDA_REG_OSPIC_INST_Msk (0xffUL)         /*!< OSPIC_INST (Bitfield-Mask: 0xff)                      */
/* =================================================  OQSPIF_BURSTCMDB_REG  ================================================== */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_CS_HIGH_MIN_Pos (16UL)    /*!< OSPIC_CS_HIGH_MIN (Bit 16)                            */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_CS_HIGH_MIN_Msk (0x70000UL) /*!< OSPIC_CS_HIGH_MIN (Bitfield-Mask: 0x07)             */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_WRAP_SIZE_Pos (14UL)      /*!< OSPIC_WRAP_SIZE (Bit 14)                              */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_WRAP_SIZE_Msk (0xc000UL)  /*!< OSPIC_WRAP_SIZE (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_WRAP_LEN_Pos (12UL)       /*!< OSPIC_WRAP_LEN (Bit 12)                               */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_WRAP_LEN_Msk (0x3000UL)   /*!< OSPIC_WRAP_LEN (Bitfield-Mask: 0x03)                  */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_WRAP_MD_Pos (11UL)        /*!< OSPIC_WRAP_MD (Bit 11)                                */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_WRAP_MD_Msk (0x800UL)     /*!< OSPIC_WRAP_MD (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_INST_MD_Pos (10UL)        /*!< OSPIC_INST_MD (Bit 10)                                */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_INST_MD_Msk (0x400UL)     /*!< OSPIC_INST_MD (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_DMY_EN_Pos (9UL)          /*!< OSPIC_DMY_EN (Bit 9)                                  */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_DMY_EN_Msk (0x200UL)      /*!< OSPIC_DMY_EN (Bitfield-Mask: 0x01)                    */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_DMY_NUM_Pos (4UL)         /*!< OSPIC_DMY_NUM (Bit 4)                                 */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_DMY_NUM_Msk (0x1f0UL)     /*!< OSPIC_DMY_NUM (Bitfield-Mask: 0x1f)                   */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_EXT_HF_DS_Pos (3UL)       /*!< OSPIC_EXT_HF_DS (Bit 3)                               */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_EXT_HF_DS_Msk (0x8UL)     /*!< OSPIC_EXT_HF_DS (Bitfield-Mask: 0x01)                 */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_EXT_BYTE_EN_Pos (2UL)     /*!< OSPIC_EXT_BYTE_EN (Bit 2)                             */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_EXT_BYTE_EN_Msk (0x4UL)   /*!< OSPIC_EXT_BYTE_EN (Bitfield-Mask: 0x01)               */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_DAT_RX_MD_Pos (0UL)       /*!< OSPIC_DAT_RX_MD (Bit 0)                               */
#define OQSPIF_OQSPIF_BURSTCMDB_REG_OSPIC_DAT_RX_MD_Msk (0x3UL)     /*!< OSPIC_DAT_RX_MD (Bitfield-Mask: 0x03)                 */
/* =================================================  OQSPIF_CHCKERASE_REG  ================================================== */
#define OQSPIF_OQSPIF_CHCKERASE_REG_OSPIC_CHCKERASE_Pos (0UL)       /*!< OSPIC_CHCKERASE (Bit 0)                               */
#define OQSPIF_OQSPIF_CHCKERASE_REG_OSPIC_CHCKERASE_Msk (0xffffffffUL) /*!< OSPIC_CHCKERASE (Bitfield-Mask: 0xffffffff)        */
/* ==================================================  OQSPIF_CTRLBUS_REG  =================================================== */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_DIS_CS_Pos (5UL)            /*!< OSPIC_DIS_CS (Bit 5)                                  */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_DIS_CS_Msk (0x20UL)         /*!< OSPIC_DIS_CS (Bitfield-Mask: 0x01)                    */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_EN_CS_Pos (4UL)             /*!< OSPIC_EN_CS (Bit 4)                                   */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_EN_CS_Msk (0x10UL)          /*!< OSPIC_EN_CS (Bitfield-Mask: 0x01)                     */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_OCTAL_Pos (3UL)         /*!< OSPIC_SET_OCTAL (Bit 3)                               */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_OCTAL_Msk (0x8UL)       /*!< OSPIC_SET_OCTAL (Bitfield-Mask: 0x01)                 */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_QUAD_Pos (2UL)          /*!< OSPIC_SET_QUAD (Bit 2)                                */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_QUAD_Msk (0x4UL)        /*!< OSPIC_SET_QUAD (Bitfield-Mask: 0x01)                  */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_DUAL_Pos (1UL)          /*!< OSPIC_SET_DUAL (Bit 1)                                */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_DUAL_Msk (0x2UL)        /*!< OSPIC_SET_DUAL (Bitfield-Mask: 0x01)                  */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_SINGLE_Pos (0UL)        /*!< OSPIC_SET_SINGLE (Bit 0)                              */
#define OQSPIF_OQSPIF_CTRLBUS_REG_OSPIC_SET_SINGLE_Msk (0x1UL)      /*!< OSPIC_SET_SINGLE (Bitfield-Mask: 0x01)                */
/* ==================================================  OQSPIF_CTRLMODE_REG  ================================================== */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO_UH_DAT_Pos (28UL)       /*!< OSPIC_IO_UH_DAT (Bit 28)                              */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO_UH_DAT_Msk (0xf0000000UL) /*!< OSPIC_IO_UH_DAT (Bitfield-Mask: 0x0f)               */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO_UH_OEN_Pos (27UL)       /*!< OSPIC_IO_UH_OEN (Bit 27)                              */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO_UH_OEN_Msk (0x8000000UL) /*!< OSPIC_IO_UH_OEN (Bitfield-Mask: 0x01)                */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_INC_LIM_EN_Pos (18UL)      /*!< OSPIC_INC_LIM_EN (Bit 18)                             */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_INC_LIM_EN_Msk (0x40000UL) /*!< OSPIC_INC_LIM_EN (Bitfield-Mask: 0x01)                */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_RD_ERR_EN_Pos (17UL)       /*!< OSPIC_RD_ERR_EN (Bit 17)                              */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_RD_ERR_EN_Msk (0x20000UL)  /*!< OSPIC_RD_ERR_EN (Bitfield-Mask: 0x01)                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_MAN_DIRCHG_MD_Pos (16UL)   /*!< OSPIC_MAN_DIRCHG_MD (Bit 16)                          */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_MAN_DIRCHG_MD_Msk (0x10000UL) /*!< OSPIC_MAN_DIRCHG_MD (Bitfield-Mask: 0x01)          */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_DMY_MD_Pos (15UL)          /*!< OSPIC_DMY_MD (Bit 15)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_DMY_MD_Msk (0x8000UL)      /*!< OSPIC_DMY_MD (Bitfield-Mask: 0x01)                    */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_CMD_X2_EN_Pos (14UL)       /*!< OSPIC_CMD_X2_EN (Bit 14)                              */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_CMD_X2_EN_Msk (0x4000UL)   /*!< OSPIC_CMD_X2_EN (Bitfield-Mask: 0x01)                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_USE_32BA_Pos (13UL)        /*!< OSPIC_USE_32BA (Bit 13)                               */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_USE_32BA_Msk (0x2000UL)    /*!< OSPIC_USE_32BA (Bitfield-Mask: 0x01)                  */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_BUF_LIM_EN_Pos (12UL)      /*!< OSPIC_BUF_LIM_EN (Bit 12)                             */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_BUF_LIM_EN_Msk (0x1000UL)  /*!< OSPIC_BUF_LIM_EN (Bitfield-Mask: 0x01)                */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_PCLK_MD_Pos (9UL)          /*!< OSPIC_PCLK_MD (Bit 9)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_PCLK_MD_Msk (0xe00UL)      /*!< OSPIC_PCLK_MD (Bitfield-Mask: 0x07)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_RPIPE_EN_Pos (8UL)         /*!< OSPIC_RPIPE_EN (Bit 8)                                */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_RPIPE_EN_Msk (0x100UL)     /*!< OSPIC_RPIPE_EN (Bitfield-Mask: 0x01)                  */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_RXD_NEG_Pos (7UL)          /*!< OSPIC_RXD_NEG (Bit 7)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_RXD_NEG_Msk (0x80UL)       /*!< OSPIC_RXD_NEG (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_HRDY_MD_Pos (6UL)          /*!< OSPIC_HRDY_MD (Bit 6)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_HRDY_MD_Msk (0x40UL)       /*!< OSPIC_HRDY_MD (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO3_DAT_Pos (5UL)          /*!< OSPIC_IO3_DAT (Bit 5)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO3_DAT_Msk (0x20UL)       /*!< OSPIC_IO3_DAT (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO2_DAT_Pos (4UL)          /*!< OSPIC_IO2_DAT (Bit 4)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO2_DAT_Msk (0x10UL)       /*!< OSPIC_IO2_DAT (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO3_OEN_Pos (3UL)          /*!< OSPIC_IO3_OEN (Bit 3)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO3_OEN_Msk (0x8UL)        /*!< OSPIC_IO3_OEN (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO2_OEN_Pos (2UL)          /*!< OSPIC_IO2_OEN (Bit 2)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_IO2_OEN_Msk (0x4UL)        /*!< OSPIC_IO2_OEN (Bitfield-Mask: 0x01)                   */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_CLK_MD_Pos (1UL)           /*!< OSPIC_CLK_MD (Bit 1)                                  */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_CLK_MD_Msk (0x2UL)         /*!< OSPIC_CLK_MD (Bitfield-Mask: 0x01)                    */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_AUTO_MD_Pos (0UL)          /*!< OSPIC_AUTO_MD (Bit 0)                                 */
#define OQSPIF_OQSPIF_CTRLMODE_REG_OSPIC_AUTO_MD_Msk (0x1UL)        /*!< OSPIC_AUTO_MD (Bitfield-Mask: 0x01)                   */
/* ==================================================  OQSPIF_CTR_CTRL_REG  ================================================== */
#define OQSPIF_OQSPIF_CTR_CTRL_REG_OSPIC_CTR_EN_Pos (0UL)           /*!< OSPIC_CTR_EN (Bit 0)                                  */
#define OQSPIF_OQSPIF_CTR_CTRL_REG_OSPIC_CTR_EN_Msk (0x1UL)         /*!< OSPIC_CTR_EN (Bitfield-Mask: 0x01)                    */
/* =================================================  OQSPIF_CTR_EADDR_REG  ================================================== */
#define OQSPIF_OQSPIF_CTR_EADDR_REG_OSPIC_CTR_EADDR_Pos (10UL)      /*!< OSPIC_CTR_EADDR (Bit 10)                              */
#define OQSPIF_OQSPIF_CTR_EADDR_REG_OSPIC_CTR_EADDR_Msk (0xfffffc00UL) /*!< OSPIC_CTR_EADDR (Bitfield-Mask: 0x3fffff)          */
/* ================================================  OQSPIF_CTR_KEY_0_3_REG  ================================================= */
#define OQSPIF_OQSPIF_CTR_KEY_0_3_REG_OSPIC_CTR_KEY_0_3_Pos (0UL)   /*!< OSPIC_CTR_KEY_0_3 (Bit 0)                             */
#define OQSPIF_OQSPIF_CTR_KEY_0_3_REG_OSPIC_CTR_KEY_0_3_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_0_3 (Bitfield-Mask: 0xffffffff)  */
/* ===============================================  OQSPIF_CTR_KEY_12_15_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_KEY_12_15_REG_OSPIC_CTR_KEY_12_15_Pos (0UL) /*!< OSPIC_CTR_KEY_12_15 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_KEY_12_15_REG_OSPIC_CTR_KEY_12_15_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_12_15 (Bitfield-Mask: 0xffffffff) */
/* ===============================================  OQSPIF_CTR_KEY_16_19_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_KEY_16_19_REG_OSPIC_CTR_KEY_16_19_Pos (0UL) /*!< OSPIC_CTR_KEY_16_19 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_KEY_16_19_REG_OSPIC_CTR_KEY_16_19_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_16_19 (Bitfield-Mask: 0xffffffff) */
/* ===============================================  OQSPIF_CTR_KEY_20_23_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_KEY_20_23_REG_OSPIC_CTR_KEY_20_23_Pos (0UL) /*!< OSPIC_CTR_KEY_20_23 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_KEY_20_23_REG_OSPIC_CTR_KEY_20_23_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_20_23 (Bitfield-Mask: 0xffffffff) */
/* ===============================================  OQSPIF_CTR_KEY_24_27_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_KEY_24_27_REG_OSPIC_CTR_KEY_24_27_Pos (0UL) /*!< OSPIC_CTR_KEY_24_27 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_KEY_24_27_REG_OSPIC_CTR_KEY_24_27_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_24_27 (Bitfield-Mask: 0xffffffff) */
/* ===============================================  OQSPIF_CTR_KEY_28_31_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_KEY_28_31_REG_OSPIC_CTR_KEY_28_31_Pos (0UL) /*!< OSPIC_CTR_KEY_28_31 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_KEY_28_31_REG_OSPIC_CTR_KEY_28_31_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_28_31 (Bitfield-Mask: 0xffffffff) */
/* ================================================  OQSPIF_CTR_KEY_4_7_REG  ================================================= */
#define OQSPIF_OQSPIF_CTR_KEY_4_7_REG_OSPIC_CTR_KEY_4_7_Pos (0UL)   /*!< OSPIC_CTR_KEY_4_7 (Bit 0)                             */
#define OQSPIF_OQSPIF_CTR_KEY_4_7_REG_OSPIC_CTR_KEY_4_7_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_4_7 (Bitfield-Mask: 0xffffffff)  */
/* ================================================  OQSPIF_CTR_KEY_8_11_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_KEY_8_11_REG_OSPIC_CTR_KEY_8_11_Pos (0UL) /*!< OSPIC_CTR_KEY_8_11 (Bit 0)                            */
#define OQSPIF_OQSPIF_CTR_KEY_8_11_REG_OSPIC_CTR_KEY_8_11_Msk (0xffffffffUL) /*!< OSPIC_CTR_KEY_8_11 (Bitfield-Mask: 0xffffffff) */
/* ===============================================  OQSPIF_CTR_NONCE_0_3_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_NONCE_0_3_REG_OSPIC_CTR_NONCE_0_3_Pos (0UL) /*!< OSPIC_CTR_NONCE_0_3 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_NONCE_0_3_REG_OSPIC_CTR_NONCE_0_3_Msk (0xffffffffUL) /*!< OSPIC_CTR_NONCE_0_3 (Bitfield-Mask: 0xffffffff) */
/* ===============================================  OQSPIF_CTR_NONCE_4_7_REG  ================================================ */
#define OQSPIF_OQSPIF_CTR_NONCE_4_7_REG_OSPIC_CTR_NONCE_4_7_Pos (0UL) /*!< OSPIC_CTR_NONCE_4_7 (Bit 0)                         */
#define OQSPIF_OQSPIF_CTR_NONCE_4_7_REG_OSPIC_CTR_NONCE_4_7_Msk (0xffffffffUL) /*!< OSPIC_CTR_NONCE_4_7 (Bitfield-Mask: 0xffffffff) */
/* =================================================  OQSPIF_CTR_SADDR_REG  ================================================== */
#define OQSPIF_OQSPIF_CTR_SADDR_REG_OSPIC_CTR_SADDR_Pos (10UL)      /*!< OSPIC_CTR_SADDR (Bit 10)                              */
#define OQSPIF_OQSPIF_CTR_SADDR_REG_OSPIC_CTR_SADDR_Msk (0xfffffc00UL) /*!< OSPIC_CTR_SADDR (Bitfield-Mask: 0x3fffff)          */
/* =================================================  OQSPIF_DUMMYDATA_REG  ================================================== */
#define OQSPIF_OQSPIF_DUMMYDATA_REG_OSPIC_DUMMYDATA_Pos (0UL)       /*!< OSPIC_DUMMYDATA (Bit 0)                               */
#define OQSPIF_OQSPIF_DUMMYDATA_REG_OSPIC_DUMMYDATA_Msk (0xffffffffUL) /*!< OSPIC_DUMMYDATA (Bitfield-Mask: 0xffffffff)        */
/* =================================================  OQSPIF_ERASECMDA_REG  ================================================== */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_RES_INST_Pos (24UL)       /*!< OSPIC_RES_INST (Bit 24)                               */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_RES_INST_Msk (0xff000000UL) /*!< OSPIC_RES_INST (Bitfield-Mask: 0xff)                */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_SUS_INST_Pos (16UL)       /*!< OSPIC_SUS_INST (Bit 16)                               */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_SUS_INST_Msk (0xff0000UL) /*!< OSPIC_SUS_INST (Bitfield-Mask: 0xff)                  */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_WEN_INST_Pos (8UL)        /*!< OSPIC_WEN_INST (Bit 8)                                */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_WEN_INST_Msk (0xff00UL)   /*!< OSPIC_WEN_INST (Bitfield-Mask: 0xff)                  */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_ERS_INST_Pos (0UL)        /*!< OSPIC_ERS_INST (Bit 0)                                */
#define OQSPIF_OQSPIF_ERASECMDA_REG_OSPIC_ERS_INST_Msk (0xffUL)     /*!< OSPIC_ERS_INST (Bitfield-Mask: 0xff)                  */
/* =================================================  OQSPIF_ERASECMDB_REG  ================================================== */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_RESSUS_DLY_Pos (24UL)     /*!< OSPIC_RESSUS_DLY (Bit 24)                             */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_RESSUS_DLY_Msk (0xff000000UL) /*!< OSPIC_RESSUS_DLY (Bitfield-Mask: 0xff)            */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_ERSRES_HLD_Pos (16UL)     /*!< OSPIC_ERSRES_HLD (Bit 16)                             */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_ERSRES_HLD_Msk (0xf0000UL) /*!< OSPIC_ERSRES_HLD (Bitfield-Mask: 0x0f)               */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_ERS_CS_HI_Pos (10UL)      /*!< OSPIC_ERS_CS_HI (Bit 10)                              */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_ERS_CS_HI_Msk (0x7c00UL)  /*!< OSPIC_ERS_CS_HI (Bitfield-Mask: 0x1f)                 */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_EAD_TX_MD_Pos (8UL)       /*!< OSPIC_EAD_TX_MD (Bit 8)                               */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_EAD_TX_MD_Msk (0x300UL)   /*!< OSPIC_EAD_TX_MD (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_RES_TX_MD_Pos (6UL)       /*!< OSPIC_RES_TX_MD (Bit 6)                               */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_RES_TX_MD_Msk (0xc0UL)    /*!< OSPIC_RES_TX_MD (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_SUS_TX_MD_Pos (4UL)       /*!< OSPIC_SUS_TX_MD (Bit 4)                               */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_SUS_TX_MD_Msk (0x30UL)    /*!< OSPIC_SUS_TX_MD (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_WEN_TX_MD_Pos (2UL)       /*!< OSPIC_WEN_TX_MD (Bit 2)                               */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_WEN_TX_MD_Msk (0xcUL)     /*!< OSPIC_WEN_TX_MD (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_ERS_TX_MD_Pos (0UL)       /*!< OSPIC_ERS_TX_MD (Bit 0)                               */
#define OQSPIF_OQSPIF_ERASECMDB_REG_OSPIC_ERS_TX_MD_Msk (0x3UL)     /*!< OSPIC_ERS_TX_MD (Bitfield-Mask: 0x03)                 */
/* =================================================  OQSPIF_ERASECMDC_REG  ================================================== */
#define OQSPIF_OQSPIF_ERASECMDC_REG_OSPIC_SUSSTS_DLY_Pos (0UL)      /*!< OSPIC_SUSSTS_DLY (Bit 0)                              */
#define OQSPIF_OQSPIF_ERASECMDC_REG_OSPIC_SUSSTS_DLY_Msk (0x3fUL)   /*!< OSPIC_SUSSTS_DLY (Bitfield-Mask: 0x3f)                */
/* =================================================  OQSPIF_ERASECTRL_REG  ================================================== */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERS_RES_DIS_Pos (28UL)    /*!< OSPIC_ERS_RES_DIS (Bit 28)                            */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERS_RES_DIS_Msk (0x10000000UL) /*!< OSPIC_ERS_RES_DIS (Bitfield-Mask: 0x01)          */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERS_STATE_Pos (25UL)      /*!< OSPIC_ERS_STATE (Bit 25)                              */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERS_STATE_Msk (0xe000000UL) /*!< OSPIC_ERS_STATE (Bitfield-Mask: 0x07)               */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERASE_EN_Pos (24UL)       /*!< OSPIC_ERASE_EN (Bit 24)                               */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERASE_EN_Msk (0x1000000UL) /*!< OSPIC_ERASE_EN (Bitfield-Mask: 0x01)                 */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERS_ADDR_Pos (4UL)        /*!< OSPIC_ERS_ADDR (Bit 4)                                */
#define OQSPIF_OQSPIF_ERASECTRL_REG_OSPIC_ERS_ADDR_Msk (0xfffff0UL) /*!< OSPIC_ERS_ADDR (Bitfield-Mask: 0xfffff)               */
/* =====================================================  OQSPIF_GP_REG  ===================================================== */
#define OQSPIF_OQSPIF_GP_REG_OSPIC_PADS_SLEW_Pos (3UL)              /*!< OSPIC_PADS_SLEW (Bit 3)                               */
