antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define OQSPIF_OQSPIF_GP_REG_OSPIC_PADS_SLEW_Msk (0x18UL)           /*!< OSPIC_PADS_SLEW (Bitfield-Mask: 0x03)                 */
#define OQSPIF_OQSPIF_GP_REG_OSPIC_PADS_DRV_Pos (1UL)               /*!< OSPIC_PADS_DRV (Bit 1)                                */
#define OQSPIF_OQSPIF_GP_REG_OSPIC_PADS_DRV_Msk (0x6UL)             /*!< OSPIC_PADS_DRV (Bitfield-Mask: 0x03)                  */
/* ==================================================  OQSPIF_READDATA_REG  ================================================== */
#define OQSPIF_OQSPIF_READDATA_REG_OSPIC_READDATA_Pos (0UL)         /*!< OSPIC_READDATA (Bit 0)                                */
#define OQSPIF_OQSPIF_READDATA_REG_OSPIC_READDATA_Msk (0xffffffffUL) /*!< OSPIC_READDATA (Bitfield-Mask: 0xffffffff)           */
/* ==================================================  OQSPIF_RECVDATA_REG  ================================================== */
#define OQSPIF_OQSPIF_RECVDATA_REG_OSPIC_RECVDATA_Pos (0UL)         /*!< OSPIC_RECVDATA (Bit 0)                                */
#define OQSPIF_OQSPIF_RECVDATA_REG_OSPIC_RECVDATA_Msk (0xffffffffUL) /*!< OSPIC_RECVDATA (Bitfield-Mask: 0xffffffff)           */
/* =================================================  OQSPIF_STATUSCMD_REG  ================================================== */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_ZERO_Pos (30UL) /*!< OSPIC_RSTAT_DMY_ZERO (Bit 30)                         */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_ZERO_Msk (0x40000000UL) /*!< OSPIC_RSTAT_DMY_ZERO (Bitfield-Mask: 0x01)    */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_TX_MD_Pos (28UL) /*!< OSPIC_RSTAT_DMY_TX_MD (Bit 28)                       */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_TX_MD_Msk (0x30000000UL) /*!< OSPIC_RSTAT_DMY_TX_MD (Bitfield-Mask: 0x03)  */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_NUM_Pos (24UL)  /*!< OSPIC_RSTAT_DMY_NUM (Bit 24)                          */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_NUM_Msk (0xf000000UL) /*!< OSPIC_RSTAT_DMY_NUM (Bitfield-Mask: 0x0f)       */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_EN_Pos (23UL)   /*!< OSPIC_RSTAT_DMY_EN (Bit 23)                           */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_DMY_EN_Msk (0x800000UL) /*!< OSPIC_RSTAT_DMY_EN (Bitfield-Mask: 0x01)          */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_STSDLY_SEL_Pos (22UL)     /*!< OSPIC_STSDLY_SEL (Bit 22)                             */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_STSDLY_SEL_Msk (0x400000UL) /*!< OSPIC_STSDLY_SEL (Bitfield-Mask: 0x01)              */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RESSTS_DLY_Pos (16UL)     /*!< OSPIC_RESSTS_DLY (Bit 16)                             */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RESSTS_DLY_Msk (0x3f0000UL) /*!< OSPIC_RESSTS_DLY (Bitfield-Mask: 0x3f)              */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_BUSY_VAL_Pos (15UL)       /*!< OSPIC_BUSY_VAL (Bit 15)                               */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_BUSY_VAL_Msk (0x8000UL)   /*!< OSPIC_BUSY_VAL (Bitfield-Mask: 0x01)                  */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_BUSY_POS_Pos (12UL)       /*!< OSPIC_BUSY_POS (Bit 12)                               */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_BUSY_POS_Msk (0x7000UL)   /*!< OSPIC_BUSY_POS (Bitfield-Mask: 0x07)                  */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_RX_MD_Pos (10UL)    /*!< OSPIC_RSTAT_RX_MD (Bit 10)                            */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_RX_MD_Msk (0xc00UL) /*!< OSPIC_RSTAT_RX_MD (Bitfield-Mask: 0x03)               */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_TX_MD_Pos (8UL)     /*!< OSPIC_RSTAT_TX_MD (Bit 8)                             */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_TX_MD_Msk (0x300UL) /*!< OSPIC_RSTAT_TX_MD (Bitfield-Mask: 0x03)               */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_INST_Pos (0UL)      /*!< OSPIC_RSTAT_INST (Bit 0)                              */
#define OQSPIF_OQSPIF_STATUSCMD_REG_OSPIC_RSTAT_INST_Msk (0xffUL)   /*!< OSPIC_RSTAT_INST (Bitfield-Mask: 0xff)                */
/* ===================================================  OQSPIF_STATUS_REG  =================================================== */
#define OQSPIF_OQSPIF_STATUS_REG_OSPIC_BUSY_Pos (0UL)               /*!< OSPIC_BUSY (Bit 0)                                    */
#define OQSPIF_OQSPIF_STATUS_REG_OSPIC_BUSY_Msk (0x1UL)             /*!< OSPIC_BUSY (Bitfield-Mask: 0x01)                      */
/* =================================================  OQSPIF_WRITEDATA_REG  ================================================== */
#define OQSPIF_OQSPIF_WRITEDATA_REG_OSPIC_WRITEDATA_Pos (0UL)       /*!< OSPIC_WRITEDATA (Bit 0)                               */
#define OQSPIF_OQSPIF_WRITEDATA_REG_OSPIC_WRITEDATA_Msk (0xffffffffUL) /*!< OSPIC_WRITEDATA (Bitfield-Mask: 0xffffffff)        */


/* =========================================================================================================================== */
/* ================                                           OTPC                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  OTPC_MODE_REG  ===================================================== */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_PRG_SEL_Pos (6UL)              /*!< OTPC_MODE_PRG_SEL (Bit 6)                             */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_PRG_SEL_Msk (0xc0UL)           /*!< OTPC_MODE_PRG_SEL (Bitfield-Mask: 0x03)               */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_HT_MARG_EN_Pos (5UL)           /*!< OTPC_MODE_HT_MARG_EN (Bit 5)                          */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_HT_MARG_EN_Msk (0x20UL)        /*!< OTPC_MODE_HT_MARG_EN (Bitfield-Mask: 0x01)            */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_USE_TST_ROW_Pos (4UL)          /*!< OTPC_MODE_USE_TST_ROW (Bit 4)                         */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_USE_TST_ROW_Msk (0x10UL)       /*!< OTPC_MODE_USE_TST_ROW (Bitfield-Mask: 0x01)           */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_MODE_Pos (0UL)                 /*!< OTPC_MODE_MODE (Bit 0)                                */
#define OTPC_OTPC_MODE_REG_OTPC_MODE_MODE_Msk (0x7UL)               /*!< OTPC_MODE_MODE (Bitfield-Mask: 0x07)                  */
/* ====================================================  OTPC_PADDR_REG  ===================================================== */
#define OTPC_OTPC_PADDR_REG_OTPC_PADDR_Pos (0UL)                    /*!< OTPC_PADDR (Bit 0)                                    */
#define OTPC_OTPC_PADDR_REG_OTPC_PADDR_Msk (0x3ffUL)                /*!< OTPC_PADDR (Bitfield-Mask: 0x3ff)                     */
/* ====================================================  OTPC_PWORD_REG  ===================================================== */
#define OTPC_OTPC_PWORD_REG_OTPC_PWORD_Pos (0UL)                    /*!< OTPC_PWORD (Bit 0)                                    */
#define OTPC_OTPC_PWORD_REG_OTPC_PWORD_Msk (0xffffffffUL)           /*!< OTPC_PWORD (Bitfield-Mask: 0xffffffff)                */
/* =====================================================  OTPC_STAT_REG  ===================================================== */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_MRDY_Pos (2UL)                 /*!< OTPC_STAT_MRDY (Bit 2)                                */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_MRDY_Msk (0x4UL)               /*!< OTPC_STAT_MRDY (Bitfield-Mask: 0x01)                  */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PBUF_EMPTY_Pos (1UL)           /*!< OTPC_STAT_PBUF_EMPTY (Bit 1)                          */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PBUF_EMPTY_Msk (0x2UL)         /*!< OTPC_STAT_PBUF_EMPTY (Bitfield-Mask: 0x01)            */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PRDY_Pos (0UL)                 /*!< OTPC_STAT_PRDY (Bit 0)                                */
#define OTPC_OTPC_STAT_REG_OTPC_STAT_PRDY_Msk (0x1UL)               /*!< OTPC_STAT_PRDY (Bitfield-Mask: 0x01)                  */
/* =====================================================  OTPC_TIM1_REG  ===================================================== */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_US_T_CSP_Pos (24UL)            /*!< OTPC_TIM1_US_T_CSP (Bit 24)                           */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_US_T_CSP_Msk (0x7f000000UL)    /*!< OTPC_TIM1_US_T_CSP (Bitfield-Mask: 0x7f)              */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_US_T_CS_Pos (20UL)             /*!< OTPC_TIM1_US_T_CS (Bit 20)                            */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_US_T_CS_Msk (0xf00000UL)       /*!< OTPC_TIM1_US_T_CS (Bitfield-Mask: 0x0f)               */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_US_T_PL_Pos (16UL)             /*!< OTPC_TIM1_US_T_PL (Bit 16)                            */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_US_T_PL_Msk (0xf0000UL)        /*!< OTPC_TIM1_US_T_PL (Bitfield-Mask: 0x0f)               */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_RD_Pos (12UL)             /*!< OTPC_TIM1_CC_T_RD (Bit 12)                            */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_RD_Msk (0xf000UL)         /*!< OTPC_TIM1_CC_T_RD (Bitfield-Mask: 0x0f)               */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_20NS_Pos (8UL)            /*!< OTPC_TIM1_CC_T_20NS (Bit 8)                           */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_20NS_Msk (0x700UL)        /*!< OTPC_TIM1_CC_T_20NS (Bitfield-Mask: 0x07)             */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_1US_Pos (0UL)             /*!< OTPC_TIM1_CC_T_1US (Bit 0)                            */
#define OTPC_OTPC_TIM1_REG_OTPC_TIM1_CC_T_1US_Msk (0xffUL)          /*!< OTPC_TIM1_CC_T_1US (Bitfield-Mask: 0xff)              */
/* =====================================================  OTPC_TIM2_REG  ===================================================== */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_ADD_CC_EN_Pos (31UL)        /*!< OTPC_TIM2_US_ADD_CC_EN (Bit 31)                       */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_ADD_CC_EN_Msk (0x80000000UL) /*!< OTPC_TIM2_US_ADD_CC_EN (Bitfield-Mask: 0x01)         */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_SAS_Pos (29UL)            /*!< OTPC_TIM2_US_T_SAS (Bit 29)                           */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_SAS_Msk (0x60000000UL)    /*!< OTPC_TIM2_US_T_SAS (Bitfield-Mask: 0x03)              */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PPH_Pos (24UL)            /*!< OTPC_TIM2_US_T_PPH (Bit 24)                           */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PPH_Msk (0x1f000000UL)    /*!< OTPC_TIM2_US_T_PPH (Bitfield-Mask: 0x1f)              */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_VDS_Pos (21UL)            /*!< OTPC_TIM2_US_T_VDS (Bit 21)                           */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_VDS_Msk (0xe00000UL)      /*!< OTPC_TIM2_US_T_VDS (Bitfield-Mask: 0x07)              */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PPS_Pos (16UL)            /*!< OTPC_TIM2_US_T_PPS (Bit 16)                           */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PPS_Msk (0x1f0000UL)      /*!< OTPC_TIM2_US_T_PPS (Bitfield-Mask: 0x1f)              */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PPR_Pos (8UL)             /*!< OTPC_TIM2_US_T_PPR (Bit 8)                            */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PPR_Msk (0x7f00UL)        /*!< OTPC_TIM2_US_T_PPR (Bitfield-Mask: 0x7f)              */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PWI_Pos (5UL)             /*!< OTPC_TIM2_US_T_PWI (Bit 5)                            */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PWI_Msk (0xe0UL)          /*!< OTPC_TIM2_US_T_PWI (Bitfield-Mask: 0x07)              */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PW_Pos (0UL)              /*!< OTPC_TIM2_US_T_PW (Bit 0)                             */
#define OTPC_OTPC_TIM2_REG_OTPC_TIM2_US_T_PW_Msk (0x1fUL)           /*!< OTPC_TIM2_US_T_PW (Bitfield-Mask: 0x1f)               */


/* =========================================================================================================================== */
/* ================                                           PCM1                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  PCM1_CTRL_REG  ===================================================== */
#define PCM1_PCM1_CTRL_REG_PCM_FSC_DIV_Pos (20UL)                   /*!< PCM_FSC_DIV (Bit 20)                                  */
#define PCM1_PCM1_CTRL_REG_PCM_FSC_DIV_Msk (0xfff00000UL)           /*!< PCM_FSC_DIV (Bitfield-Mask: 0xfff)                    */
#define PCM1_PCM1_CTRL_REG_PCM_FSC_EDGE_Pos (16UL)                  /*!< PCM_FSC_EDGE (Bit 16)                                 */
#define PCM1_PCM1_CTRL_REG_PCM_FSC_EDGE_Msk (0x10000UL)             /*!< PCM_FSC_EDGE (Bitfield-Mask: 0x01)                    */
#define PCM1_PCM1_CTRL_REG_PCM_CH_DEL_Pos (11UL)                    /*!< PCM_CH_DEL (Bit 11)                                   */
#define PCM1_PCM1_CTRL_REG_PCM_CH_DEL_Msk (0xf800UL)                /*!< PCM_CH_DEL (Bitfield-Mask: 0x1f)                      */
#define PCM1_PCM1_CTRL_REG_PCM_CLK_BIT_Pos (10UL)                   /*!< PCM_CLK_BIT (Bit 10)                                  */
#define PCM1_PCM1_CTRL_REG_PCM_CLK_BIT_Msk (0x400UL)                /*!< PCM_CLK_BIT (Bitfield-Mask: 0x01)                     */
#define PCM1_PCM1_CTRL_REG_PCM_FSCINV_Pos (9UL)                     /*!< PCM_FSCINV (Bit 9)                                    */
#define PCM1_PCM1_CTRL_REG_PCM_FSCINV_Msk (0x200UL)                 /*!< PCM_FSCINV (Bitfield-Mask: 0x01)                      */
#define PCM1_PCM1_CTRL_REG_PCM_CLKINV_Pos (8UL)                     /*!< PCM_CLKINV (Bit 8)                                    */
#define PCM1_PCM1_CTRL_REG_PCM_CLKINV_Msk (0x100UL)                 /*!< PCM_CLKINV (Bitfield-Mask: 0x01)                      */
#define PCM1_PCM1_CTRL_REG_PCM_PPOD_Pos   (7UL)                     /*!< PCM_PPOD (Bit 7)                                      */
#define PCM1_PCM1_CTRL_REG_PCM_PPOD_Msk   (0x80UL)                  /*!< PCM_PPOD (Bitfield-Mask: 0x01)                        */
#define PCM1_PCM1_CTRL_REG_PCM_FSCDEL_Pos (6UL)                     /*!< PCM_FSCDEL (Bit 6)                                    */
#define PCM1_PCM1_CTRL_REG_PCM_FSCDEL_Msk (0x40UL)                  /*!< PCM_FSCDEL (Bitfield-Mask: 0x01)                      */
#define PCM1_PCM1_CTRL_REG_PCM_FSCLEN_Pos (2UL)                     /*!< PCM_FSCLEN (Bit 2)                                    */
#define PCM1_PCM1_CTRL_REG_PCM_FSCLEN_Msk (0x3cUL)                  /*!< PCM_FSCLEN (Bitfield-Mask: 0x0f)                      */
#define PCM1_PCM1_CTRL_REG_PCM_MASTER_Pos (1UL)                     /*!< PCM_MASTER (Bit 1)                                    */
#define PCM1_PCM1_CTRL_REG_PCM_MASTER_Msk (0x2UL)                   /*!< PCM_MASTER (Bitfield-Mask: 0x01)                      */
#define PCM1_PCM1_CTRL_REG_PCM_EN_Pos     (0UL)                     /*!< PCM_EN (Bit 0)                                        */
#define PCM1_PCM1_CTRL_REG_PCM_EN_Msk     (0x1UL)                   /*!< PCM_EN (Bitfield-Mask: 0x01)                          */
/* =====================================================  PCM1_IN1_REG  ====================================================== */
#define PCM1_PCM1_IN1_REG_PCM_IN_Pos      (0UL)                     /*!< PCM_IN (Bit 0)                                        */
#define PCM1_PCM1_IN1_REG_PCM_IN_Msk      (0xffffffffUL)            /*!< PCM_IN (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  PCM1_IN2_REG  ====================================================== */
#define PCM1_PCM1_IN2_REG_PCM_IN_Pos      (0UL)                     /*!< PCM_IN (Bit 0)                                        */
#define PCM1_PCM1_IN2_REG_PCM_IN_Msk      (0xffffffffUL)            /*!< PCM_IN (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  PCM1_OUT1_REG  ===================================================== */
#define PCM1_PCM1_OUT1_REG_PCM_OUT_Pos    (0UL)                     /*!< PCM_OUT (Bit 0)                                       */
#define PCM1_PCM1_OUT1_REG_PCM_OUT_Msk    (0xffffffffUL)            /*!< PCM_OUT (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  PCM1_OUT2_REG  ===================================================== */
#define PCM1_PCM1_OUT2_REG_PCM_OUT_Pos    (0UL)                     /*!< PCM_OUT (Bit 0)                                       */
#define PCM1_PCM1_OUT2_REG_PCM_OUT_Msk    (0xffffffffUL)            /*!< PCM_OUT (Bitfield-Mask: 0xffffffff)                   */


/* =========================================================================================================================== */
/* ================                                            PDC                                            ================ */
/* =========================================================================================================================== */

