antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define PDC_PDC_CTRL7_REG_TRIG_SELECT_Msk (0x3UL)                   /*!< TRIG_SELECT (Bitfield-Mask: 0x03)                     */
/* =====================================================  PDC_CTRL8_REG  ===================================================== */
#define PDC_PDC_CTRL8_REG_PDC_MASTER_Pos  (11UL)                    /*!< PDC_MASTER (Bit 11)                                   */
#define PDC_PDC_CTRL8_REG_PDC_MASTER_Msk  (0x1800UL)                /*!< PDC_MASTER (Bitfield-Mask: 0x03)                      */
#define PDC_PDC_CTRL8_REG_EN_SNC_Pos      (10UL)                    /*!< EN_SNC (Bit 10)                                       */
#define PDC_PDC_CTRL8_REG_EN_SNC_Msk      (0x400UL)                 /*!< EN_SNC (Bitfield-Mask: 0x01)                          */
#define PDC_PDC_CTRL8_REG_EN_TMR_Pos      (8UL)                     /*!< EN_TMR (Bit 8)                                        */
#define PDC_PDC_CTRL8_REG_EN_TMR_Msk      (0x100UL)                 /*!< EN_TMR (Bitfield-Mask: 0x01)                          */
#define PDC_PDC_CTRL8_REG_EN_XTAL_Pos     (7UL)                     /*!< EN_XTAL (Bit 7)                                       */
#define PDC_PDC_CTRL8_REG_EN_XTAL_Msk     (0x80UL)                  /*!< EN_XTAL (Bitfield-Mask: 0x01)                         */
#define PDC_PDC_CTRL8_REG_TRIG_ID_Pos     (2UL)                     /*!< TRIG_ID (Bit 2)                                       */
#define PDC_PDC_CTRL8_REG_TRIG_ID_Msk     (0x7cUL)                  /*!< TRIG_ID (Bitfield-Mask: 0x1f)                         */
#define PDC_PDC_CTRL8_REG_TRIG_SELECT_Pos (0UL)                     /*!< TRIG_SELECT (Bit 0)                                   */
#define PDC_PDC_CTRL8_REG_TRIG_SELECT_Msk (0x3UL)                   /*!< TRIG_SELECT (Bitfield-Mask: 0x03)                     */
/* =====================================================  PDC_CTRL9_REG  ===================================================== */
#define PDC_PDC_CTRL9_REG_PDC_MASTER_Pos  (11UL)                    /*!< PDC_MASTER (Bit 11)                                   */
#define PDC_PDC_CTRL9_REG_PDC_MASTER_Msk  (0x1800UL)                /*!< PDC_MASTER (Bitfield-Mask: 0x03)                      */
#define PDC_PDC_CTRL9_REG_EN_SNC_Pos      (10UL)                    /*!< EN_SNC (Bit 10)                                       */
#define PDC_PDC_CTRL9_REG_EN_SNC_Msk      (0x400UL)                 /*!< EN_SNC (Bitfield-Mask: 0x01)                          */
#define PDC_PDC_CTRL9_REG_EN_TMR_Pos      (8UL)                     /*!< EN_TMR (Bit 8)                                        */
#define PDC_PDC_CTRL9_REG_EN_TMR_Msk      (0x100UL)                 /*!< EN_TMR (Bitfield-Mask: 0x01)                          */
#define PDC_PDC_CTRL9_REG_EN_XTAL_Pos     (7UL)                     /*!< EN_XTAL (Bit 7)                                       */
#define PDC_PDC_CTRL9_REG_EN_XTAL_Msk     (0x80UL)                  /*!< EN_XTAL (Bitfield-Mask: 0x01)                         */
#define PDC_PDC_CTRL9_REG_TRIG_ID_Pos     (2UL)                     /*!< TRIG_ID (Bit 2)                                       */
#define PDC_PDC_CTRL9_REG_TRIG_ID_Msk     (0x7cUL)                  /*!< TRIG_ID (Bitfield-Mask: 0x1f)                         */
#define PDC_PDC_CTRL9_REG_TRIG_SELECT_Pos (0UL)                     /*!< TRIG_SELECT (Bit 0)                                   */
#define PDC_PDC_CTRL9_REG_TRIG_SELECT_Msk (0x3UL)                   /*!< TRIG_SELECT (Bitfield-Mask: 0x03)                     */
/* =================================================  PDC_PENDING_CM33_REG  ================================================== */
#define PDC_PDC_PENDING_CM33_REG_PDC_PENDING_Pos (0UL)              /*!< PDC_PENDING (Bit 0)                                   */
#define PDC_PDC_PENDING_CM33_REG_PDC_PENDING_Msk (0xffffUL)         /*!< PDC_PENDING (Bitfield-Mask: 0xffff)                   */
/* =================================================  PDC_PENDING_CMAC_REG  ================================================== */
#define PDC_PDC_PENDING_CMAC_REG_PDC_PENDING_Pos (0UL)              /*!< PDC_PENDING (Bit 0)                                   */
#define PDC_PDC_PENDING_CMAC_REG_PDC_PENDING_Msk (0xffffUL)         /*!< PDC_PENDING (Bitfield-Mask: 0xffff)                   */
/* ====================================================  PDC_PENDING_REG  ==================================================== */
#define PDC_PDC_PENDING_REG_PDC_PENDING_Pos (0UL)                   /*!< PDC_PENDING (Bit 0)                                   */
#define PDC_PDC_PENDING_REG_PDC_PENDING_Msk (0xffffUL)              /*!< PDC_PENDING (Bitfield-Mask: 0xffff)                   */
/* ==================================================  PDC_PENDING_SNC_REG  ================================================== */
#define PDC_PDC_PENDING_SNC_REG_PDC_PENDING_Pos (0UL)               /*!< PDC_PENDING (Bit 0)                                   */
#define PDC_PDC_PENDING_SNC_REG_PDC_PENDING_Msk (0xffffUL)          /*!< PDC_PENDING (Bitfield-Mask: 0xffff)                   */
/* ==================================================  PDC_SET_PENDING_REG  ================================================== */
#define PDC_PDC_SET_PENDING_REG_PDC_SET_PENDING_Pos (0UL)           /*!< PDC_SET_PENDING (Bit 0)                               */
#define PDC_PDC_SET_PENDING_REG_PDC_SET_PENDING_Msk (0x1fUL)        /*!< PDC_SET_PENDING (Bitfield-Mask: 0x1f)                 */


/* =========================================================================================================================== */
/* ================                                          PWMLED                                           ================ */
/* =========================================================================================================================== */

/* ===================================================  LED1_PWM_CONF_REG  =================================================== */
#define PWMLED_LED1_PWM_CONF_REG_PWMLED_START_CYCLE_Pos (12UL)      /*!< PWMLED_START_CYCLE (Bit 12)                           */
#define PWMLED_LED1_PWM_CONF_REG_PWMLED_START_CYCLE_Msk (0xfff000UL) /*!< PWMLED_START_CYCLE (Bitfield-Mask: 0xfff)            */
#define PWMLED_LED1_PWM_CONF_REG_PWMLED_STOP_CYCLE_Pos (0UL)        /*!< PWMLED_STOP_CYCLE (Bit 0)                             */
#define PWMLED_LED1_PWM_CONF_REG_PWMLED_STOP_CYCLE_Msk (0xfffUL)    /*!< PWMLED_STOP_CYCLE (Bitfield-Mask: 0xfff)              */
/* ===================================================  LED2_PWM_CONF_REG  =================================================== */
#define PWMLED_LED2_PWM_CONF_REG_PWMLED_START_CYCLE_Pos (12UL)      /*!< PWMLED_START_CYCLE (Bit 12)                           */
#define PWMLED_LED2_PWM_CONF_REG_PWMLED_START_CYCLE_Msk (0xfff000UL) /*!< PWMLED_START_CYCLE (Bitfield-Mask: 0xfff)            */
#define PWMLED_LED2_PWM_CONF_REG_PWMLED_STOP_CYCLE_Pos (0UL)        /*!< PWMLED_STOP_CYCLE (Bit 0)                             */
#define PWMLED_LED2_PWM_CONF_REG_PWMLED_STOP_CYCLE_Msk (0xfffUL)    /*!< PWMLED_STOP_CYCLE (Bitfield-Mask: 0xfff)              */
/* ===================================================  LED3_PWM_CONF_REG  =================================================== */
#define PWMLED_LED3_PWM_CONF_REG_PWMLED_START_CYCLE_Pos (12UL)      /*!< PWMLED_START_CYCLE (Bit 12)                           */
#define PWMLED_LED3_PWM_CONF_REG_PWMLED_START_CYCLE_Msk (0xfff000UL) /*!< PWMLED_START_CYCLE (Bitfield-Mask: 0xfff)            */
#define PWMLED_LED3_PWM_CONF_REG_PWMLED_STOP_CYCLE_Pos (0UL)        /*!< PWMLED_STOP_CYCLE (Bit 0)                             */
#define PWMLED_LED3_PWM_CONF_REG_PWMLED_STOP_CYCLE_Msk (0xfffUL)    /*!< PWMLED_STOP_CYCLE (Bitfield-Mask: 0xfff)              */
/* ===================================================  LEDS_DRV_CTRL_REG  =================================================== */
#define PWMLED_LEDS_DRV_CTRL_REG_LED3_EN_Pos (2UL)                  /*!< LED3_EN (Bit 2)                                       */
#define PWMLED_LEDS_DRV_CTRL_REG_LED3_EN_Msk (0x4UL)                /*!< LED3_EN (Bitfield-Mask: 0x01)                         */
#define PWMLED_LEDS_DRV_CTRL_REG_LED2_EN_Pos (1UL)                  /*!< LED2_EN (Bit 1)                                       */
#define PWMLED_LEDS_DRV_CTRL_REG_LED2_EN_Msk (0x2UL)                /*!< LED2_EN (Bitfield-Mask: 0x01)                         */
#define PWMLED_LEDS_DRV_CTRL_REG_LED1_EN_Pos (0UL)                  /*!< LED1_EN (Bit 0)                                       */
#define PWMLED_LEDS_DRV_CTRL_REG_LED1_EN_Msk (0x1UL)                /*!< LED1_EN (Bitfield-Mask: 0x01)                         */
/* ==================================================  LEDS_FREQUENCY_REG  =================================================== */
#define PWMLED_LEDS_FREQUENCY_REG_PWM_LEDS_PRESCALE_Pos (12UL)      /*!< PWM_LEDS_PRESCALE (Bit 12)                            */
#define PWMLED_LEDS_FREQUENCY_REG_PWM_LEDS_PRESCALE_Msk (0xff000UL) /*!< PWM_LEDS_PRESCALE (Bitfield-Mask: 0xff)               */
#define PWMLED_LEDS_FREQUENCY_REG_PWM_LEDS_PERIOD_Pos (0UL)         /*!< PWM_LEDS_PERIOD (Bit 0)                               */
#define PWMLED_LEDS_FREQUENCY_REG_PWM_LEDS_PERIOD_Msk (0xfffUL)     /*!< PWM_LEDS_PERIOD (Bitfield-Mask: 0xfff)                */
/* ===================================================  LEDS_PWM_CTRL_REG  =================================================== */
#define PWMLED_LEDS_PWM_CTRL_REG_PWM_LEDS_HW_PAUSE_ENABLE_Pos (4UL) /*!< PWM_LEDS_HW_PAUSE_ENABLE (Bit 4)                      */
#define PWMLED_LEDS_PWM_CTRL_REG_PWM_LEDS_HW_PAUSE_ENABLE_Msk (0x10UL) /*!< PWM_LEDS_HW_PAUSE_ENABLE (Bitfield-Mask: 0x01)     */
#define PWMLED_LEDS_PWM_CTRL_REG_PWM_LEDS_SW_PAUSE_Pos (3UL)        /*!< PWM_LEDS_SW_PAUSE (Bit 3)                             */
#define PWMLED_LEDS_PWM_CTRL_REG_PWM_LEDS_SW_PAUSE_Msk (0x8UL)      /*!< PWM_LEDS_SW_PAUSE (Bitfield-Mask: 0x01)               */
#define PWMLED_LEDS_PWM_CTRL_REG_LED3_PWM_ENABLE_Pos (2UL)          /*!< LED3_PWM_ENABLE (Bit 2)                               */
#define PWMLED_LEDS_PWM_CTRL_REG_LED3_PWM_ENABLE_Msk (0x4UL)        /*!< LED3_PWM_ENABLE (Bitfield-Mask: 0x01)                 */
#define PWMLED_LEDS_PWM_CTRL_REG_LED2_PWM_ENABLE_Pos (1UL)          /*!< LED2_PWM_ENABLE (Bit 1)                               */
#define PWMLED_LEDS_PWM_CTRL_REG_LED2_PWM_ENABLE_Msk (0x2UL)        /*!< LED2_PWM_ENABLE (Bitfield-Mask: 0x01)                 */
#define PWMLED_LEDS_PWM_CTRL_REG_LED1_PWM_ENABLE_Pos (0UL)          /*!< LED1_PWM_ENABLE (Bit 0)                               */
#define PWMLED_LEDS_PWM_CTRL_REG_LED1_PWM_ENABLE_Msk (0x1UL)        /*!< LED1_PWM_ENABLE (Bitfield-Mask: 0x01)                 */
/* ====================================================  LEDS_STATUS_REG  ==================================================== */
#define PWMLED_LEDS_STATUS_REG_LED_FREQUENCY_BUSY_Pos (3UL)         /*!< LED_FREQUENCY_BUSY (Bit 3)                            */
#define PWMLED_LEDS_STATUS_REG_LED_FREQUENCY_BUSY_Msk (0x8UL)       /*!< LED_FREQUENCY_BUSY (Bitfield-Mask: 0x01)              */
#define PWMLED_LEDS_STATUS_REG_LED3_CONF_BUSY_Pos (2UL)             /*!< LED3_CONF_BUSY (Bit 2)                                */
#define PWMLED_LEDS_STATUS_REG_LED3_CONF_BUSY_Msk (0x4UL)           /*!< LED3_CONF_BUSY (Bitfield-Mask: 0x01)                  */
#define PWMLED_LEDS_STATUS_REG_LED2_CONF_BUSY_Pos (1UL)             /*!< LED2_CONF_BUSY (Bit 1)                                */
#define PWMLED_LEDS_STATUS_REG_LED2_CONF_BUSY_Msk (0x2UL)           /*!< LED2_CONF_BUSY (Bitfield-Mask: 0x01)                  */
#define PWMLED_LEDS_STATUS_REG_LED1_CONF_BUSY_Pos (0UL)             /*!< LED1_CONF_BUSY (Bit 0)                                */
#define PWMLED_LEDS_STATUS_REG_LED1_CONF_BUSY_Msk (0x1UL)           /*!< LED1_CONF_BUSY (Bitfield-Mask: 0x01)                  */
/* ===================================================  LED_CURR_TRIM_REG  =================================================== */
#define PWMLED_LED_CURR_TRIM_REG_LED3_CURR_TRIM_Pos (8UL)           /*!< LED3_CURR_TRIM (Bit 8)                                */
#define PWMLED_LED_CURR_TRIM_REG_LED3_CURR_TRIM_Msk (0xf00UL)       /*!< LED3_CURR_TRIM (Bitfield-Mask: 0x0f)                  */
#define PWMLED_LED_CURR_TRIM_REG_LED2_CURR_TRIM_Pos (4UL)           /*!< LED2_CURR_TRIM (Bit 4)                                */
#define PWMLED_LED_CURR_TRIM_REG_LED2_CURR_TRIM_Msk (0xf0UL)        /*!< LED2_CURR_TRIM (Bitfield-Mask: 0x0f)                  */
#define PWMLED_LED_CURR_TRIM_REG_LED1_CURR_TRIM_Pos (0UL)           /*!< LED1_CURR_TRIM (Bit 0)                                */
#define PWMLED_LED_CURR_TRIM_REG_LED1_CURR_TRIM_Msk (0xfUL)         /*!< LED1_CURR_TRIM (Bitfield-Mask: 0x0f)                  */
/* ===================================================  LED_LOAD_SEL_REG  ==================================================== */
#define PWMLED_LED_LOAD_SEL_REG_LED3_LOAD_SEL_Pos (6UL)             /*!< LED3_LOAD_SEL (Bit 6)                                 */
#define PWMLED_LED_LOAD_SEL_REG_LED3_LOAD_SEL_Msk (0x1c0UL)         /*!< LED3_LOAD_SEL (Bitfield-Mask: 0x07)                   */
#define PWMLED_LED_LOAD_SEL_REG_LED2_LOAD_SEL_Pos (3UL)             /*!< LED2_LOAD_SEL (Bit 3)                                 */
#define PWMLED_LED_LOAD_SEL_REG_LED2_LOAD_SEL_Msk (0x38UL)          /*!< LED2_LOAD_SEL (Bitfield-Mask: 0x07)                   */
#define PWMLED_LED_LOAD_SEL_REG_LED1_LOAD_SEL_Pos (0UL)             /*!< LED1_LOAD_SEL (Bit 0)                                 */
#define PWMLED_LED_LOAD_SEL_REG_LED1_LOAD_SEL_Msk (0x7UL)           /*!< LED1_LOAD_SEL (Bitfield-Mask: 0x07)                   */


/* =========================================================================================================================== */
/* ================                                           QSPIC                                           ================ */
/* =========================================================================================================================== */

