antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* =================================================  SDADC_AUDIO_FILT_REG  ================================================== */
#define SDADC_SDADC_AUDIO_FILT_REG_SDADC_CIC_OFFSET_Pos (0UL)       /*!< SDADC_CIC_OFFSET (Bit 0)                              */
#define SDADC_SDADC_AUDIO_FILT_REG_SDADC_CIC_OFFSET_Msk (0x1fffffUL) /*!< SDADC_CIC_OFFSET (Bitfield-Mask: 0x1fffff)           */
/* ==================================================  SDADC_CLEAR_INT_REG  ================================================== */
#define SDADC_SDADC_CLEAR_INT_REG_SDADC_CLR_INT_Pos (0UL)           /*!< SDADC_CLR_INT (Bit 0)                                 */
#define SDADC_SDADC_CLEAR_INT_REG_SDADC_CLR_INT_Msk (0xffffffffUL)  /*!< SDADC_CLR_INT (Bitfield-Mask: 0xffffffff)             */
/* ====================================================  SDADC_CTRL_REG  ===================================================== */
#define SDADC_SDADC_CTRL_REG_SDADC_DMA_EN_Pos (18UL)                /*!< SDADC_DMA_EN (Bit 18)                                 */
#define SDADC_SDADC_CTRL_REG_SDADC_DMA_EN_Msk (0x40000UL)           /*!< SDADC_DMA_EN (Bitfield-Mask: 0x01)                    */
#define SDADC_SDADC_CTRL_REG_SDADC_MINT_Pos (17UL)                  /*!< SDADC_MINT (Bit 17)                                   */
#define SDADC_SDADC_CTRL_REG_SDADC_MINT_Msk (0x20000UL)             /*!< SDADC_MINT (Bitfield-Mask: 0x01)                      */
#define SDADC_SDADC_CTRL_REG_SDADC_INT_Pos (16UL)                   /*!< SDADC_INT (Bit 16)                                    */
#define SDADC_SDADC_CTRL_REG_SDADC_INT_Msk (0x10000UL)              /*!< SDADC_INT (Bitfield-Mask: 0x01)                       */
#define SDADC_SDADC_CTRL_REG_SDADC_LDO_OK_Pos (15UL)                /*!< SDADC_LDO_OK (Bit 15)                                 */
#define SDADC_SDADC_CTRL_REG_SDADC_LDO_OK_Msk (0x8000UL)            /*!< SDADC_LDO_OK (Bitfield-Mask: 0x01)                    */
#define SDADC_SDADC_CTRL_REG_SDADC_AUDIO_FILTER_EN_Pos (12UL)       /*!< SDADC_AUDIO_FILTER_EN (Bit 12)                        */
#define SDADC_SDADC_CTRL_REG_SDADC_AUDIO_FILTER_EN_Msk (0x1000UL)   /*!< SDADC_AUDIO_FILTER_EN (Bitfield-Mask: 0x01)           */
#define SDADC_SDADC_CTRL_REG_SDADC_RESULT_MODE_Pos (10UL)           /*!< SDADC_RESULT_MODE (Bit 10)                            */
#define SDADC_SDADC_CTRL_REG_SDADC_RESULT_MODE_Msk (0xc00UL)        /*!< SDADC_RESULT_MODE (Bitfield-Mask: 0x03)               */
#define SDADC_SDADC_CTRL_REG_SDADC_START_Pos (1UL)                  /*!< SDADC_START (Bit 1)                                   */
#define SDADC_SDADC_CTRL_REG_SDADC_START_Msk (0x2UL)                /*!< SDADC_START (Bitfield-Mask: 0x01)                     */
#define SDADC_SDADC_CTRL_REG_SDADC_EN_Pos (0UL)                     /*!< SDADC_EN (Bit 0)                                      */
#define SDADC_SDADC_CTRL_REG_SDADC_EN_Msk (0x1UL)                   /*!< SDADC_EN (Bitfield-Mask: 0x01)                        */
/* ==================================================  SDADC_PGA_CTRL_REG  =================================================== */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_GAIN_Pos (9UL)                 /*!< PGA_GAIN (Bit 9)                                      */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_GAIN_Msk (0xe00UL)             /*!< PGA_GAIN (Bitfield-Mask: 0x07)                        */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_MODE_Pos (7UL)                 /*!< PGA_MODE (Bit 7)                                      */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_MODE_Msk (0x180UL)             /*!< PGA_MODE (Bitfield-Mask: 0x03)                        */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_MUTE_Pos (6UL)                 /*!< PGA_MUTE (Bit 6)                                      */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_MUTE_Msk (0x40UL)              /*!< PGA_MUTE (Bitfield-Mask: 0x01)                        */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_BIAS_Pos (3UL)                 /*!< PGA_BIAS (Bit 3)                                      */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_BIAS_Msk (0x38UL)              /*!< PGA_BIAS (Bitfield-Mask: 0x07)                        */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_SHORTIN_Pos (2UL)              /*!< PGA_SHORTIN (Bit 2)                                   */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_SHORTIN_Msk (0x4UL)            /*!< PGA_SHORTIN (Bitfield-Mask: 0x01)                     */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_EN_Pos (0UL)                   /*!< PGA_EN (Bit 0)                                        */
#define SDADC_SDADC_PGA_CTRL_REG_PGA_EN_Msk (0x3UL)                 /*!< PGA_EN (Bitfield-Mask: 0x03)                          */
/* ===================================================  SDADC_RESULT_REG  ==================================================== */
#define SDADC_SDADC_RESULT_REG_SDADC_VAL_Pos (0UL)                  /*!< SDADC_VAL (Bit 0)                                     */
#define SDADC_SDADC_RESULT_REG_SDADC_VAL_Msk (0xffffUL)             /*!< SDADC_VAL (Bitfield-Mask: 0xffff)                     */


/* =========================================================================================================================== */
/* ================                                            SNC                                            ================ */
/* =========================================================================================================================== */

/* ====================================================  SNC_STATUS_REG  ===================================================== */
#define SNC_SNC_STATUS_REG_WDOG_EARLY_NOTICE_Pos (4UL)              /*!< WDOG_EARLY_NOTICE (Bit 4)                             */
#define SNC_SNC_STATUS_REG_WDOG_EARLY_NOTICE_Msk (0x10UL)           /*!< WDOG_EARLY_NOTICE (Bitfield-Mask: 0x01)               */
#define SNC_SNC_STATUS_REG_WDOG_HAS_EXPIRED_Pos (3UL)               /*!< WDOG_HAS_EXPIRED (Bit 3)                              */
#define SNC_SNC_STATUS_REG_WDOG_HAS_EXPIRED_Msk (0x8UL)             /*!< WDOG_HAS_EXPIRED (Bitfield-Mask: 0x01)                */
#define SNC_SNC_STATUS_REG_CPU_LOCKED_Pos (2UL)                     /*!< CPU_LOCKED (Bit 2)                                    */
#define SNC_SNC_STATUS_REG_CPU_LOCKED_Msk (0x4UL)                   /*!< CPU_LOCKED (Bitfield-Mask: 0x01)                      */
#define SNC_SNC_STATUS_REG_CPU_IDLE_Pos   (1UL)                     /*!< CPU_IDLE (Bit 1)                                      */
#define SNC_SNC_STATUS_REG_CPU_IDLE_Msk   (0x2UL)                   /*!< CPU_IDLE (Bitfield-Mask: 0x01)                        */
#define SNC_SNC_STATUS_REG_CPU_HALTED_Pos (0UL)                     /*!< CPU_HALTED (Bit 0)                                    */
#define SNC_SNC_STATUS_REG_CPU_HALTED_Msk (0x1UL)                   /*!< CPU_HALTED (Bitfield-Mask: 0x01)                      */
/* =====================================================  SNC_WDOG_REG  ====================================================== */
#define SNC_SNC_WDOG_REG_SYS2SNC_WDOG_FREEZE_Pos (31UL)             /*!< SYS2SNC_WDOG_FREEZE (Bit 31)                          */
#define SNC_SNC_WDOG_REG_SYS2SNC_WDOG_FREEZE_Msk (0x80000000UL)     /*!< SYS2SNC_WDOG_FREEZE (Bitfield-Mask: 0x01)             */
#define SNC_SNC_WDOG_REG_SYS2SNC_WDOG_FREEZE_DIS_Pos (30UL)         /*!< SYS2SNC_WDOG_FREEZE_DIS (Bit 30)                      */
#define SNC_SNC_WDOG_REG_SYS2SNC_WDOG_FREEZE_DIS_Msk (0x40000000UL) /*!< SYS2SNC_WDOG_FREEZE_DIS (Bitfield-Mask: 0x01)         */
#define SNC_SNC_WDOG_REG_SNC_WDOG_EXPIRE_Pos (29UL)                 /*!< SNC_WDOG_EXPIRE (Bit 29)                              */
#define SNC_SNC_WDOG_REG_SNC_WDOG_EXPIRE_Msk (0x20000000UL)         /*!< SNC_WDOG_EXPIRE (Bitfield-Mask: 0x01)                 */
#define SNC_SNC_WDOG_REG_SNC_WDOG_SYS_RST_REQ_Pos (28UL)            /*!< SNC_WDOG_SYS_RST_REQ (Bit 28)                         */
#define SNC_SNC_WDOG_REG_SNC_WDOG_SYS_RST_REQ_Msk (0x10000000UL)    /*!< SNC_WDOG_SYS_RST_REQ (Bitfield-Mask: 0x01)            */
#define SNC_SNC_WDOG_REG_SNC_WDOG_WRITE_VALID_Pos (17UL)            /*!< SNC_WDOG_WRITE_VALID (Bit 17)                         */
#define SNC_SNC_WDOG_REG_SNC_WDOG_WRITE_VALID_Msk (0x60000UL)       /*!< SNC_WDOG_WRITE_VALID (Bitfield-Mask: 0x03)            */
#define SNC_SNC_WDOG_REG_SNC_WDOG_CNT_Pos (0UL)                     /*!< SNC_WDOG_CNT (Bit 0)                                  */
#define SNC_SNC_WDOG_REG_SNC_WDOG_CNT_Msk (0x1fffUL)                /*!< SNC_WDOG_CNT (Bitfield-Mask: 0x1fff)                  */


/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

