antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* =================================================  SRC2_COEF0A_SET1_REG  ================================================== */
#define SRC2_SRC2_COEF0A_SET1_REG_SRC_COEF10_Pos (0UL)              /*!< SRC_COEF10 (Bit 0)                                    */
#define SRC2_SRC2_COEF0A_SET1_REG_SRC_COEF10_Msk (0xffffUL)         /*!< SRC_COEF10 (Bitfield-Mask: 0xffff)                    */
/* =================================================  SRC2_COEF10_SET1_REG  ================================================== */
#define SRC2_SRC2_COEF10_SET1_REG_SRC_COEF1_Pos (16UL)              /*!< SRC_COEF1 (Bit 16)                                    */
#define SRC2_SRC2_COEF10_SET1_REG_SRC_COEF1_Msk (0xffff0000UL)      /*!< SRC_COEF1 (Bitfield-Mask: 0xffff)                     */
#define SRC2_SRC2_COEF10_SET1_REG_SRC_COEF0_Pos (0UL)               /*!< SRC_COEF0 (Bit 0)                                     */
#define SRC2_SRC2_COEF10_SET1_REG_SRC_COEF0_Msk (0xffffUL)          /*!< SRC_COEF0 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC2_COEF32_SET1_REG  ================================================== */
#define SRC2_SRC2_COEF32_SET1_REG_SRC_COEF3_Pos (16UL)              /*!< SRC_COEF3 (Bit 16)                                    */
#define SRC2_SRC2_COEF32_SET1_REG_SRC_COEF3_Msk (0xffff0000UL)      /*!< SRC_COEF3 (Bitfield-Mask: 0xffff)                     */
#define SRC2_SRC2_COEF32_SET1_REG_SRC_COEF2_Pos (0UL)               /*!< SRC_COEF2 (Bit 0)                                     */
#define SRC2_SRC2_COEF32_SET1_REG_SRC_COEF2_Msk (0xffffUL)          /*!< SRC_COEF2 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC2_COEF54_SET1_REG  ================================================== */
#define SRC2_SRC2_COEF54_SET1_REG_SRC_COEF5_Pos (16UL)              /*!< SRC_COEF5 (Bit 16)                                    */
#define SRC2_SRC2_COEF54_SET1_REG_SRC_COEF5_Msk (0xffff0000UL)      /*!< SRC_COEF5 (Bitfield-Mask: 0xffff)                     */
#define SRC2_SRC2_COEF54_SET1_REG_SRC_COEF4_Pos (0UL)               /*!< SRC_COEF4 (Bit 0)                                     */
#define SRC2_SRC2_COEF54_SET1_REG_SRC_COEF4_Msk (0xffffUL)          /*!< SRC_COEF4 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC2_COEF76_SET1_REG  ================================================== */
#define SRC2_SRC2_COEF76_SET1_REG_SRC_COEF7_Pos (16UL)              /*!< SRC_COEF7 (Bit 16)                                    */
#define SRC2_SRC2_COEF76_SET1_REG_SRC_COEF7_Msk (0xffff0000UL)      /*!< SRC_COEF7 (Bitfield-Mask: 0xffff)                     */
#define SRC2_SRC2_COEF76_SET1_REG_SRC_COEF6_Pos (0UL)               /*!< SRC_COEF6 (Bit 0)                                     */
#define SRC2_SRC2_COEF76_SET1_REG_SRC_COEF6_Msk (0xffffUL)          /*!< SRC_COEF6 (Bitfield-Mask: 0xffff)                     */
/* =================================================  SRC2_COEF98_SET1_REG  ================================================== */
#define SRC2_SRC2_COEF98_SET1_REG_SRC_COEF9_Pos (16UL)              /*!< SRC_COEF9 (Bit 16)                                    */
#define SRC2_SRC2_COEF98_SET1_REG_SRC_COEF9_Msk (0xffff0000UL)      /*!< SRC_COEF9 (Bitfield-Mask: 0xffff)                     */
#define SRC2_SRC2_COEF98_SET1_REG_SRC_COEF8_Pos (0UL)               /*!< SRC_COEF8 (Bit 0)                                     */
#define SRC2_SRC2_COEF98_SET1_REG_SRC_COEF8_Msk (0xffffUL)          /*!< SRC_COEF8 (Bitfield-Mask: 0xffff)                     */
/* =====================================================  SRC2_CTRL_REG  ===================================================== */
#define SRC2_SRC2_CTRL_REG_SRC_PDM_MODE_Pos (28UL)                  /*!< SRC_PDM_MODE (Bit 28)                                 */
#define SRC2_SRC2_CTRL_REG_SRC_PDM_MODE_Msk (0x30000000UL)          /*!< SRC_PDM_MODE (Bitfield-Mask: 0x03)                    */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_FLOWCLR_Pos (25UL)               /*!< SRC_OUT_FLOWCLR (Bit 25)                              */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_FLOWCLR_Msk (0x2000000UL)        /*!< SRC_OUT_FLOWCLR (Bitfield-Mask: 0x01)                 */
#define SRC2_SRC2_CTRL_REG_SRC_IN_FLOWCLR_Pos (24UL)                /*!< SRC_IN_FLOWCLR (Bit 24)                               */
#define SRC2_SRC2_CTRL_REG_SRC_IN_FLOWCLR_Msk (0x1000000UL)         /*!< SRC_IN_FLOWCLR (Bitfield-Mask: 0x01)                  */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_UNFLOW_Pos (23UL)                /*!< SRC_OUT_UNFLOW (Bit 23)                               */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_UNFLOW_Msk (0x800000UL)          /*!< SRC_OUT_UNFLOW (Bitfield-Mask: 0x01)                  */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_OVFLOW_Pos (22UL)                /*!< SRC_OUT_OVFLOW (Bit 22)                               */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_OVFLOW_Msk (0x400000UL)          /*!< SRC_OUT_OVFLOW (Bitfield-Mask: 0x01)                  */
#define SRC2_SRC2_CTRL_REG_SRC_IN_UNFLOW_Pos (21UL)                 /*!< SRC_IN_UNFLOW (Bit 21)                                */
#define SRC2_SRC2_CTRL_REG_SRC_IN_UNFLOW_Msk (0x200000UL)           /*!< SRC_IN_UNFLOW (Bitfield-Mask: 0x01)                   */
#define SRC2_SRC2_CTRL_REG_SRC_IN_OVFLOW_Pos (20UL)                 /*!< SRC_IN_OVFLOW (Bit 20)                                */
#define SRC2_SRC2_CTRL_REG_SRC_IN_OVFLOW_Msk (0x100000UL)           /*!< SRC_IN_OVFLOW (Bitfield-Mask: 0x01)                   */
#define SRC2_SRC2_CTRL_REG_SRC_RESYNC_Pos (19UL)                    /*!< SRC_RESYNC (Bit 19)                                   */
#define SRC2_SRC2_CTRL_REG_SRC_RESYNC_Msk (0x80000UL)               /*!< SRC_RESYNC (Bitfield-Mask: 0x01)                      */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_OK_Pos (18UL)                    /*!< SRC_OUT_OK (Bit 18)                                   */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_OK_Msk (0x40000UL)               /*!< SRC_OUT_OK (Bitfield-Mask: 0x01)                      */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_US_Pos (16UL)                    /*!< SRC_OUT_US (Bit 16)                                   */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_US_Msk (0x30000UL)               /*!< SRC_OUT_US (Bitfield-Mask: 0x03)                      */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_CAL_BYPASS_Pos (14UL)            /*!< SRC_OUT_CAL_BYPASS (Bit 14)                           */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_CAL_BYPASS_Msk (0x4000UL)        /*!< SRC_OUT_CAL_BYPASS (Bitfield-Mask: 0x01)              */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_AMODE_Pos (13UL)                 /*!< SRC_OUT_AMODE (Bit 13)                                */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_AMODE_Msk (0x2000UL)             /*!< SRC_OUT_AMODE (Bitfield-Mask: 0x01)                   */
#define SRC2_SRC2_CTRL_REG_SRC_PDM_OUT_INV_Pos (12UL)               /*!< SRC_PDM_OUT_INV (Bit 12)                              */
#define SRC2_SRC2_CTRL_REG_SRC_PDM_OUT_INV_Msk (0x1000UL)           /*!< SRC_PDM_OUT_INV (Bitfield-Mask: 0x01)                 */
#define SRC2_SRC2_CTRL_REG_SRC_FIFO_DIRECTION_Pos (11UL)            /*!< SRC_FIFO_DIRECTION (Bit 11)                           */
#define SRC2_SRC2_CTRL_REG_SRC_FIFO_DIRECTION_Msk (0x800UL)         /*!< SRC_FIFO_DIRECTION (Bitfield-Mask: 0x01)              */
#define SRC2_SRC2_CTRL_REG_SRC_FIFO_ENABLE_Pos (10UL)               /*!< SRC_FIFO_ENABLE (Bit 10)                              */
#define SRC2_SRC2_CTRL_REG_SRC_FIFO_ENABLE_Msk (0x400UL)            /*!< SRC_FIFO_ENABLE (Bitfield-Mask: 0x01)                 */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_DSD_MODE_Pos (9UL)               /*!< SRC_OUT_DSD_MODE (Bit 9)                              */
#define SRC2_SRC2_CTRL_REG_SRC_OUT_DSD_MODE_Msk (0x200UL)           /*!< SRC_OUT_DSD_MODE (Bitfield-Mask: 0x01)                */
#define SRC2_SRC2_CTRL_REG_SRC_IN_DSD_MODE_Pos (8UL)                /*!< SRC_IN_DSD_MODE (Bit 8)                               */
#define SRC2_SRC2_CTRL_REG_SRC_IN_DSD_MODE_Msk (0x100UL)            /*!< SRC_IN_DSD_MODE (Bitfield-Mask: 0x01)                 */
#define SRC2_SRC2_CTRL_REG_SRC_DITHER_DISABLE_Pos (7UL)             /*!< SRC_DITHER_DISABLE (Bit 7)                            */
#define SRC2_SRC2_CTRL_REG_SRC_DITHER_DISABLE_Msk (0x80UL)          /*!< SRC_DITHER_DISABLE (Bitfield-Mask: 0x01)              */
#define SRC2_SRC2_CTRL_REG_SRC_IN_OK_Pos  (6UL)                     /*!< SRC_IN_OK (Bit 6)                                     */
#define SRC2_SRC2_CTRL_REG_SRC_IN_OK_Msk  (0x40UL)                  /*!< SRC_IN_OK (Bitfield-Mask: 0x01)                       */
#define SRC2_SRC2_CTRL_REG_SRC_IN_DS_Pos  (4UL)                     /*!< SRC_IN_DS (Bit 4)                                     */
#define SRC2_SRC2_CTRL_REG_SRC_IN_DS_Msk  (0x30UL)                  /*!< SRC_IN_DS (Bitfield-Mask: 0x03)                       */
#define SRC2_SRC2_CTRL_REG_SRC_PDM_IN_INV_Pos (3UL)                 /*!< SRC_PDM_IN_INV (Bit 3)                                */
#define SRC2_SRC2_CTRL_REG_SRC_PDM_IN_INV_Msk (0x8UL)               /*!< SRC_PDM_IN_INV (Bitfield-Mask: 0x01)                  */
#define SRC2_SRC2_CTRL_REG_SRC_IN_CAL_BYPASS_Pos (2UL)              /*!< SRC_IN_CAL_BYPASS (Bit 2)                             */
#define SRC2_SRC2_CTRL_REG_SRC_IN_CAL_BYPASS_Msk (0x4UL)            /*!< SRC_IN_CAL_BYPASS (Bitfield-Mask: 0x01)               */
#define SRC2_SRC2_CTRL_REG_SRC_IN_AMODE_Pos (1UL)                   /*!< SRC_IN_AMODE (Bit 1)                                  */
#define SRC2_SRC2_CTRL_REG_SRC_IN_AMODE_Msk (0x2UL)                 /*!< SRC_IN_AMODE (Bitfield-Mask: 0x01)                    */
#define SRC2_SRC2_CTRL_REG_SRC_EN_Pos     (0UL)                     /*!< SRC_EN (Bit 0)                                        */
#define SRC2_SRC2_CTRL_REG_SRC_EN_Msk     (0x1UL)                   /*!< SRC_EN (Bitfield-Mask: 0x01)                          */
/* =====================================================  SRC2_IN1_REG  ====================================================== */
#define SRC2_SRC2_IN1_REG_SRC_IN_Pos      (0UL)                     /*!< SRC_IN (Bit 0)                                        */
#define SRC2_SRC2_IN1_REG_SRC_IN_Msk      (0xffffffffUL)            /*!< SRC_IN (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  SRC2_IN2_REG  ====================================================== */
#define SRC2_SRC2_IN2_REG_SRC_IN_Pos      (0UL)                     /*!< SRC_IN (Bit 0)                                        */
#define SRC2_SRC2_IN2_REG_SRC_IN_Msk      (0xffffffffUL)            /*!< SRC_IN (Bitfield-Mask: 0xffffffff)                    */
/* ====================================================  SRC2_IN_FS_REG  ===================================================== */
#define SRC2_SRC2_IN_FS_REG_SRC_IN_FS_Pos (0UL)                     /*!< SRC_IN_FS (Bit 0)                                     */
#define SRC2_SRC2_IN_FS_REG_SRC_IN_FS_Msk (0xffffffUL)              /*!< SRC_IN_FS (Bitfield-Mask: 0xffffff)                   */
/* =====================================================  SRC2_MUX_REG  ====================================================== */
#define SRC2_SRC2_MUX_REG_PDM1_MUX_IN_Pos (6UL)                     /*!< PDM1_MUX_IN (Bit 6)                                   */
#define SRC2_SRC2_MUX_REG_PDM1_MUX_IN_Msk (0x40UL)                  /*!< PDM1_MUX_IN (Bitfield-Mask: 0x01)                     */
#define SRC2_SRC2_MUX_REG_PDM_MUX_OUT_Pos (3UL)                     /*!< PDM_MUX_OUT (Bit 3)                                   */
#define SRC2_SRC2_MUX_REG_PDM_MUX_OUT_Msk (0x38UL)                  /*!< PDM_MUX_OUT (Bitfield-Mask: 0x07)                     */
#define SRC2_SRC2_MUX_REG_SRC2_MUX_IN_Pos (0UL)                     /*!< SRC2_MUX_IN (Bit 0)                                   */
#define SRC2_SRC2_MUX_REG_SRC2_MUX_IN_Msk (0x7UL)                   /*!< SRC2_MUX_IN (Bitfield-Mask: 0x07)                     */
/* =====================================================  SRC2_OUT1_REG  ===================================================== */
#define SRC2_SRC2_OUT1_REG_SRC_OUT_Pos    (0UL)                     /*!< SRC_OUT (Bit 0)                                       */
#define SRC2_SRC2_OUT1_REG_SRC_OUT_Msk    (0xffffffffUL)            /*!< SRC_OUT (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  SRC2_OUT2_REG  ===================================================== */
#define SRC2_SRC2_OUT2_REG_SRC_OUT_Pos    (0UL)                     /*!< SRC_OUT (Bit 0)                                       */
#define SRC2_SRC2_OUT2_REG_SRC_OUT_Msk    (0xffffffffUL)            /*!< SRC_OUT (Bitfield-Mask: 0xffffffff)                   */
/* ====================================================  SRC2_OUT_FS_REG  ==================================================== */
#define SRC2_SRC2_OUT_FS_REG_SRC_OUT_FS_Pos (0UL)                   /*!< SRC_OUT_FS (Bit 0)                                    */
#define SRC2_SRC2_OUT_FS_REG_SRC_OUT_FS_Msk (0xffffffUL)            /*!< SRC_OUT_FS (Bitfield-Mask: 0xffffff)                  */


/* =========================================================================================================================== */
/* ================                                         SYS_WDOG                                          ================ */
/* =========================================================================================================================== */

/* ===================================================  WATCHDOG_CTRL_REG  =================================================== */
#define SYS_WDOG_WATCHDOG_CTRL_REG_WRITE_BUSY_Pos (3UL)             /*!< WRITE_BUSY (Bit 3)                                    */
#define SYS_WDOG_WATCHDOG_CTRL_REG_WRITE_BUSY_Msk (0x8UL)           /*!< WRITE_BUSY (Bitfield-Mask: 0x01)                      */
#define SYS_WDOG_WATCHDOG_CTRL_REG_WDOG_FREEZE_EN_Pos (2UL)         /*!< WDOG_FREEZE_EN (Bit 2)                                */
#define SYS_WDOG_WATCHDOG_CTRL_REG_WDOG_FREEZE_EN_Msk (0x4UL)       /*!< WDOG_FREEZE_EN (Bitfield-Mask: 0x01)                  */
#define SYS_WDOG_WATCHDOG_CTRL_REG_NMI_RST_Pos (0UL)                /*!< NMI_RST (Bit 0)                                       */
#define SYS_WDOG_WATCHDOG_CTRL_REG_NMI_RST_Msk (0x1UL)              /*!< NMI_RST (Bitfield-Mask: 0x01)                         */
/* =====================================================  WATCHDOG_REG  ====================================================== */
#define SYS_WDOG_WATCHDOG_REG_WDOG_WEN_Pos (14UL)                   /*!< WDOG_WEN (Bit 14)                                     */
#define SYS_WDOG_WATCHDOG_REG_WDOG_WEN_Msk (0xffffc000UL)           /*!< WDOG_WEN (Bitfield-Mask: 0x3ffff)                     */
#define SYS_WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Pos (13UL)               /*!< WDOG_VAL_NEG (Bit 13)                                 */
#define SYS_WDOG_WATCHDOG_REG_WDOG_VAL_NEG_Msk (0x2000UL)           /*!< WDOG_VAL_NEG (Bitfield-Mask: 0x01)                    */
#define SYS_WDOG_WATCHDOG_REG_WDOG_VAL_Pos (0UL)                    /*!< WDOG_VAL (Bit 0)                                      */
#define SYS_WDOG_WATCHDOG_REG_WDOG_VAL_Msk (0x1fffUL)               /*!< WDOG_VAL (Bitfield-Mask: 0x1fff)                      */


/* =========================================================================================================================== */
/* ================                                          SYSBUS                                           ================ */
/* =========================================================================================================================== */

/* ===================================================  AHB_DMA_CCLM1_REG  =================================================== */
#define SYSBUS_AHB_DMA_CCLM1_REG_AHB_DMA_CCLM_Pos (0UL)             /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define SYSBUS_AHB_DMA_CCLM1_REG_AHB_DMA_CCLM_Msk (0xffffUL)        /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM2_REG  =================================================== */
#define SYSBUS_AHB_DMA_CCLM2_REG_AHB_DMA_CCLM_Pos (0UL)             /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define SYSBUS_AHB_DMA_CCLM2_REG_AHB_DMA_CCLM_Msk (0xffffUL)        /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM3_REG  =================================================== */
#define SYSBUS_AHB_DMA_CCLM3_REG_AHB_DMA_CCLM_Pos (0UL)             /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define SYSBUS_AHB_DMA_CCLM3_REG_AHB_DMA_CCLM_Msk (0xffffUL)        /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM4_REG  =================================================== */
#define SYSBUS_AHB_DMA_CCLM4_REG_AHB_DMA_CCLM_Pos (0UL)             /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define SYSBUS_AHB_DMA_CCLM4_REG_AHB_DMA_CCLM_Msk (0xffffUL)        /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM5_REG  =================================================== */
#define SYSBUS_AHB_DMA_CCLM5_REG_AHB_DMA_CCLM_Pos (0UL)             /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define SYSBUS_AHB_DMA_CCLM5_REG_AHB_DMA_CCLM_Msk (0xffffUL)        /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ===================================================  AHB_DMA_CCLM7_REG  =================================================== */
#define SYSBUS_AHB_DMA_CCLM7_REG_AHB_DMA_CCLM_Pos (0UL)             /*!< AHB_DMA_CCLM (Bit 0)                                  */
#define SYSBUS_AHB_DMA_CCLM7_REG_AHB_DMA_CCLM_Msk (0xffffUL)        /*!< AHB_DMA_CCLM (Bitfield-Mask: 0xffff)                  */
/* ================================================  AHB_DMA_DFLT_MASTER_REG  ================================================ */
#define SYSBUS_AHB_DMA_DFLT_MASTER_REG_AHB_DMA_DFLT_MASTER_Pos (0UL) /*!< AHB_DMA_DFLT_MASTER (Bit 0)                          */
#define SYSBUS_AHB_DMA_DFLT_MASTER_REG_AHB_DMA_DFLT_MASTER_Msk (0xfUL) /*!< AHB_DMA_DFLT_MASTER (Bitfield-Mask: 0x0f)          */
/* ====================================================  AHB_DMA_PL1_REG  ==================================================== */
#define SYSBUS_AHB_DMA_PL1_REG_AHB_DMA_PL1_Pos (0UL)                /*!< AHB_DMA_PL1 (Bit 0)                                   */
#define SYSBUS_AHB_DMA_PL1_REG_AHB_DMA_PL1_Msk (0xfUL)              /*!< AHB_DMA_PL1 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL2_REG  ==================================================== */
#define SYSBUS_AHB_DMA_PL2_REG_AHB_DMA_PL2_Pos (0UL)                /*!< AHB_DMA_PL2 (Bit 0)                                   */
#define SYSBUS_AHB_DMA_PL2_REG_AHB_DMA_PL2_Msk (0xfUL)              /*!< AHB_DMA_PL2 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL3_REG  ==================================================== */
#define SYSBUS_AHB_DMA_PL3_REG_AHB_DMA_PL3_Pos (0UL)                /*!< AHB_DMA_PL3 (Bit 0)                                   */
#define SYSBUS_AHB_DMA_PL3_REG_AHB_DMA_PL3_Msk (0xfUL)              /*!< AHB_DMA_PL3 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL4_REG  ==================================================== */
#define SYSBUS_AHB_DMA_PL4_REG_AHB_DMA_PL4_Pos (0UL)                /*!< AHB_DMA_PL4 (Bit 0)                                   */
#define SYSBUS_AHB_DMA_PL4_REG_AHB_DMA_PL4_Msk (0xfUL)              /*!< AHB_DMA_PL4 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL5_REG  ==================================================== */
#define SYSBUS_AHB_DMA_PL5_REG_AHB_DMA_PL5_Pos (0UL)                /*!< AHB_DMA_PL5 (Bit 0)                                   */
#define SYSBUS_AHB_DMA_PL5_REG_AHB_DMA_PL5_Msk (0xfUL)              /*!< AHB_DMA_PL5 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_PL7_REG  ==================================================== */
#define SYSBUS_AHB_DMA_PL7_REG_AHB_DMA_PL7_Pos (0UL)                /*!< AHB_DMA_PL7 (Bit 0)                                   */
#define SYSBUS_AHB_DMA_PL7_REG_AHB_DMA_PL7_Msk (0xfUL)              /*!< AHB_DMA_PL7 (Bitfield-Mask: 0x0f)                     */
/* ====================================================  AHB_DMA_TCL_REG  ==================================================== */
#define SYSBUS_AHB_DMA_TCL_REG_AHB_DMA_TCL_Pos (0UL)                /*!< AHB_DMA_TCL (Bit 0)                                   */
#define SYSBUS_AHB_DMA_TCL_REG_AHB_DMA_TCL_Msk (0xffffUL)           /*!< AHB_DMA_TCL (Bitfield-Mask: 0xffff)                   */
/* ==================================================  AHB_DMA_VERSION_REG  ================================================== */
#define SYSBUS_AHB_DMA_VERSION_REG_AHB_DMA_VERSION_Pos (0UL)        /*!< AHB_DMA_VERSION (Bit 0)                               */
#define SYSBUS_AHB_DMA_VERSION_REG_AHB_DMA_VERSION_Msk (0xffffffffUL) /*!< AHB_DMA_VERSION (Bitfield-Mask: 0xffffffff)         */
/* ===================================================  AHB_DMA_WTEN_REG  ==================================================== */
#define SYSBUS_AHB_DMA_WTEN_REG_AHB_DMA_WTEN_Pos (0UL)              /*!< AHB_DMA_WTEN (Bit 0)                                  */
#define SYSBUS_AHB_DMA_WTEN_REG_AHB_DMA_WTEN_Msk (0x1UL)            /*!< AHB_DMA_WTEN (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                        SYSBUS_ICM                                         ================ */
/* =========================================================================================================================== */

