antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ====================================================  AHBREG_ARB_REG  ===================================================== */
#define SYSBUS_ICM_AHBREG_ARB_REG_AHBREG_AHB_AHBS_PRIO_Pos (1UL)    /*!< AHBREG_AHB_AHBS_PRIO (Bit 1)                          */
#define SYSBUS_ICM_AHBREG_ARB_REG_AHBREG_AHB_AHBS_PRIO_Msk (0x2UL)  /*!< AHBREG_AHB_AHBS_PRIO (Bitfield-Mask: 0x01)            */
#define SYSBUS_ICM_AHBREG_ARB_REG_AHBREG_AHB_DMA_PRIO_Pos (0UL)     /*!< AHBREG_AHB_DMA_PRIO (Bit 0)                           */
#define SYSBUS_ICM_AHBREG_ARB_REG_AHBREG_AHB_DMA_PRIO_Msk (0x1UL)   /*!< AHBREG_AHB_DMA_PRIO (Bitfield-Mask: 0x01)             */
/* =====================================================  APBF_ARB_REG  ====================================================== */
#define SYSBUS_ICM_APBF_ARB_REG_APBF_AHB_DMA_PRIO_Pos (4UL)         /*!< APBF_AHB_DMA_PRIO (Bit 4)                             */
#define SYSBUS_ICM_APBF_ARB_REG_APBF_AHB_DMA_PRIO_Msk (0x30UL)      /*!< APBF_AHB_DMA_PRIO (Bitfield-Mask: 0x03)               */
#define SYSBUS_ICM_APBF_ARB_REG_APBF_SNC_PRIO_Pos (2UL)             /*!< APBF_SNC_PRIO (Bit 2)                                 */
#define SYSBUS_ICM_APBF_ARB_REG_APBF_SNC_PRIO_Msk (0xcUL)           /*!< APBF_SNC_PRIO (Bitfield-Mask: 0x03)                   */
#define SYSBUS_ICM_APBF_ARB_REG_APBF_AHB_AHBS_PRIO_Pos (0UL)        /*!< APBF_AHB_AHBS_PRIO (Bit 0)                            */
#define SYSBUS_ICM_APBF_ARB_REG_APBF_AHB_AHBS_PRIO_Msk (0x3UL)      /*!< APBF_AHB_AHBS_PRIO (Bitfield-Mask: 0x03)              */
/* ======================================================  APB_ARB_REG  ====================================================== */
#define SYSBUS_ICM_APB_ARB_REG_APB_AHB_CPUS_PRIO_Pos (6UL)          /*!< APB_AHB_CPUS_PRIO (Bit 6)                             */
#define SYSBUS_ICM_APB_ARB_REG_APB_AHB_CPUS_PRIO_Msk (0xc0UL)       /*!< APB_AHB_CPUS_PRIO (Bitfield-Mask: 0x03)               */
#define SYSBUS_ICM_APB_ARB_REG_APB_AHB_DMA_PRIO_Pos (4UL)           /*!< APB_AHB_DMA_PRIO (Bit 4)                              */
#define SYSBUS_ICM_APB_ARB_REG_APB_AHB_DMA_PRIO_Msk (0x30UL)        /*!< APB_AHB_DMA_PRIO (Bitfield-Mask: 0x03)                */
#define SYSBUS_ICM_APB_ARB_REG_APB_SNC_PRIO_Pos (2UL)               /*!< APB_SNC_PRIO (Bit 2)                                  */
#define SYSBUS_ICM_APB_ARB_REG_APB_SNC_PRIO_Msk (0xcUL)             /*!< APB_SNC_PRIO (Bitfield-Mask: 0x03)                    */
#define SYSBUS_ICM_APB_ARB_REG_APB_CMAC_PRIO_Pos (0UL)              /*!< APB_CMAC_PRIO (Bit 0)                                 */
#define SYSBUS_ICM_APB_ARB_REG_APB_CMAC_PRIO_Msk (0x3UL)            /*!< APB_CMAC_PRIO (Bitfield-Mask: 0x03)                   */
/* ====================================================  QSPIFL2_ARB_REG  ==================================================== */
#define SYSBUS_ICM_QSPIFL2_ARB_REG_QSPIFL2_AHB_CPUS_PRIO_Pos (1UL)  /*!< QSPIFL2_AHB_CPUS_PRIO (Bit 1)                         */
#define SYSBUS_ICM_QSPIFL2_ARB_REG_QSPIFL2_AHB_CPUS_PRIO_Msk (0x2UL) /*!< QSPIFL2_AHB_CPUS_PRIO (Bitfield-Mask: 0x01)          */
#define SYSBUS_ICM_QSPIFL2_ARB_REG_QSPIFL2_AHB_DMA_PRIO_Pos (0UL)   /*!< QSPIFL2_AHB_DMA_PRIO (Bit 0)                          */
#define SYSBUS_ICM_QSPIFL2_ARB_REG_QSPIFL2_AHB_DMA_PRIO_Msk (0x1UL) /*!< QSPIFL2_AHB_DMA_PRIO (Bitfield-Mask: 0x01)            */
/* ====================================================  QSPIRAM_ARB_REG  ==================================================== */
#define SYSBUS_ICM_QSPIRAM_ARB_REG_QSPIRAM_AHB_AHBS_PRIO_Pos (1UL)  /*!< QSPIRAM_AHB_AHBS_PRIO (Bit 1)                         */
#define SYSBUS_ICM_QSPIRAM_ARB_REG_QSPIRAM_AHB_AHBS_PRIO_Msk (0x2UL) /*!< QSPIRAM_AHB_AHBS_PRIO (Bitfield-Mask: 0x01)          */
#define SYSBUS_ICM_QSPIRAM_ARB_REG_QSPIRAM_AHB_DMA_PRIO_Pos (0UL)   /*!< QSPIRAM_AHB_DMA_PRIO (Bit 0)                          */
#define SYSBUS_ICM_QSPIRAM_ARB_REG_QSPIRAM_AHB_DMA_PRIO_Msk (0x1UL) /*!< QSPIRAM_AHB_DMA_PRIO (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */

/* ================================================  TIMER_CAPTURE_GPIO1_REG  ================================================ */
#define TIMER_TIMER_CAPTURE_GPIO1_REG_TIM_CAPTURE_GPIO1_Pos (0UL)   /*!< TIM_CAPTURE_GPIO1 (Bit 0)                             */
#define TIMER_TIMER_CAPTURE_GPIO1_REG_TIM_CAPTURE_GPIO1_Msk (0xffffffUL) /*!< TIM_CAPTURE_GPIO1 (Bitfield-Mask: 0xffffff)      */
/* ================================================  TIMER_CAPTURE_GPIO2_REG  ================================================ */
#define TIMER_TIMER_CAPTURE_GPIO2_REG_TIM_CAPTURE_GPIO2_Pos (0UL)   /*!< TIM_CAPTURE_GPIO2 (Bit 0)                             */
#define TIMER_TIMER_CAPTURE_GPIO2_REG_TIM_CAPTURE_GPIO2_Msk (0xffffffUL) /*!< TIM_CAPTURE_GPIO2 (Bitfield-Mask: 0xffffff)      */
/* ================================================  TIMER_CAPTURE_GPIO3_REG  ================================================ */
#define TIMER_TIMER_CAPTURE_GPIO3_REG_TIM_CAPTURE_GPIO3_Pos (0UL)   /*!< TIM_CAPTURE_GPIO3 (Bit 0)                             */
#define TIMER_TIMER_CAPTURE_GPIO3_REG_TIM_CAPTURE_GPIO3_Msk (0xffffffUL) /*!< TIM_CAPTURE_GPIO3 (Bitfield-Mask: 0xffffff)      */
/* ================================================  TIMER_CAPTURE_GPIO4_REG  ================================================ */
#define TIMER_TIMER_CAPTURE_GPIO4_REG_TIM_CAPTURE_GPIO4_Pos (0UL)   /*!< TIM_CAPTURE_GPIO4 (Bit 0)                             */
#define TIMER_TIMER_CAPTURE_GPIO4_REG_TIM_CAPTURE_GPIO4_Msk (0xffffffUL) /*!< TIM_CAPTURE_GPIO4 (Bitfield-Mask: 0xffffff)      */
/* ===============================================  TIMER_CLEAR_IRQ_PULSE_REG  =============================================== */
#define TIMER_TIMER_CLEAR_IRQ_PULSE_REG_TIM_CLEAR_PULSE_IRQ_Pos (0UL) /*!< TIM_CLEAR_PULSE_IRQ (Bit 0)                         */
#define TIMER_TIMER_CLEAR_IRQ_PULSE_REG_TIM_CLEAR_PULSE_IRQ_Msk (0x1UL) /*!< TIM_CLEAR_PULSE_IRQ (Bitfield-Mask: 0x01)         */
/* ==================================================  TIMER_CLEAR_IRQ_REG  ================================================== */
#define TIMER_TIMER_CLEAR_IRQ_REG_TIM_CLEAR_IRQ_Pos (0UL)           /*!< TIM_CLEAR_IRQ (Bit 0)                                 */
#define TIMER_TIMER_CLEAR_IRQ_REG_TIM_CLEAR_IRQ_Msk (0x1UL)         /*!< TIM_CLEAR_IRQ (Bitfield-Mask: 0x01)                   */
/* ====================================================  TIMER_CTRL_REG  ===================================================== */
#define TIMER_TIMER_CTRL_REG_TIM_SINGLE_EVENT_CAPTURE_Pos (20UL)    /*!< TIM_SINGLE_EVENT_CAPTURE (Bit 20)                     */
#define TIMER_TIMER_CTRL_REG_TIM_SINGLE_EVENT_CAPTURE_Msk (0x100000UL) /*!< TIM_SINGLE_EVENT_CAPTURE (Bitfield-Mask: 0x01)     */
#define TIMER_TIMER_CTRL_REG_TIM_EDGE_DET_CNT_FALL_EN_Pos (19UL)    /*!< TIM_EDGE_DET_CNT_FALL_EN (Bit 19)                     */
#define TIMER_TIMER_CTRL_REG_TIM_EDGE_DET_CNT_FALL_EN_Msk (0x80000UL) /*!< TIM_EDGE_DET_CNT_FALL_EN (Bitfield-Mask: 0x01)      */
#define TIMER_TIMER_CTRL_REG_TIM_EDGE_DET_CNT_EN_Pos (18UL)         /*!< TIM_EDGE_DET_CNT_EN (Bit 18)                          */
#define TIMER_TIMER_CTRL_REG_TIM_EDGE_DET_CNT_EN_Msk (0x40000UL)    /*!< TIM_EDGE_DET_CNT_EN (Bitfield-Mask: 0x01)             */
#define TIMER_TIMER_CTRL_REG_TIM_ONESHOT_SWITCH_Pos (17UL)          /*!< TIM_ONESHOT_SWITCH (Bit 17)                           */
#define TIMER_TIMER_CTRL_REG_TIM_ONESHOT_SWITCH_Msk (0x20000UL)     /*!< TIM_ONESHOT_SWITCH (Bitfield-Mask: 0x01)              */
#define TIMER_TIMER_CTRL_REG_TIM_ONESHOT_TRIGGER_Pos (15UL)         /*!< TIM_ONESHOT_TRIGGER (Bit 15)                          */
#define TIMER_TIMER_CTRL_REG_TIM_ONESHOT_TRIGGER_Msk (0x18000UL)    /*!< TIM_ONESHOT_TRIGGER (Bitfield-Mask: 0x03)             */
#define TIMER_TIMER_CTRL_REG_TIM_IN4_EVENT_FALL_EN_Pos (10UL)       /*!< TIM_IN4_EVENT_FALL_EN (Bit 10)                        */
#define TIMER_TIMER_CTRL_REG_TIM_IN4_EVENT_FALL_EN_Msk (0x400UL)    /*!< TIM_IN4_EVENT_FALL_EN (Bitfield-Mask: 0x01)           */
#define TIMER_TIMER_CTRL_REG_TIM_IN3_EVENT_FALL_EN_Pos (9UL)        /*!< TIM_IN3_EVENT_FALL_EN (Bit 9)                         */
#define TIMER_TIMER_CTRL_REG_TIM_IN3_EVENT_FALL_EN_Msk (0x200UL)    /*!< TIM_IN3_EVENT_FALL_EN (Bitfield-Mask: 0x01)           */
#define TIMER_TIMER_CTRL_REG_TIM_CLK_EN_Pos (8UL)                   /*!< TIM_CLK_EN (Bit 8)                                    */
#define TIMER_TIMER_CTRL_REG_TIM_CLK_EN_Msk (0x100UL)               /*!< TIM_CLK_EN (Bitfield-Mask: 0x01)                      */
#define TIMER_TIMER_CTRL_REG_TIM_SYS_CLK_EN_Pos (7UL)               /*!< TIM_SYS_CLK_EN (Bit 7)                                */
#define TIMER_TIMER_CTRL_REG_TIM_SYS_CLK_EN_Msk (0x80UL)            /*!< TIM_SYS_CLK_EN (Bitfield-Mask: 0x01)                  */
#define TIMER_TIMER_CTRL_REG_TIM_FREE_RUN_MODE_EN_Pos (6UL)         /*!< TIM_FREE_RUN_MODE_EN (Bit 6)                          */
#define TIMER_TIMER_CTRL_REG_TIM_FREE_RUN_MODE_EN_Msk (0x40UL)      /*!< TIM_FREE_RUN_MODE_EN (Bitfield-Mask: 0x01)            */
#define TIMER_TIMER_CTRL_REG_TIM_IRQ_EN_Pos (5UL)                   /*!< TIM_IRQ_EN (Bit 5)                                    */
#define TIMER_TIMER_CTRL_REG_TIM_IRQ_EN_Msk (0x20UL)                /*!< TIM_IRQ_EN (Bitfield-Mask: 0x01)                      */
#define TIMER_TIMER_CTRL_REG_TIM_IN2_EVENT_FALL_EN_Pos (4UL)        /*!< TIM_IN2_EVENT_FALL_EN (Bit 4)                         */
#define TIMER_TIMER_CTRL_REG_TIM_IN2_EVENT_FALL_EN_Msk (0x10UL)     /*!< TIM_IN2_EVENT_FALL_EN (Bitfield-Mask: 0x01)           */
#define TIMER_TIMER_CTRL_REG_TIM_IN1_EVENT_FALL_EN_Pos (3UL)        /*!< TIM_IN1_EVENT_FALL_EN (Bit 3)                         */
#define TIMER_TIMER_CTRL_REG_TIM_IN1_EVENT_FALL_EN_Msk (0x8UL)      /*!< TIM_IN1_EVENT_FALL_EN (Bitfield-Mask: 0x01)           */
#define TIMER_TIMER_CTRL_REG_TIM_COUNT_DOWN_EN_Pos (2UL)            /*!< TIM_COUNT_DOWN_EN (Bit 2)                             */
#define TIMER_TIMER_CTRL_REG_TIM_COUNT_DOWN_EN_Msk (0x4UL)          /*!< TIM_COUNT_DOWN_EN (Bitfield-Mask: 0x01)               */
#define TIMER_TIMER_CTRL_REG_TIM_ONESHOT_MODE_EN_Pos (1UL)          /*!< TIM_ONESHOT_MODE_EN (Bit 1)                           */
#define TIMER_TIMER_CTRL_REG_TIM_ONESHOT_MODE_EN_Msk (0x2UL)        /*!< TIM_ONESHOT_MODE_EN (Bitfield-Mask: 0x01)             */
#define TIMER_TIMER_CTRL_REG_TIM_EN_Pos   (0UL)                     /*!< TIM_EN (Bit 0)                                        */
#define TIMER_TIMER_CTRL_REG_TIM_EN_Msk   (0x1UL)                   /*!< TIM_EN (Bitfield-Mask: 0x01)                          */
/* =================================================  TIMER_GPIO1_CONF_REG  ================================================== */
#define TIMER_TIMER_GPIO1_CONF_REG_TIM_GPIO1_CONF_Pos (0UL)         /*!< TIM_GPIO1_CONF (Bit 0)                                */
#define TIMER_TIMER_GPIO1_CONF_REG_TIM_GPIO1_CONF_Msk (0x3fUL)      /*!< TIM_GPIO1_CONF (Bitfield-Mask: 0x3f)                  */
/* =================================================  TIMER_GPIO2_CONF_REG  ================================================== */
#define TIMER_TIMER_GPIO2_CONF_REG_TIM_GPIO2_CONF_Pos (0UL)         /*!< TIM_GPIO2_CONF (Bit 0)                                */
#define TIMER_TIMER_GPIO2_CONF_REG_TIM_GPIO2_CONF_Msk (0x3fUL)      /*!< TIM_GPIO2_CONF (Bitfield-Mask: 0x3f)                  */
/* =================================================  TIMER_GPIO3_CONF_REG  ================================================== */
#define TIMER_TIMER_GPIO3_CONF_REG_TIM_GPIO3_CONF_Pos (0UL)         /*!< TIM_GPIO3_CONF (Bit 0)                                */
#define TIMER_TIMER_GPIO3_CONF_REG_TIM_GPIO3_CONF_Msk (0x3fUL)      /*!< TIM_GPIO3_CONF (Bitfield-Mask: 0x3f)                  */
/* =================================================  TIMER_GPIO4_CONF_REG  ================================================== */
#define TIMER_TIMER_GPIO4_CONF_REG_TIM_GPIO4_CONF_Pos (0UL)         /*!< TIM_GPIO4_CONF (Bit 0)                                */
#define TIMER_TIMER_GPIO4_CONF_REG_TIM_GPIO4_CONF_Msk (0x3fUL)      /*!< TIM_GPIO4_CONF (Bitfield-Mask: 0x3f)                  */
/* ===============================================  TIMER_ONESHOT_TRIGGER_REG  =============================================== */
#define TIMER_TIMER_ONESHOT_TRIGGER_REG_TIM_ONESHOT_TRIGGER_SW_Pos (0UL) /*!< TIM_ONESHOT_TRIGGER_SW (Bit 0)                   */
#define TIMER_TIMER_ONESHOT_TRIGGER_REG_TIM_ONESHOT_TRIGGER_SW_Msk (0x1UL) /*!< TIM_ONESHOT_TRIGGER_SW (Bitfield-Mask: 0x01)   */
/* ================================================  TIMER_PRESCALER_VAL_REG  ================================================ */
#define TIMER_TIMER_PRESCALER_VAL_REG_TIM_PRESCALER_VAL_Pos (0UL)   /*!< TIM_PRESCALER_VAL (Bit 0)                             */
#define TIMER_TIMER_PRESCALER_VAL_REG_TIM_PRESCALER_VAL_Msk (0x1fUL) /*!< TIM_PRESCALER_VAL (Bitfield-Mask: 0x1f)              */
/* ===============================================  TIMER_PULSE_CNT_CTRL_REG  ================================================ */
#define TIMER_TIMER_PULSE_CNT_CTRL_REG_PULSE_CNT_GPIO_SEL_Pos (24UL) /*!< PULSE_CNT_GPIO_SEL (Bit 24)                          */
#define TIMER_TIMER_PULSE_CNT_CTRL_REG_PULSE_CNT_GPIO_SEL_Msk (0x3f000000UL) /*!< PULSE_CNT_GPIO_SEL (Bitfield-Mask: 0x3f)     */
#define TIMER_TIMER_PULSE_CNT_CTRL_REG_PULSE_CNT_THRESHOLD_Pos (0UL) /*!< PULSE_CNT_THRESHOLD (Bit 0)                          */
#define TIMER_TIMER_PULSE_CNT_CTRL_REG_PULSE_CNT_THRESHOLD_Msk (0xffffffUL) /*!< PULSE_CNT_THRESHOLD (Bitfield-Mask: 0xffffff) */
/* ==================================================  TIMER_PWM_CTRL_REG  =================================================== */
#define TIMER_TIMER_PWM_CTRL_REG_TIM_PWM_DC_Pos (16UL)              /*!< TIM_PWM_DC (Bit 16)                                   */
#define TIMER_TIMER_PWM_CTRL_REG_TIM_PWM_DC_Msk (0xffff0000UL)      /*!< TIM_PWM_DC (Bitfield-Mask: 0xffff)                    */
#define TIMER_TIMER_PWM_CTRL_REG_TIM_PWM_FREQ_Pos (0UL)             /*!< TIM_PWM_FREQ (Bit 0)                                  */
#define TIMER_TIMER_PWM_CTRL_REG_TIM_PWM_FREQ_Msk (0xffffUL)        /*!< TIM_PWM_FREQ (Bitfield-Mask: 0xffff)                  */
/* ==================================================  TIMER_PWM_SYNC_REG  =================================================== */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER6_SYNC_Pos (6UL)              /*!< TIMER6_SYNC (Bit 6)                                   */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER6_SYNC_Msk (0x40UL)           /*!< TIMER6_SYNC (Bitfield-Mask: 0x01)                     */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER3_SYNC_Pos (4UL)              /*!< TIMER3_SYNC (Bit 4)                                   */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER3_SYNC_Msk (0x10UL)           /*!< TIMER3_SYNC (Bitfield-Mask: 0x01)                     */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER2_SYNC_Pos (3UL)              /*!< TIMER2_SYNC (Bit 3)                                   */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER2_SYNC_Msk (0x8UL)            /*!< TIMER2_SYNC (Bitfield-Mask: 0x01)                     */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER_SYNC_Pos (2UL)               /*!< TIMER_SYNC (Bit 2)                                    */
#define TIMER_TIMER_PWM_SYNC_REG_TIMER_SYNC_Msk (0x4UL)             /*!< TIMER_SYNC (Bitfield-Mask: 0x01)                      */
#define TIMER_TIMER_PWM_SYNC_REG_SYNC_ENABLE_Pos (1UL)              /*!< SYNC_ENABLE (Bit 1)                                   */
#define TIMER_TIMER_PWM_SYNC_REG_SYNC_ENABLE_Msk (0x2UL)            /*!< SYNC_ENABLE (Bitfield-Mask: 0x01)                     */
#define TIMER_TIMER_PWM_SYNC_REG_PWM_START_Pos (0UL)                /*!< PWM_START (Bit 0)                                     */
#define TIMER_TIMER_PWM_SYNC_REG_PWM_START_Msk (0x1UL)              /*!< PWM_START (Bitfield-Mask: 0x01)                       */
/* ==================================================  TIMER_SETTINGS_REG  =================================================== */
#define TIMER_TIMER_SETTINGS_REG_TIM_PRESCALER_Pos (24UL)           /*!< TIM_PRESCALER (Bit 24)                                */
#define TIMER_TIMER_SETTINGS_REG_TIM_PRESCALER_Msk (0x1f000000UL)   /*!< TIM_PRESCALER (Bitfield-Mask: 0x1f)                   */
#define TIMER_TIMER_SETTINGS_REG_TIM_RELOAD_Pos (0UL)               /*!< TIM_RELOAD (Bit 0)                                    */
#define TIMER_TIMER_SETTINGS_REG_TIM_RELOAD_Msk (0xffffffUL)        /*!< TIM_RELOAD (Bitfield-Mask: 0xffffff)                  */
/* ==================================================  TIMER_SHOTWIDTH_REG  ================================================== */
#define TIMER_TIMER_SHOTWIDTH_REG_TIM_SHOTWIDTH_Pos (0UL)           /*!< TIM_SHOTWIDTH (Bit 0)                                 */
#define TIMER_TIMER_SHOTWIDTH_REG_TIM_SHOTWIDTH_Msk (0xffffffUL)    /*!< TIM_SHOTWIDTH (Bitfield-Mask: 0xffffff)               */
/* ===================================================  TIMER_STATUS_REG  ==================================================== */
#define TIMER_TIMER_STATUS_REG_TIM_IRQ_PULSE_STATUS_Pos (14UL)      /*!< TIM_IRQ_PULSE_STATUS (Bit 14)                         */
#define TIMER_TIMER_STATUS_REG_TIM_IRQ_PULSE_STATUS_Msk (0x4000UL)  /*!< TIM_IRQ_PULSE_STATUS (Bitfield-Mask: 0x01)            */
#define TIMER_TIMER_STATUS_REG_TIM_IN4_STATE_Pos (13UL)             /*!< TIM_IN4_STATE (Bit 13)                                */
#define TIMER_TIMER_STATUS_REG_TIM_IN4_STATE_Msk (0x2000UL)         /*!< TIM_IN4_STATE (Bitfield-Mask: 0x01)                   */
#define TIMER_TIMER_STATUS_REG_TIM_IN3_STATE_Pos (12UL)             /*!< TIM_IN3_STATE (Bit 12)                                */
#define TIMER_TIMER_STATUS_REG_TIM_IN3_STATE_Msk (0x1000UL)         /*!< TIM_IN3_STATE (Bitfield-Mask: 0x01)                   */
#define TIMER_TIMER_STATUS_REG_TIM_SWITCHED_TO_DIVN_CLK_Pos (11UL)  /*!< TIM_SWITCHED_TO_DIVN_CLK (Bit 11)                     */
#define TIMER_TIMER_STATUS_REG_TIM_SWITCHED_TO_DIVN_CLK_Msk (0x800UL) /*!< TIM_SWITCHED_TO_DIVN_CLK (Bitfield-Mask: 0x01)      */
#define TIMER_TIMER_STATUS_REG_TIM_PWM_BUSY_Pos (10UL)              /*!< TIM_PWM_BUSY (Bit 10)                                 */
#define TIMER_TIMER_STATUS_REG_TIM_PWM_BUSY_Msk (0x400UL)           /*!< TIM_PWM_BUSY (Bitfield-Mask: 0x01)                    */
#define TIMER_TIMER_STATUS_REG_TIM_TIMER_BUSY_Pos (9UL)             /*!< TIM_TIMER_BUSY (Bit 9)                                */
#define TIMER_TIMER_STATUS_REG_TIM_TIMER_BUSY_Msk (0x200UL)         /*!< TIM_TIMER_BUSY (Bitfield-Mask: 0x01)                  */
#define TIMER_TIMER_STATUS_REG_TIM_IRQ_STATUS_Pos (8UL)             /*!< TIM_IRQ_STATUS (Bit 8)                                */
#define TIMER_TIMER_STATUS_REG_TIM_IRQ_STATUS_Msk (0x100UL)         /*!< TIM_IRQ_STATUS (Bitfield-Mask: 0x01)                  */
#define TIMER_TIMER_STATUS_REG_TIM_ONESHOT_PHASE_Pos (2UL)          /*!< TIM_ONESHOT_PHASE (Bit 2)                             */
#define TIMER_TIMER_STATUS_REG_TIM_ONESHOT_PHASE_Msk (0xcUL)        /*!< TIM_ONESHOT_PHASE (Bitfield-Mask: 0x03)               */
#define TIMER_TIMER_STATUS_REG_TIM_IN2_STATE_Pos (1UL)              /*!< TIM_IN2_STATE (Bit 1)                                 */
#define TIMER_TIMER_STATUS_REG_TIM_IN2_STATE_Msk (0x2UL)            /*!< TIM_IN2_STATE (Bitfield-Mask: 0x01)                   */
#define TIMER_TIMER_STATUS_REG_TIM_IN1_STATE_Pos (0UL)              /*!< TIM_IN1_STATE (Bit 0)                                 */
#define TIMER_TIMER_STATUS_REG_TIM_IN1_STATE_Msk (0x1UL)            /*!< TIM_IN1_STATE (Bitfield-Mask: 0x01)                   */
/* ==================================================  TIMER_TIMER_VAL_REG  ================================================== */
#define TIMER_TIMER_TIMER_VAL_REG_TIM_TIMER_VALUE_Pos (0UL)         /*!< TIM_TIMER_VALUE (Bit 0)                               */
#define TIMER_TIMER_TIMER_VAL_REG_TIM_TIMER_VALUE_Msk (0xffffffUL)  /*!< TIM_TIMER_VALUE (Bitfield-Mask: 0xffffff)             */


/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */

