antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
#define USB_USB_TXC3_REG_USB_LAST_Pos     (1UL)                     /*!< USB_LAST (Bit 1)                                      */
#define USB_USB_TXC3_REG_USB_LAST_Msk     (0x2UL)                   /*!< USB_LAST (Bitfield-Mask: 0x01)                        */
#define USB_USB_TXC3_REG_USB_TX_EN_Pos    (0UL)                     /*!< USB_TX_EN (Bit 0)                                     */
#define USB_USB_TXC3_REG_USB_TX_EN_Msk    (0x1UL)                   /*!< USB_TX_EN (Bitfield-Mask: 0x01)                       */
/* =====================================================  USB_TXD0_REG  ====================================================== */
#define USB_USB_TXD0_REG_USB_TXFD_Pos     (0UL)                     /*!< USB_TXFD (Bit 0)                                      */
#define USB_USB_TXD0_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB_TXFD (Bitfield-Mask: 0xff)                        */
/* =====================================================  USB_TXD1_REG  ====================================================== */
#define USB_USB_TXD1_REG_USB_TXFD_Pos     (0UL)                     /*!< USB_TXFD (Bit 0)                                      */
#define USB_USB_TXD1_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB_TXFD (Bitfield-Mask: 0xff)                        */
/* =====================================================  USB_TXD2_REG  ====================================================== */
#define USB_USB_TXD2_REG_USB_TXFD_Pos     (0UL)                     /*!< USB_TXFD (Bit 0)                                      */
#define USB_USB_TXD2_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB_TXFD (Bitfield-Mask: 0xff)                        */
/* =====================================================  USB_TXD3_REG  ====================================================== */
#define USB_USB_TXD3_REG_USB_TXFD_Pos     (0UL)                     /*!< USB_TXFD (Bit 0)                                      */
#define USB_USB_TXD3_REG_USB_TXFD_Msk     (0xffUL)                  /*!< USB_TXFD (Bitfield-Mask: 0xff)                        */
/* =====================================================  USB_TXEV_REG  ====================================================== */
#define USB_USB_TXEV_REG_USB_TXUDRRN31_Pos (4UL)                    /*!< USB_TXUDRRN31 (Bit 4)                                 */
#define USB_USB_TXEV_REG_USB_TXUDRRN31_Msk (0x70UL)                 /*!< USB_TXUDRRN31 (Bitfield-Mask: 0x07)                   */
#define USB_USB_TXEV_REG_USB_TXFIFO31_Pos (0UL)                     /*!< USB_TXFIFO31 (Bit 0)                                  */
#define USB_USB_TXEV_REG_USB_TXFIFO31_Msk (0x7UL)                   /*!< USB_TXFIFO31 (Bitfield-Mask: 0x07)                    */
/* =====================================================  USB_TXMSK_REG  ===================================================== */
#define USB_USB_TXMSK_REG_USB_M_TXUDRRN31_Pos (4UL)                 /*!< USB_M_TXUDRRN31 (Bit 4)                               */
#define USB_USB_TXMSK_REG_USB_M_TXUDRRN31_Msk (0x70UL)              /*!< USB_M_TXUDRRN31 (Bitfield-Mask: 0x07)                 */
#define USB_USB_TXMSK_REG_USB_M_TXFIFO31_Pos (0UL)                  /*!< USB_M_TXFIFO31 (Bit 0)                                */
#define USB_USB_TXMSK_REG_USB_M_TXFIFO31_Msk (0x7UL)                /*!< USB_M_TXFIFO31 (Bitfield-Mask: 0x07)                  */
/* =====================================================  USB_TXS0_REG  ====================================================== */
#define USB_USB_TXS0_REG_USB_ACK_STAT_Pos (12UL)                    /*!< USB_ACK_STAT (Bit 12)                                 */
#define USB_USB_TXS0_REG_USB_ACK_STAT_Msk (0x1000UL)                /*!< USB_ACK_STAT (Bitfield-Mask: 0x01)                    */
#define USB_USB_TXS0_REG_USB_TX_DONE_Pos  (11UL)                    /*!< USB_TX_DONE (Bit 11)                                  */
#define USB_USB_TXS0_REG_USB_TX_DONE_Msk  (0x800UL)                 /*!< USB_TX_DONE (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS0_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB_TCOUNT (Bit 0)                                    */
#define USB_USB_TXS0_REG_USB_TCOUNT_Msk   (0x7ffUL)                 /*!< USB_TCOUNT (Bitfield-Mask: 0x7ff)                     */
/* =====================================================  USB_TXS1_REG  ====================================================== */
#define USB_USB_TXS1_REG_USB_TX_URUN_Pos  (13UL)                    /*!< USB_TX_URUN (Bit 13)                                  */
#define USB_USB_TXS1_REG_USB_TX_URUN_Msk  (0x2000UL)                /*!< USB_TX_URUN (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS1_REG_USB_ACK_STAT_Pos (12UL)                    /*!< USB_ACK_STAT (Bit 12)                                 */
#define USB_USB_TXS1_REG_USB_ACK_STAT_Msk (0x1000UL)                /*!< USB_ACK_STAT (Bitfield-Mask: 0x01)                    */
#define USB_USB_TXS1_REG_USB_TX_DONE_Pos  (11UL)                    /*!< USB_TX_DONE (Bit 11)                                  */
#define USB_USB_TXS1_REG_USB_TX_DONE_Msk  (0x800UL)                 /*!< USB_TX_DONE (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS1_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB_TCOUNT (Bit 0)                                    */
#define USB_USB_TXS1_REG_USB_TCOUNT_Msk   (0x7ffUL)                 /*!< USB_TCOUNT (Bitfield-Mask: 0x7ff)                     */
/* =====================================================  USB_TXS2_REG  ====================================================== */
#define USB_USB_TXS2_REG_USB_TX_URUN_Pos  (13UL)                    /*!< USB_TX_URUN (Bit 13)                                  */
#define USB_USB_TXS2_REG_USB_TX_URUN_Msk  (0x2000UL)                /*!< USB_TX_URUN (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS2_REG_USB_ACK_STAT_Pos (12UL)                    /*!< USB_ACK_STAT (Bit 12)                                 */
#define USB_USB_TXS2_REG_USB_ACK_STAT_Msk (0x1000UL)                /*!< USB_ACK_STAT (Bitfield-Mask: 0x01)                    */
#define USB_USB_TXS2_REG_USB_TX_DONE_Pos  (11UL)                    /*!< USB_TX_DONE (Bit 11)                                  */
#define USB_USB_TXS2_REG_USB_TX_DONE_Msk  (0x800UL)                 /*!< USB_TX_DONE (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS2_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB_TCOUNT (Bit 0)                                    */
#define USB_USB_TXS2_REG_USB_TCOUNT_Msk   (0x7ffUL)                 /*!< USB_TCOUNT (Bitfield-Mask: 0x7ff)                     */
/* =====================================================  USB_TXS3_REG  ====================================================== */
#define USB_USB_TXS3_REG_USB_TX_URUN_Pos  (13UL)                    /*!< USB_TX_URUN (Bit 13)                                  */
#define USB_USB_TXS3_REG_USB_TX_URUN_Msk  (0x2000UL)                /*!< USB_TX_URUN (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS3_REG_USB_ACK_STAT_Pos (12UL)                    /*!< USB_ACK_STAT (Bit 12)                                 */
#define USB_USB_TXS3_REG_USB_ACK_STAT_Msk (0x1000UL)                /*!< USB_ACK_STAT (Bitfield-Mask: 0x01)                    */
#define USB_USB_TXS3_REG_USB_TX_DONE_Pos  (11UL)                    /*!< USB_TX_DONE (Bit 11)                                  */
#define USB_USB_TXS3_REG_USB_TX_DONE_Msk  (0x800UL)                 /*!< USB_TX_DONE (Bitfield-Mask: 0x01)                     */
#define USB_USB_TXS3_REG_USB_TCOUNT_Pos   (0UL)                     /*!< USB_TCOUNT (Bit 0)                                    */
#define USB_USB_TXS3_REG_USB_TCOUNT_Msk   (0x7ffUL)                 /*!< USB_TCOUNT (Bitfield-Mask: 0x7ff)                     */
/* ======================================================  USB_UTR_REG  ====================================================== */
#define USB_USB_UTR_REG_USB_DIAG_Pos      (7UL)                     /*!< USB_DIAG (Bit 7)                                      */
#define USB_USB_UTR_REG_USB_DIAG_Msk      (0x80UL)                  /*!< USB_DIAG (Bitfield-Mask: 0x01)                        */
#define USB_USB_UTR_REG_USB_NCRC_Pos      (6UL)                     /*!< USB_NCRC (Bit 6)                                      */
#define USB_USB_UTR_REG_USB_NCRC_Msk      (0x40UL)                  /*!< USB_NCRC (Bitfield-Mask: 0x01)                        */
#define USB_USB_UTR_REG_USB_SF_Pos        (5UL)                     /*!< USB_SF (Bit 5)                                        */
#define USB_USB_UTR_REG_USB_SF_Msk        (0x20UL)                  /*!< USB_SF (Bitfield-Mask: 0x01)                          */
#define USB_USB_UTR_REG_USB_UTR_RES_Pos   (0UL)                     /*!< USB_UTR_RES (Bit 0)                                   */
#define USB_USB_UTR_REG_USB_UTR_RES_Msk   (0x1fUL)                  /*!< USB_UTR_RES (Bitfield-Mask: 0x1f)                     */
/* ====================================================  USB_UX20CDR_REG  ==================================================== */
#define USB_USB_UX20CDR_REG_RPU_TEST7_Pos (7UL)                     /*!< RPU_TEST7 (Bit 7)                                     */
#define USB_USB_UX20CDR_REG_RPU_TEST7_Msk (0x80UL)                  /*!< RPU_TEST7 (Bitfield-Mask: 0x01)                       */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW2_Pos (6UL)                  /*!< RPU_TEST_SW2 (Bit 6)                                  */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW2_Msk (0x40UL)               /*!< RPU_TEST_SW2 (Bitfield-Mask: 0x01)                    */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1_Pos (5UL)                  /*!< RPU_TEST_SW1 (Bit 5)                                  */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1_Msk (0x20UL)               /*!< RPU_TEST_SW1 (Bitfield-Mask: 0x01)                    */
#define USB_USB_UX20CDR_REG_RPU_TEST_EN_Pos (4UL)                   /*!< RPU_TEST_EN (Bit 4)                                   */
#define USB_USB_UX20CDR_REG_RPU_TEST_EN_Msk (0x10UL)                /*!< RPU_TEST_EN (Bitfield-Mask: 0x01)                     */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1DM_Pos (2UL)                /*!< RPU_TEST_SW1DM (Bit 2)                                */
#define USB_USB_UX20CDR_REG_RPU_TEST_SW1DM_Msk (0x4UL)              /*!< RPU_TEST_SW1DM (Bitfield-Mask: 0x01)                  */
#define USB_USB_UX20CDR_REG_RPU_RCDELAY_Pos (1UL)                   /*!< RPU_RCDELAY (Bit 1)                                   */
#define USB_USB_UX20CDR_REG_RPU_RCDELAY_Msk (0x2UL)                 /*!< RPU_RCDELAY (Bitfield-Mask: 0x01)                     */
#define USB_USB_UX20CDR_REG_RPU_SSPROTEN_Pos (0UL)                  /*!< RPU_SSPROTEN (Bit 0)                                  */
#define USB_USB_UX20CDR_REG_RPU_SSPROTEN_Msk (0x1UL)                /*!< RPU_SSPROTEN (Bitfield-Mask: 0x01)                    */
/* ====================================================  USB_XCVDIAG_REG  ==================================================== */
#define USB_USB_XCVDIAG_REG_USB_VPIN_Pos  (7UL)                     /*!< USB_VPIN (Bit 7)                                      */
#define USB_USB_XCVDIAG_REG_USB_VPIN_Msk  (0x80UL)                  /*!< USB_VPIN (Bitfield-Mask: 0x01)                        */
#define USB_USB_XCVDIAG_REG_USB_VMIN_Pos  (6UL)                     /*!< USB_VMIN (Bit 6)                                      */
#define USB_USB_XCVDIAG_REG_USB_VMIN_Msk  (0x40UL)                  /*!< USB_VMIN (Bitfield-Mask: 0x01)                        */
#define USB_USB_XCVDIAG_REG_USB_RCV_Pos   (5UL)                     /*!< USB_RCV (Bit 5)                                       */
#define USB_USB_XCVDIAG_REG_USB_RCV_Msk   (0x20UL)                  /*!< USB_RCV (Bitfield-Mask: 0x01)                         */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXEN_Pos (3UL)                  /*!< USB_XCV_TXEN (Bit 3)                                  */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXEN_Msk (0x8UL)                /*!< USB_XCV_TXEN (Bitfield-Mask: 0x01)                    */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXn_Pos (2UL)                   /*!< USB_XCV_TXn (Bit 2)                                   */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXn_Msk (0x4UL)                 /*!< USB_XCV_TXn (Bitfield-Mask: 0x01)                     */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXp_Pos (1UL)                   /*!< USB_XCV_TXp (Bit 1)                                   */
#define USB_USB_XCVDIAG_REG_USB_XCV_TXp_Msk (0x2UL)                 /*!< USB_XCV_TXp (Bitfield-Mask: 0x01)                     */
#define USB_USB_XCVDIAG_REG_USB_XCV_TEST_Pos (0UL)                  /*!< USB_XCV_TEST (Bit 0)                                  */
#define USB_USB_XCVDIAG_REG_USB_XCV_TEST_Msk (0x1UL)                /*!< USB_XCV_TEST (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                            VAD                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  VAD_CTRL0_REG  ===================================================== */
#define VAD_VAD_CTRL0_REG_VAD_VTRACK_Pos  (6UL)                     /*!< VAD_VTRACK (Bit 6)                                    */
#define VAD_VAD_CTRL0_REG_VAD_VTRACK_Msk  (0xc0UL)                  /*!< VAD_VTRACK (Bitfield-Mask: 0x03)                      */
#define VAD_VAD_CTRL0_REG_VAD_NTRACK_Pos  (3UL)                     /*!< VAD_NTRACK (Bit 3)                                    */
#define VAD_VAD_CTRL0_REG_VAD_NTRACK_Msk  (0x38UL)                  /*!< VAD_NTRACK (Bitfield-Mask: 0x07)                      */
#define VAD_VAD_CTRL0_REG_VAD_PWR_LVL_SNSTVTY_Pos (0UL)             /*!< VAD_PWR_LVL_SNSTVTY (Bit 0)                           */
#define VAD_VAD_CTRL0_REG_VAD_PWR_LVL_SNSTVTY_Msk (0x7UL)           /*!< VAD_PWR_LVL_SNSTVTY (Bitfield-Mask: 0x07)             */
/* =====================================================  VAD_CTRL1_REG  ===================================================== */
#define VAD_VAD_CTRL1_REG_VAD_MINDELAY_Pos (3UL)                    /*!< VAD_MINDELAY (Bit 3)                                  */
#define VAD_VAD_CTRL1_REG_VAD_MINDELAY_Msk (0x18UL)                 /*!< VAD_MINDELAY (Bitfield-Mask: 0x03)                    */
#define VAD_VAD_CTRL1_REG_VAD_MINEVENT_Pos (0UL)                    /*!< VAD_MINEVENT (Bit 0)                                  */
#define VAD_VAD_CTRL1_REG_VAD_MINEVENT_Msk (0x7UL)                  /*!< VAD_MINEVENT (Bitfield-Mask: 0x07)                    */
/* =====================================================  VAD_CTRL2_REG  ===================================================== */
#define VAD_VAD_CTRL2_REG_VAD_NFI_DET_Pos (0UL)                     /*!< VAD_NFI_DET (Bit 0)                                   */
#define VAD_VAD_CTRL2_REG_VAD_NFI_DET_Msk (0x3fUL)                  /*!< VAD_NFI_DET (Bitfield-Mask: 0x3f)                     */
/* =====================================================  VAD_CTRL3_REG  ===================================================== */
#define VAD_VAD_CTRL3_REG_VAD_SB_Pos      (7UL)                     /*!< VAD_SB (Bit 7)                                        */
#define VAD_VAD_CTRL3_REG_VAD_SB_Msk      (0x80UL)                  /*!< VAD_SB (Bitfield-Mask: 0x01)                          */
#define VAD_VAD_CTRL3_REG_VAD_SLEEP_Pos   (6UL)                     /*!< VAD_SLEEP (Bit 6)                                     */
#define VAD_VAD_CTRL3_REG_VAD_SLEEP_Msk   (0x40UL)                  /*!< VAD_SLEEP (Bitfield-Mask: 0x01)                       */
#define VAD_VAD_CTRL3_REG_VAD_MCLK_DIV_Pos (3UL)                    /*!< VAD_MCLK_DIV (Bit 3)                                  */
#define VAD_VAD_CTRL3_REG_VAD_MCLK_DIV_Msk (0x38UL)                 /*!< VAD_MCLK_DIV (Bitfield-Mask: 0x07)                    */
/* =====================================================  VAD_CTRL4_REG  ===================================================== */
#define VAD_VAD_CTRL4_REG_VAD_IRQ_MODE_Pos (2UL)                    /*!< VAD_IRQ_MODE (Bit 2)                                  */
#define VAD_VAD_CTRL4_REG_VAD_IRQ_MODE_Msk (0x4UL)                  /*!< VAD_IRQ_MODE (Bitfield-Mask: 0x01)                    */
#define VAD_VAD_CTRL4_REG_VAD_IRQ_FLAG_Pos (1UL)                    /*!< VAD_IRQ_FLAG (Bit 1)                                  */
#define VAD_VAD_CTRL4_REG_VAD_IRQ_FLAG_Msk (0x2UL)                  /*!< VAD_IRQ_FLAG (Bitfield-Mask: 0x01)                    */
/* ====================================================  VAD_STATUS_REG  ===================================================== */
#define VAD_VAD_STATUS_REG_VAD_NFI_RD_Pos (0UL)                     /*!< VAD_NFI_RD (Bit 0)                                    */
#define VAD_VAD_STATUS_REG_VAD_NFI_RD_Msk (0x3fUL)                  /*!< VAD_NFI_RD (Bitfield-Mask: 0x3f)                      */


/* =========================================================================================================================== */
/* ================                                          WAKEUP                                           ================ */
/* =========================================================================================================================== */

