antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/DA1470x-00.h
/* ===================================================  WKUP_CLEAR_P0_REG  =================================================== */
#define WAKEUP_WKUP_CLEAR_P0_REG_WKUP_CLEAR_P0_Pos (0UL)            /*!< WKUP_CLEAR_P0 (Bit 0)                                 */
#define WAKEUP_WKUP_CLEAR_P0_REG_WKUP_CLEAR_P0_Msk (0xffffffffUL)   /*!< WKUP_CLEAR_P0 (Bitfield-Mask: 0xffffffff)             */
/* ===================================================  WKUP_CLEAR_P1_REG  =================================================== */
#define WAKEUP_WKUP_CLEAR_P1_REG_WKUP_CLEAR_P1_Pos (0UL)            /*!< WKUP_CLEAR_P1 (Bit 0)                                 */
#define WAKEUP_WKUP_CLEAR_P1_REG_WKUP_CLEAR_P1_Msk (0xffffffffUL)   /*!< WKUP_CLEAR_P1 (Bitfield-Mask: 0xffffffff)             */
/* ===================================================  WKUP_CLEAR_P2_REG  =================================================== */
#define WAKEUP_WKUP_CLEAR_P2_REG_WKUP_CLEAR_P2_Pos (0UL)            /*!< WKUP_CLEAR_P2 (Bit 0)                                 */
#define WAKEUP_WKUP_CLEAR_P2_REG_WKUP_CLEAR_P2_Msk (0x7fffUL)       /*!< WKUP_CLEAR_P2 (Bitfield-Mask: 0x7fff)                 */
/* =====================================================  WKUP_CTRL_REG  ===================================================== */
#define WAKEUP_WKUP_CTRL_REG_WKUP_ENABLE_IRQ_Pos (7UL)              /*!< WKUP_ENABLE_IRQ (Bit 7)                               */
#define WAKEUP_WKUP_CTRL_REG_WKUP_ENABLE_IRQ_Msk (0x80UL)           /*!< WKUP_ENABLE_IRQ (Bitfield-Mask: 0x01)                 */
#define WAKEUP_WKUP_CTRL_REG_WKUP_SFT_KEYHIT_Pos (6UL)              /*!< WKUP_SFT_KEYHIT (Bit 6)                               */
#define WAKEUP_WKUP_CTRL_REG_WKUP_SFT_KEYHIT_Msk (0x40UL)           /*!< WKUP_SFT_KEYHIT (Bitfield-Mask: 0x01)                 */
#define WAKEUP_WKUP_CTRL_REG_WKUP_DEB_VALUE_Pos (0UL)               /*!< WKUP_DEB_VALUE (Bit 0)                                */
#define WAKEUP_WKUP_CTRL_REG_WKUP_DEB_VALUE_Msk (0x3fUL)            /*!< WKUP_DEB_VALUE (Bitfield-Mask: 0x3f)                  */
/* ====================================================  WKUP_POL_P0_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Pos (0UL)                /*!< WKUP_POL_P0 (Bit 0)                                   */
#define WAKEUP_WKUP_POL_P0_REG_WKUP_POL_P0_Msk (0xffffffffUL)       /*!< WKUP_POL_P0 (Bitfield-Mask: 0xffffffff)               */
/* ====================================================  WKUP_POL_P1_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Pos (0UL)                /*!< WKUP_POL_P1 (Bit 0)                                   */
#define WAKEUP_WKUP_POL_P1_REG_WKUP_POL_P1_Msk (0xffffffffUL)       /*!< WKUP_POL_P1 (Bitfield-Mask: 0xffffffff)               */
/* ====================================================  WKUP_POL_P2_REG  ==================================================== */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Pos (0UL)                /*!< WKUP_POL_P2 (Bit 0)                                   */
#define WAKEUP_WKUP_POL_P2_REG_WKUP_POL_P2_Msk (0x7fffUL)           /*!< WKUP_POL_P2 (Bitfield-Mask: 0x7fff)                   */
/* ==================================================  WKUP_RESET_IRQ_REG  =================================================== */
#define WAKEUP_WKUP_RESET_IRQ_REG_WKUP_IRQ_RST_Pos (0UL)            /*!< WKUP_IRQ_RST (Bit 0)                                  */
#define WAKEUP_WKUP_RESET_IRQ_REG_WKUP_IRQ_RST_Msk (0xffffUL)       /*!< WKUP_IRQ_RST (Bitfield-Mask: 0xffff)                  */
/* =================================================  WKUP_SEL1_GPIO_P0_REG  ================================================= */
#define WAKEUP_WKUP_SEL1_GPIO_P0_REG_WKUP_SEL1_GPIO_P0_Pos (0UL)    /*!< WKUP_SEL1_GPIO_P0 (Bit 0)                             */
#define WAKEUP_WKUP_SEL1_GPIO_P0_REG_WKUP_SEL1_GPIO_P0_Msk (0xffffffffUL) /*!< WKUP_SEL1_GPIO_P0 (Bitfield-Mask: 0xffffffff)   */
/* =================================================  WKUP_SEL1_GPIO_P1_REG  ================================================= */
#define WAKEUP_WKUP_SEL1_GPIO_P1_REG_WKUP_SEL1_GPIO_P1_Pos (0UL)    /*!< WKUP_SEL1_GPIO_P1 (Bit 0)                             */
#define WAKEUP_WKUP_SEL1_GPIO_P1_REG_WKUP_SEL1_GPIO_P1_Msk (0xffffffffUL) /*!< WKUP_SEL1_GPIO_P1 (Bitfield-Mask: 0xffffffff)   */
/* =================================================  WKUP_SEL1_GPIO_P2_REG  ================================================= */
#define WAKEUP_WKUP_SEL1_GPIO_P2_REG_WKUP_SEL1_GPIO_P2_Pos (0UL)    /*!< WKUP_SEL1_GPIO_P2 (Bit 0)                             */
#define WAKEUP_WKUP_SEL1_GPIO_P2_REG_WKUP_SEL1_GPIO_P2_Msk (0x7fffUL) /*!< WKUP_SEL1_GPIO_P2 (Bitfield-Mask: 0x7fff)           */
/* ==================================================  WKUP_SELECT_P0_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P0_REG_WKUP_SELECT_P0_Pos (0UL)          /*!< WKUP_SELECT_P0 (Bit 0)                                */
#define WAKEUP_WKUP_SELECT_P0_REG_WKUP_SELECT_P0_Msk (0xffffffffUL) /*!< WKUP_SELECT_P0 (Bitfield-Mask: 0xffffffff)            */
/* ==================================================  WKUP_SELECT_P1_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P1_REG_WKUP_SELECT_P1_Pos (0UL)          /*!< WKUP_SELECT_P1 (Bit 0)                                */
#define WAKEUP_WKUP_SELECT_P1_REG_WKUP_SELECT_P1_Msk (0xffffffffUL) /*!< WKUP_SELECT_P1 (Bitfield-Mask: 0xffffffff)            */
/* ==================================================  WKUP_SELECT_P2_REG  =================================================== */
#define WAKEUP_WKUP_SELECT_P2_REG_WKUP_SELECT_P2_Pos (0UL)          /*!< WKUP_SELECT_P2 (Bit 0)                                */
#define WAKEUP_WKUP_SELECT_P2_REG_WKUP_SELECT_P2_Msk (0x7fffUL)     /*!< WKUP_SELECT_P2 (Bitfield-Mask: 0x7fff)                */
/* =================================================  WKUP_SEL_GPIO_P0_REG  ================================================== */
#define WAKEUP_WKUP_SEL_GPIO_P0_REG_WKUP_SEL_GPIO_P0_Pos (0UL)      /*!< WKUP_SEL_GPIO_P0 (Bit 0)                              */
#define WAKEUP_WKUP_SEL_GPIO_P0_REG_WKUP_SEL_GPIO_P0_Msk (0xffffffffUL) /*!< WKUP_SEL_GPIO_P0 (Bitfield-Mask: 0xffffffff)      */
/* =================================================  WKUP_SEL_GPIO_P1_REG  ================================================== */
#define WAKEUP_WKUP_SEL_GPIO_P1_REG_WKUP_SEL_GPIO_P1_Pos (0UL)      /*!< WKUP_SEL_GPIO_P1 (Bit 0)                              */
#define WAKEUP_WKUP_SEL_GPIO_P1_REG_WKUP_SEL_GPIO_P1_Msk (0xffffffffUL) /*!< WKUP_SEL_GPIO_P1 (Bitfield-Mask: 0xffffffff)      */
/* =================================================  WKUP_SEL_GPIO_P2_REG  ================================================== */
#define WAKEUP_WKUP_SEL_GPIO_P2_REG_WKUP_SEL_GPIO_P2_Pos (0UL)      /*!< WKUP_SEL_GPIO_P2 (Bit 0)                              */
#define WAKEUP_WKUP_SEL_GPIO_P2_REG_WKUP_SEL_GPIO_P2_Msk (0x7fffUL) /*!< WKUP_SEL_GPIO_P2 (Bitfield-Mask: 0x7fff)              */
/* ==================================================  WKUP_STATUS_P0_REG  =================================================== */
#define WAKEUP_WKUP_STATUS_P0_REG_WKUP_STAT_P0_Pos (0UL)            /*!< WKUP_STAT_P0 (Bit 0)                                  */
#define WAKEUP_WKUP_STATUS_P0_REG_WKUP_STAT_P0_Msk (0xffffffffUL)   /*!< WKUP_STAT_P0 (Bitfield-Mask: 0xffffffff)              */
/* ==================================================  WKUP_STATUS_P1_REG  =================================================== */
#define WAKEUP_WKUP_STATUS_P1_REG_WKUP_STAT_P1_Pos (0UL)            /*!< WKUP_STAT_P1 (Bit 0)                                  */
#define WAKEUP_WKUP_STATUS_P1_REG_WKUP_STAT_P1_Msk (0xffffffffUL)   /*!< WKUP_STAT_P1 (Bitfield-Mask: 0xffffffff)              */
/* ==================================================  WKUP_STATUS_P2_REG  =================================================== */
#define WAKEUP_WKUP_STATUS_P2_REG_WKUP_STAT_P2_Pos (0UL)            /*!< WKUP_STAT_P2 (Bit 0)                                  */
#define WAKEUP_WKUP_STATUS_P2_REG_WKUP_STAT_P2_Msk (0x7fffUL)       /*!< WKUP_STAT_P2 (Bitfield-Mask: 0x7fff)                  */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* DA1470X_H */


/** @} */ /* End of group DA1470x */

/** @} */ /* End of group PLA_BSP_REGISTERS */
